{"name": "Flare", "children": [{"name": "CROSS-FUNCTIONAL KNOWLEDGE & SKILLS", "children": [{"name": "Critical Thinking", "children": [{"name": "null", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize Critical Thinking and fundamental concepts including: conclusions and decisions, beliefs and claims, finding of evidence, evaluating evidence, inferring and inferences, facts and opinions, facts and probable truths, false and probably false, facts/probably true/probably false, Venn diagrams, logical connectives, arguments, valid and invalid arguments, fallacies, and analogy argument", "value": "1"}, {"name": "Compare/Contrast the following types of biases: cognitive, conformity, affinity, attribution, confirmation, implicit, halo effect, horns effect, contrast effect", "value": "1"}]}, {"name": "Application (A)", "children": [{"name": "Identifies and compensates for bias when performing analysis tasks", "value": "1"}, {"name": "Select (identifies, locates, and obtains) essential information efficiently and effectively", "value": "1"}, {"name": "Separate (identifies, defines, and decomposes) problems into parts to facilitate a search for a solution", "value": "1"}, {"name": "Produce ideas about a given topic and apply old ideas to new situations or in new combinations", "value": "1"}, {"name": "Interpret and apply (synthesize and integrate) information into meaningful concepts and ideas", "value": "1"}, {"name": "Interpret a set of facts, discern patterns or trends, and differentiate the consequences of action relevant to the user", "value": "1"}]}, {"name": "Mastery/UGP (M/U)", "children": [{"name": "Demonstrate analytical critical thinking skills – Consider an issue, problem, set of data, or a text. Evaluate information, its meaning and representation by: asking thoughtful questions, data analysis, information seeking, judgement, questioning evidence, recognizing difference and similarities and skepticism", "value": "1"}, {"name": "Demonstrate communication critical thinking skills – Relate your conclusions with employers or with a group of colleagues. Communicate with others to share ideas. Work with others and communicate effectively to evaluate and develop solutions to complex problems by: asking important questions, assessment, collaboration/teamwork, explanation, expressing opinions and ideas, interpersonal, presentation, verbal communication, and written communication", "value": "1"}, {"name": "Demonstrate creativity - Critical thinking involves some level of creativity. Determine patterns in the information or design an innovative solution by: cognitive flexibility, conceptualization, curiosity, imagination, prediction, foresight making abstract connections, making inferences, and being visionary", "value": "1"}, {"name": "Demonstrating open-mindedness - Put aside any assumptions or judgments and merely evaluate the information received. Be objective, evaluate ideas without bias by: embracing different cultural perspectives, humility, being inclusive, objectivity, observative, reflection, and fairness", "value": "1"}, {"name": " Demonstration problem Solving – Evaluate a problem, develop a solution, plan to implement, and verify with a follow-up assessment by: applying standards, attention to detail, clarification, decision making, evaluation, groundedness, identifying patterns, innovation, and use of logical reasoning", "value": "1"}]}]}]}, {"name": "Reporting", "children": [{"name": "null", "children": [{"name": "Foundational (F)", "children": [{"name": "Compile written reports that are: relevant, organized logically, accurate, and succinct", "value": "1"}]}, {"name": "Application (A)", "children": [{"name": "Present ideas, information, and facts clearly and appropriately ", "value": "1"}, {"name": "Provide tailored verbal, written, and other forms of communication to intended purpose and audience ", "value": "1"}, {"name": "Use language conventions of spelling, punctuation, and grammar", "value": "1"}, {"name": "Use organizational style guides and protocols", "value": "1"}, {"name": "Present all appropriate sources of information", "value": "1"}, {"name": "Provide all assumptions made when generating reports", "value": "1"}, {"name": "Produce products according to the organization, industry, and/or professional standards", "value": "1"}, {"name": "Produce products without bias and misinformation", "value": "1"}, {"name": "Choose to solicit constructive feedback from peers in an iterative manner", "value": "1"}, {"name": "Provide synthesized recommendations to produce improved products, services, and processes", "value": "1"}, {"name": "Clearly articulates existing model assumptions.", "value": "1"}, {"name": "Provides probabilities for competing/alternative scenarios.", "value": "1"}, {"name": "Accounts for potential negative consequences associated with a geographic setting and the cultural, historical, political, and economic factors (i.e., the potential for bad assumption is explained).", "value": "1"}]}, {"name": "Mastery/UGP (M/U)", "children": [{"name": "Verify quality control checks", "value": "1"}, {"name": "Develop and plan courses of action if appropriate", "value": "1"}, {"name": "Strategize organizational implications (or “so what”)", "value": "1"}]}]}]}, {"name": "Synthesis", "children": [{"name": "null", "children": [{"name": "Foundational (F)", "children": [{"name": "Compile (identifies, locates, and obtains) essential information efficiently and effectively", "value": "1"}, {"name": "Condense (identifies, defines, and decomposes) problems into parts to facilitate a search for a solution", "value": "1"}, {"name": "Recap by synthesizing and integrating information into meaningful concepts and ideas", "value": "1"}, {"name": "Summarize a set of facts, recognizes patterns or trends, and determines the consequences of action relevant to the user", "value": "1"}]}, {"name": "Application (A)", "children": [{"name": "The competency of amalgamation includes the following tasks: select (identifies, locates, and obtains) essential information, separate (identifies, defines, and decomposes) problems into parts to facilitate a search for a solution, use statistical methods to differentiate between correlation and causation, produce ideas about a given topic and apply old ideas to new situations or in new combinations, produce ideas about a given topic and apply old ideas to new situations or in new combinations, interpret and apply (synthesize and integrate) information into meaningful concepts and ideas, produce automated, repeatable workflows and modeling, interpret a set of facts, discern patterns or trends, and differentiate the consequences of action relevant to the user.", "value": "1"}, {"name": "Identify appropriate resources for assessing the influence of geographic setting and the cultural, historical, political, and economic factors associated with the study/subject.", "value": "1"}, {"name": "Integrate Subject Matter Expert (SME) opinions and evaluations into the synthesis process.", "value": "1"}, {"name": "Offer alternative scenarios which account for the influence of geographic setting and the cultural, historical, political, and economic factors associated with the study/subject, and provide a probability of likelihood for each offer (i.e., forecast).", "value": "1"}]}, {"name": "Mastery/UGP (M/U)", "children": [{"name": "At the mastery level, demonstrate synthesis by the following: use statistical methods to differentiate between correlation and causation, develop ideas about a given topic by assembling and constructing new situations in new combinations from old ideas, design and plan automated, repeatable workflows and modeling", "value": "1"}]}]}]}, {"name": "Collaboration", "children": [{"name": "null", "children": [{"name": "Foundational (F)", "children": [{"name": "Recognize importance of interacting with others in a friendly, courteous, and tactful manner that demonstrates respect for individual and cultural differences and the attitudes and feelings of others", "value": "1"}, {"name": "Accurately recall professional geospatial lexicon", "value": "1"}, {"name": "Recognize importance of working cooperatively and collaboratively with others to achieve goals through sharing or integrating ideas, knowledge, skills, information, support, resources, responsibility, and recognition", "value": "1"}]}, {"name": "Application (A)", "children": [{"name": "Choose to respond by interacting with others in a friendly, courteous, and tactful manner that demonstrates respect for individual and cultural differences and the attitudes and feelings of others", "value": "1"}, {"name": "Accurately use professional geospatial lexicon,", "value": "1"}, {"name": "Select and apply correct use of terms for management of geospatial production, e.g., AGILE, waterfall, etc.", "value": "1"}, {"name": "Carry out work cooperatively and collaboratively with others to achieve goals through sharing or integrating ideas, knowledge, skills, information, support, resources, responsibility, and recognition", "value": "1"}, {"name": "Choose to facilitate agreements that involve sharing or exchanging resources across industry or security domains to promote mutual goals and interest", "value": "1"}, {"name": "Respond by persuading others to change their points of view or behavior without losing support (or accepting the opposing views of others)", "value": "1"}, {"name": "Apply conflict resolution to disagreements", "value": "1"}, {"name": "Use professional networks to carry out cooperative partnerships that help attain goals", "value": "1"}]}, {"name": "Mastery/UGP (M/U)", "children": [{"name": "Arrange to establish mentor-protégé relationships, as appropriate", "value": "1"}]}]}]}]}, {"name": "DATA VISUALIZATION (DV)", "children": [{"name": "T1. Scale (e.g., precision or accuracy of measure)", "children": [{"name": "Units of measure", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Demonstrate basic understanding of units of measure", "value": "1"}]}]}, {"name": "Relationship between Precision/accuracy and data quantity", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Define precision and accuracy.", "value": "1"}, {"name": "Distinguish the difference between precision and accuracy and how each impact data quantity.", "value": "1"}]}]}, {"name": "Relationship between scale and product sizing", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the relationship between scale and the size of a visualization product.", "value": "1"}]}]}, {"name": "Absolute vs. relative", "children": [{"name": "Foundational (F)", "children": [{"name": "Define absolute scale and relative scale.", "value": "1"}]}]}, {"name": "Foundational (F)", "children": [{"name": "Foundational (F)", "children": [{"name": "Categorize when it is more appropriate to use an absolute scale versus a relative scale.", "value": "1"}]}]}, {"name": "Relationship between uncertainty, precision, accuracy, and scale", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the similarities and differences between the concepts of uncertainty, precision, accuracy and scale.", "value": "1"}]}]}, {"name": "Implementation of scale as a paradigm", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize why scale is important to map measurement.", "value": "1"}]}]}, {"name": "Implementation of scale for cartographic product", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline the when each type of scale is used on a map.", "value": "1"}]}]}, {"name": "Differences with how scale is communicated and depicted on a map", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline the differences between how scale is communicated and how it depicted on a map.", "value": "1"}]}]}, {"name": "Basic Cartography", "children": [{"name": "Foundational (F)", "children": [{"name": "List the elements and principles of basic cartography.", "value": "1"}, {"name": "Summarize how the elements and principles of cartography interact with each other.", "value": "1"}]}]}, {"name": "Methods of depicting and implementing", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate methods of depicting and implementing scale as a visualization concept.", "value": "1"}]}]}, {"name": "Implications of depicting and implementing data visualization", "children": [{"name": "Application (A)", "children": [{"name": "Discern implications of depicting and implementing data visualization.", "value": "1"}]}]}, {"name": "Domain-specific application for a given problem", "children": [{"name": "Application (A)", "children": [{"name": "Present domain-specific application of scale for a given problem.", "value": "1"}]}]}, {"name": "Generalization", "children": [{"name": "Application (A)", "children": [{"name": "Summarize the relationship between generalization and scale.", "value": "1"}, {"name": "Summarize how generalization is used for small scales versus large scales.", "value": "1"}]}]}, {"name": "New representations and approaches for applying scale to data structures and cartographic products", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Design new representations and approaches for applying scale to data structures and cartographic products.", "value": "1"}]}]}, {"name": "New representations and approaches for applying scale to domain-specific applications", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Design new representations and approaches for applying scale to domain-specific applications (e.g., dynamic scales).", "value": "1"}]}]}, {"name": "How to explain the differences in use of relative and absolute scale", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Define the differences between how relative and absolute scales are talked about and used on maps.", "value": "1"}]}]}, {"name": "Ability to create multiple visualizations and interpret them", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Construct multiple visualizations of a map so that it may be tailored to fit the needs of several different products. ", "value": "1"}]}]}]}, {"name": "T2. Color", "children": [{"name": "Color Wheel/Color Theory", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain color wheel/color theory fundamentals.", "value": "1"}]}]}, {"name": "Complementing colors", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Distinguish between complementary and contrasting colors.", "value": "1"}]}]}, {"name": "Contrasting colors", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "Print color models", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the following color models: RGB, HSV, CMYK, BW", "value": "1"}, {"name": "Outline common feature colors.", "value": "1"}]}]}, {"name": "Water is blue, Land is brown/green, Etc.", "children": [{"name": "Foundational (F)", "children": [{"name": "List terrain color features (e.g., water is blue, land is brown/green, etc.).", "value": "1"}]}]}, {"name": "Color Scale/Ramps", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize color scales and color ramps.", "value": "1"}]}]}, {"name": "Color Themes for human event types like Conflict, Damaged infrastructure, ", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize color themes for human induced phenomena (e.g., conflict, damaged infrastructure, etc.).", "value": "1"}]}]}, {"name": "Advanced forms imagery coloring", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate advanced forms of imagery color display concepts for single-band and multi-band imagery.", "value": "1"}]}]}, {"name": "Panchromatic", "children": [{"name": "Application (A)", "children": [{"name": "", "value": "1"}]}]}, {"name": "Near Infrared", "children": [{"name": "Application (A)", "children": [{"name": "", "value": "1"}]}]}, {"name": "Comprehensive knowledge of graphic design and hierarchy of information", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Establish comprehensive knowledge of graphic design and hierarchy of information with use of color.", "value": "1"}]}]}, {"name": "Knowledge of how color as a graphic design element can be used to make an eye-catching product", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate knowledge of how color as a graphic design element can be used to create products that are easily understood.", "value": "1"}]}]}]}, {"name": "T3. Textual Elements (e.g., fonts)", "children": [{"name": "Font Families", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Demonstrate basic literacy of textual elements to include Font Families, Serif vs. Sans-Serif, Bold/Underline/Italics and Font size.", "value": "1"}]}]}, {"name": "Lettering conventioins", "children": [{"name": "Foundational (F)", "children": [{"name": "List common map lettering conventions (e.g., country names in all caps).", "value": "1"}]}]}, {"name": "Keeping titles short and concise", "children": [{"name": "Foundational (F)", "children": [{"name": "List effective title features and principles (e.g., keeping titles short and concise).", "value": "1"}]}]}, {"name": "Appropriate feature labeling (colors, sizes, fonts, etc.)", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize appropriate feature labeling approaches (e.g., colors, sizes, fonts, etc.).", "value": "1"}]}]}, {"name": "Distribution and placement of labels, contextual information, etc.", "children": [{"name": "Application (A)", "children": [{"name": "Select proper distribution and placement of labels, contextual information, etc.", "value": "1"}]}]}, {"name": "Abbreviations ", "children": [{"name": "Application (A)", "children": [{"name": "Interpret domain-specific abbreviations (or jargon).", "value": "1"}]}]}, {"name": "When to display text interactively (For interactive maps; scale dependent text, not displaying labels for layers that are currently out of scale)", "children": [{"name": "Application (A)", "children": [{"name": "Discern when to display text interactively (for interactive maps; scale dependent text, not displaying labels for layers that are currently out of scale).", "value": "1"}]}]}, {"name": "Mastery of Fonts", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Implement appropriate use of fonts and typographical emphases (e.g., bold, underline, italicize) when using text on a map.", "value": "1"}]}]}, {"name": "Complete understanding of textual options within maps and how they convey information to the end user", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Integrate various textual options within maps to appropriately convey information to the end user.", "value": "1"}]}]}]}, {"name": "T4. Contrast", "children": [{"name": "Ability to differentiate between visual media", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Differentiate between different visual media types including static products and interactive products.", "value": "1"}]}]}, {"name": "Concept that objects can stand out from others", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain concept that objects can stand out from others.", "value": "1"}]}]}, {"name": "Recognition that some things are more eye-catching than others", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Distinguish the visual impact between objects and features.", "value": "1"}]}]}, {"name": "Complementary colors", "children": [{"name": "Foundational (F)", "children": [{"name": "List effective variations in visual contrast (such as complementary colors, brightness, saturation, transparency, size and position).", "value": "1"}]}]}, {"name": "Drop Shadow", "children": [{"name": "Application (A)", "children": [{"name": "Present proper contrast features (such as drop shadow and blending of colors and features).", "value": "1"}]}]}, {"name": "Gradients vs. Discrete colors", "children": [{"name": "Application (A)", "children": [{"name": "Distinguish between gradients and discrete colors.", "value": "1"}]}]}, {"name": "Blending of colors and features", "children": [{"name": "Application (A)", "children": [{"name": "", "value": "1"}]}]}, {"name": "Ability to take several overlapping features on a single map and differentiate them from one another without compromising information", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Construct a single map with several overlapping features and differentiate them from one another without compromising information.", "value": "1"}]}]}]}, {"name": "T5. Hierarchy", "children": [{"name": "The concept that some things are more important than others", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain concept that the presentation of features on a map implies relative importance which is achieved with visual contrast (e.g., size, color, brightness, etc.).", "value": "1"}]}]}, {"name": "Conveying importance through size, color, brightness, etc.…", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "Relevance", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "Positioning/placement", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline effective visual hierarchy features (such as positioning/placement, how to label, justification and relationship between features).", "value": "1"}]}]}, {"name": "How to label", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "Justification (center, left, right, etc.…)", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "Relationship between features", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "Objective of the map", "children": [{"name": "Application (A)", "children": [{"name": "Provide objective of the map.", "value": "1"}, {"name": "Interpret the end user’s objective for using a map (e.g., reference tool, information gathering tool, analytical tool) to determine the best way for the information to be depicted.", "value": "1"}]}]}, {"name": "Proper Naming conventions", "children": [{"name": "Application (A)", "children": [{"name": "Select proper naming conventions.", "value": "1"}]}]}, {"name": "Industry language", "children": [{"name": "Application (A)", "children": [{"name": "Choose proper industry language.", "value": "1"}, {"name": "Determine when it appropriate to use proper industry language (e.g., initialisms, acronyms) based on the end user population.", "value": "1"}]}]}, {"name": "Ability to draw the attention of the viewer to features/information in the order that is relevant to communicating the purpose of the map", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Establish methods of sizing features/information and positioning features/information in an order that will effectively communicate a map’s purpose. ", "value": "1"}]}]}]}, {"name": "T6. Conceptualizing a Layout (e.g., white space)", "children": [{"name": "Balance", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Demonstrate basic understanding of layout conceptualization to include balance, positioning and featuring spatial relationships.", "value": "1"}]}]}, {"name": "Positioning", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "Feature relationships", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "Ability to use proximity of empty space on a map in tandem with features on a map", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline proper use of empty space and features on a map.", "value": "1"}]}]}, {"name": "Placing Labels and Text appropriately", "children": [{"name": "Foundational (F)", "children": [{"name": "List effective map annotation (e.g., placing labels and text appropriately).", "value": "1"}]}]}, {"name": "Legend and graphic placement", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize effective legend and graphic placement.", "value": "1"}]}]}, {"name": "Distinguish plain white space from less significant mapped areas", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate plain white space from less significant mapped areas.", "value": "1"}]}]}, {"name": "Ability to fit multiple and sometimes complex graphics, labels, supporting text, legends, and other features to support the mapped area without compromising content", "children": [{"name": "Application (A)", "children": [{"name": "Integrate multiple and sometimes complex graphics, labels, supporting text, legends, and other features to support the mapped area without compromising content.", "value": "1"}]}]}, {"name": "Advanced understanding of hierarchy of information and ability to create flow that draws the attention of the viewer", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Establish techniques for utilizing white space and isolating elements to design a layout that will draw the attention of the viewer and establish a hierarchy of information.", "value": "1"}]}]}]}, {"name": "T7. Psychology of Representation (e.g., Gestalt Principles)", "children": [{"name": "Knowledge of basic map elements and features like mapped area, legends, titles, scale bar etc.", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain basic map elements and features to include mapped area, legends, titles and scale bar.", "value": "1"}]}]}, {"name": "Entry level of understanding of symbology and common map representations", "children": [{"name": "Prerequisites (P)", "children": [{"name": "List basic symbology and common map representations.", "value": "1"}]}]}, {"name": "Ability to distinguish between the main and secondary features/objectives", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how imagery elements (e.g., color, vibrancy, size, transparency) are used to differentiate main and secondary features/objectives.", "value": "1"}]}]}, {"name": "Gestault Principles", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize Gestalt principles of design (e.g., proximity, similarity, continuity, closure and figure/ground).", "value": "1"}]}]}, {"name": "Comprehensive understanding of legibility, Figure-ground, Hierarchy, and Balance", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between various representation features (e.g., legibility, figure-ground, hierarchy, and balance).", "value": "1"}]}]}, {"name": "Ability to incorporate many features at varying pronounced levels in tandem with each other", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate current methods of incorporating numerous features of varying pronounced levels on a map and construct new techniques to mitigate against user error.", "value": "1"}]}]}]}, {"name": "T8. Maps (e.g., reference vs. thematic)", "children": [{"name": "Map Types", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Distinguish between different map types (such as, thematic, reference, topographic, flow, choropleth, cartograms, and image maps).", "value": "1"}]}]}, {"name": "Understanding of which types of maps are used in the Geospatial Intelligence (GEOINT) community", "children": [{"name": "Foundational (F)", "children": [{"name": "List the different types of maps used in the Geospatial Intelligence (GEOINT) community and explain how each map is used.", "value": "1"}]}]}, {"name": "Ability to view information and data and determine which type of map would best communicate that information", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate which type of map would best communicate information given the type of data.", "value": "1"}]}]}, {"name": "Ability to blend multiple map types to convey the most information without sacrificing content and meaning", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Construct multiple, blended map types to convey the most information without sacrificing content and meaning.", "value": "1"}]}]}]}, {"name": "T9. Graphs (e.g., bar graph, line graph, pie chart)", "children": [{"name": "Types of Graphs", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain coordinate system fundamentals (such as types of graphs, how to make graphs, how certain graphs should be used, and which graph is best for showing certain types of information).", "value": "1"}]}]}, {"name": "How to make graphs", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "How certain graphs should be used", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "Which graph is best for showing certain types of information", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "The size and importance of a graph", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize effective display of graph features (e.g., size and importance of a graph and relevance to a map).", "value": "1"}]}]}, {"name": "Relevance of a graph to a map", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "Common types of graphs used in the Geospatial Intelligence (GEOINT) community", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between the common types of graphs used in the Geospatial Intelligence (GEOINT) community and explain how each can be used in a map.", "value": "1"}]}]}, {"name": "Ability to mix graphs and maps at a mastery level", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Group and assemble graphs and maps.", "value": "1"}]}]}, {"name": "Using graphs as legends", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Establish standards for when it is appropriate to merge graphs and legends together in order to depict more information on a map.", "value": "1"}]}]}]}, {"name": "T10. 3D Representation (e.g., anaglyph vs. polarization, hologram, model)", "children": [{"name": "Basic concepts", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain basic concepts of 3D representation (such as depth, perception, perspective and aspect).", "value": "1"}]}]}, {"name": " Purpose of 3D visualization and when its use is appropriate", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize purpose of 3D visualization and when it is appropriate to use.", "value": "1"}]}]}, {"name": "Delivery methods", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize understanding of 3D representation delivery methods (such as digital display, static display and video).", "value": "1"}]}]}, {"name": "Importance of Terrain, Interpreting 3D from contour lines, and representation of modes for effective visualization of natural & social phenomena", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how contour lines can be used to interpret three dimensional (3D) objects.", "value": "1"}, {"name": "Summarize why understanding terrain is importance when using or developing a map.", "value": "1"}, {"name": "Outline the modes of visualizing terrain-related natural and social phenomena.", "value": "1"}]}]}, {"name": "Understanding of graphic design principles that render static products in 3D", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between graphic design principles that add perspective to static products to transform them in 3D products.", "value": "1"}]}]}, {"name": "Ability to take data that is not inherently 3D and extrude it in 3D for perspective", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Create 3D elements from data that is not inherently 3D (e.g., numerical attributes) to emphasize information.", "value": "1"}]}]}]}, {"name": "T11. Interactive (e.g., web page, story map)", "children": [{"name": "Knowledge of types of Interactive media", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain types of interactive media (e.g., WebMaps, WebApps, Google Application-Program Interface [API], Open Source, JavaScript Maps and Clickable Standard Vector Graphics [SVGs]).", "value": "1"}]}]}, {"name": "Network/Bandwidth considerations", "children": [{"name": "Foundational (F)", "children": [{"name": "Categorize interactive mapping elements that may be affected by users’ network connection and/or bandwidth conditions.", "value": "1"}]}]}, {"name": "Types of Features used in interactive mapping", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize types of features used in interactive mapping (e.g., Keyhole Markup Language [KML], Keyhole Markup Zipped [KMZ], Web Mapping Service [WMS], Web Feature Service [WFS], feature services, image services and tiling).", "value": "1"}]}]}, {"name": "How to publish these services to the web", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how to publish interactive mapping services to the web.", "value": "1"}]}]}, {"name": "Network specific security", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between the various network specific security features and explain when each may be used.", "value": "1"}]}]}, {"name": "Layer and map permissions", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast how to implement layer and map permissions.", "value": "1"}]}]}, {"name": "How to adjust symbols, popup boxes, and other attributes of the web map", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how to adjust symbols, popup boxes, and other attributes of the web map.", "value": "1"}]}]}, {"name": "How to add additional functionality to web applications (widgets, etc.)", "children": [{"name": "Application (A)", "children": [{"name": "Distinguish how to add additional functionality to web applications (widgets, etc.).", "value": "1"}]}]}, {"name": "Open Geospatial Consortium (OGC) Standards", "children": [{"name": "Application (A)", "children": [{"name": "Characterize between Open Geospatial Consortium (OGC) standards and how they impact interactive data visualization. ", "value": "1"}]}]}, {"name": "Ability to write custom functions like widgets", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Develop custom functions like widgets to add greater functionality to web apps.", "value": "1"}]}]}, {"name": "Ability to customize web applications look and feel with the use of CSS, SESS, and other Style Sheets", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Design customized web applications for interactive maps with the use of Cascading Style Sheets (CSS), Syntactically Awesome Style Sheets (SASS), Leaner Style Sheets (LESS), and other Style Sheets.", "value": "1"}]}]}, {"name": "Increase functions by adding statistical and analytical tools", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Generate interactive charts and graphics using statistical and analytical tools to expand the functionality of maps.", "value": "1"}]}]}]}, {"name": "T12. Animations (e.g., virtual tour, animated story maps)", "children": [{"name": "Understanding of chronology, that data can be collected over time and then animated", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain the concept of chronology as it relates to visualization (that data can be collected over time and then animated).", "value": "1"}]}]}, {"name": "Common forms of story maps", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify common types of story maps and explain how each is used to display information.", "value": "1"}]}]}, {"name": "Types of animation", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize types of animation (e.g., spatial movement, time series and data extrusion).", "value": "1"}]}]}, {"name": "Ability to create products that lead the viewer through a web interface calling attention to new information along the way", "children": [{"name": "Application (A)", "children": [{"name": "Design products that lead the viewer through a web interface calling attention to new information along the way.", "value": "1"}]}]}, {"name": "Ability to create complete products that convey a wealth of information through use of not just maps, but graphics, pictures, and text", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Integrate graphics, pictures, and text with a map to produce a more complete product that conveys more information than a traditional map.", "value": "1"}]}]}]}, {"name": "T13. Temporal Representation (e.g., conceptualization of time)", "children": [{"name": "Additive time series", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Demonstrate understanding of temporal representation fundamentals (such as additive time series and interval time series).", "value": "1"}]}]}, {"name": "Interval times series", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "Exact time vs time span", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Distinguish between exact time and time span.", "value": "1"}]}]}, {"name": "Knowledge of how to organize temporal data", "children": [{"name": "Foundational (F)", "children": [{"name": "Recall concepts and principles of temporal data organization.", "value": "1"}]}]}, {"name": "Entry level understanding of normalizing data", "children": [{"name": "Foundational (F)", "children": [{"name": "Recall concepts and principles for normalizing data.", "value": "1"}]}]}, {"name": "Restrictions of time enabled data and the limitations that may arise", "children": [{"name": "Application (A)", "children": [{"name": "Discern restrictions of time enabled data and the limitations that may arise.", "value": "1"}]}]}, {"name": "Gaps or missing information", "children": [{"name": "Application (A)", "children": [{"name": "Determine gaps or missing information in temporal data.", "value": "1"}]}]}, {"name": "Inconsistent record keepings", "children": [{"name": "Application (A)", "children": [{"name": "Discern and respond to inconsistent record keepings (e.g., date and time formats).", "value": "1"}]}]}, {"name": "Inconsistent date and time formats", "children": [{"name": "Application (A)", "children": [{"name": "", "value": "1"}]}]}, {"name": "Ability to normalize time that has not been collected consistently or accurately and make sense of it", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Establish standards for normalizing time when data has not been collected consistently or accurately. ", "value": "1"}]}]}]}, {"name": "T14. Direction (e.g., rotation, orientation)", "children": [{"name": "Understanding of directionality on a map", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain directionality on a map and how to use the common North Arrow.", "value": "1"}]}]}, {"name": "Entry level understanding of projections", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the different types of map projections and how each is used.", "value": "1"}]}]}, {"name": "Comprehensive understanding of projections and best types for given situations", "children": [{"name": "Application (A)", "children": [{"name": "Illustrate the best type of projections for a given situation.", "value": "1"}]}]}, {"name": "Ability to Challenge understandings of common map displays by changing orientation to adapt a new perspective", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Rearrange orientation of common map displays to adapt a new perspective.", "value": "1"}, {"name": "Generate new map displays that challenge current common practices in order to adapt to new perspectives.", "value": "1"}]}]}]}, {"name": "T15. Projection and Coordinate Systems", "children": [{"name": "Understanding that the world is spherical, and most maps are not", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Demonstrate understanding of projection and coordinate systems fundamentals (to include knowledge that the world is spherical whereas most maps are not).", "value": "1"}]}]}, {"name": "2D/3D", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Distinguish between 2D and 3D.", "value": "1"}, {"name": "Summarize how projections and coordinate systems taken from a 3D figure translate to a 2D image.", "value": "1"}]}]}, {"name": "Mathematical coordinate planes", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Demonstrate basic knowledge of mathematical coordinate planes (or the Cartesian plane).", "value": "1"}]}]}, {"name": "Geometry", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Demonstrate a basic understanding of Euclidean geometry fundamentals and use to represent the spatial component of geographic features.", "value": "1"}]}]}, {"name": "Differentiate between the basics of projections, coordinate systems, and datums", "children": [{"name": "Foundational (F)", "children": [{"name": "Distinguish between the basics of projections, coordinate systems, and datums.", "value": "1"}]}]}, {"name": "Common types of projections", "children": [{"name": "Foundational (F)", "children": [{"name": "List common types of Military Grid Reference System (MGRS) projections and coordinate systems.", "value": "1"}]}]}, {"name": "Common coordinate systems", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "Military Grid Reference System (MGRS)", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "Why a Projected Coordinate System (PCS)vis necessary for 2D maps", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize why a Projected Coordinate System (PCS) is necessary for 2D maps.", "value": "1"}]}]}, {"name": "Which projection is appropriate for a scale and extent", "children": [{"name": "Application (A)", "children": [{"name": "Determine which projection(s) is/are appropriate for the scale and extent for a given project.", "value": "1"}]}]}, {"name": "When to use a Projected Coordinate System (PCS) versus Geographic Coordinate System (GCS)", "children": [{"name": "Application (A)", "children": [{"name": "Discern when to use a Projected Coordinate System (PCS) versus Geographic Coordinate System (GCS).", "value": "1"}]}]}, {"name": "Use of Datums", "children": [{"name": "Application (A)", "children": [{"name": "Illustrate how to use datums.", "value": "1"}]}]}, {"name": "Ability to understand the absolute most important aspects of the features being mapped and picking the most optimal projection to preserve the integrity of those features best", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Judge the most important aspects of the features being mapped and select the most optimal projection to preserve the integrity of those features.", "value": "1"}]}]}]}, {"name": "T16. Elements of a Map (e.g., North Arrow, Title, Scale Bar)", "children": [{"name": "Understanding of the purpose of common map elements", "children": [{"name": "Prerequisites (P)", "children": [{"name": "List the common elements that should be included in a map (north arrow, scale, legend, sourcing, title, projection/coordinate system data).", "value": "1"}]}]}, {"name": "Standard formats for common map elements", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how the following elements are incorporated into a map: north arrow, scale, legend, sourcing, title, projection notation.", "value": "1"}]}]}, {"name": "Placement of elements on a map in standard locations in conjunction with each other", "children": [{"name": "Application (A)", "children": [{"name": "Compare and contrast placement of elements on a map in standard locations in conjunction with each other.", "value": "1"}]}]}, {"name": "Ability to adjust the placement and design of such features adaptively to benefit the readability of the final product", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate current standards for using common map elements (e.g., scale, legend, projection notation) and design new techniques that improve readability and usability of final products.", "value": "1"}]}]}]}, {"name": "T17. Symbol Selection/Representation of Features", "children": [{"name": "Common symbology", "children": [{"name": "Prerequisites (P)", "children": [{"name": "List common symbology used and explain their significance.", "value": "1"}]}]}, {"name": "Feature size relevance", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain the relevance of feature size.", "value": "1"}]}]}, {"name": "Natural vs Manmade vs human behavior vs natural occurrences", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Distinguish appropriate symbology for natural, manmade, human behavior and natural occurrences.", "value": "1"}]}]}, {"name": "Common Geospatial Intelligence (GEOINT) symbology and how they differ from general symbology", "children": [{"name": "Foundational (F)", "children": [{"name": "Compare common Geospatial Intelligence (GEOINT) symbology against other general symbology and explain how and why they differ.", "value": "1"}]}]}, {"name": "Types of human behavior and features mapping for Geospatial Intelligence (GEOINT) purposes", "children": [{"name": "Foundational (F)", "children": [{"name": "List types of human behavior and features mapping for Geospatial Intelligence (GEOINT) purposes.", "value": "1"}]}]}, {"name": "Knowledge of best practices for symbolizing features", "children": [{"name": "Application (A)", "children": [{"name": "Apply knowledge of best practices for symbolizing features.", "value": "1"}]}]}, {"name": "Ability to symbolize in new ways in order to convey new meaning or understanding in an improved way", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Develop new symbol selection features in order to convey new meaning or understanding in an improved way.", "value": "1"}]}]}]}, {"name": "T18. Layering", "children": [{"name": "Understanding of feature types like points, lines, and polygons and the purpose of layers", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Demonstrate understanding of feature types like points, lines, and polygons and the purpose of layers.", "value": "1"}]}]}, {"name": "Knowledge of raster as a file format", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Demonstrate knowledge of raster as a file format.", "value": "1"}]}]}, {"name": "Knowledge of common formats used to symbolize points, lines, and polygons", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize knowledge of common formats used to symbolize points, lines, and polygons.", "value": "1"}]}]}, {"name": "Understanding of symbolizing raster datasets", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how symbolizing raster datasets differs from symbolizing other datasets. ", "value": "1"}]}]}, {"name": "Knowledge of best practices for layering products on top of each other in a sensical way", "children": [{"name": "Application (A)", "children": [{"name": "Determine how maps that use raster datasets should be assembled so that primary elements are layered appropriately.", "value": "1"}]}]}, {"name": "Knowledge of transparencies and when to use them", "children": [{"name": "Application (A)", "children": [{"name": "Characterize when transparencies should and should not be used in a map.", "value": "1"}]}]}, {"name": "Ability to take many layers on a map and convey significant meaning without losing understanding", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Construct maps that contain multiple layers without obstructing key information that can be understood by a wide variety of audiences.", "value": "1"}]}]}]}, {"name": "T19. Color Mapping (e.g., depiction of imagery and surfaces)", "children": [{"name": "Basic color principles", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain basic color principles to include hue, saturation, color wheels, gradients, complementing colors and contrasting colors.", "value": "1"}]}]}, {"name": "Common types of imagery depictions using color", "children": [{"name": "Foundational (F)", "children": [{"name": "List common types of imagery depictions and explain how they employ color.", "value": "1"}]}]}, {"name": "How common geographic features are generally depicted on maps", "children": [{"name": "Foundational (F)", "children": [{"name": "List common geographic features and explain how they are generally depicted on maps.", "value": "1"}]}]}, {"name": "Advanced forms of imagery collected from various platforms that present features in false color", "children": [{"name": "Application (A)", "children": [{"name": "Interpret and present advanced forms of imagery collected from various platforms that present features in false color.", "value": "1"}]}]}, {"name": "Ability to create products that visualize imagery using color while layering vector features on top in conjunction with the imagery layer", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Design products that visualize imagery using color while layering vector features on top in conjunction with the imagery layer.", "value": "1"}]}]}]}, {"name": "T20. Resolution and Complexity of Features", "children": [{"name": "Pixels", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain pixels and their role as the smallest unit of information in an image or map.", "value": "1"}]}]}, {"name": "Media for communicating information", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Distinguish between various media for communicating information (printing, screen resolution and scaling objects).", "value": "1"}]}]}, {"name": "The importance of scale when determining the resolution of features", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the importance of scale when determining the resolution of features.", "value": "1"}]}]}, {"name": "Common forms of media in the Geospatial Intelligence (GEOINT) community", "children": [{"name": "Application (A)", "children": [{"name": "Compare and contrast how maps are visualized on the most common forms of media in the Geospatial Intelligence (GEOINT) community (e.g., computer monitors, mobile devices, tablets, posters, letter pages, etc.).", "value": "1"}]}]}, {"name": "Common graphic limitations and equipment", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between common graphic limitations and equipment to include printers and screens/displays.", "value": "1"}]}]}, {"name": "Ability to push the line between complexity at lower resolutions in order to deliver high quality products with fewer limitations", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate how to balance image resolution and image complexity in order to deliver high quality products with fewer limitations.", "value": "1"}, {"name": "Design maps that are highly complex but are still viewable/usable at lower resolutions.", "value": "1"}]}]}]}, {"name": "T21. Labeling and Use of Text", "children": [{"name": "Significance of Bolding, Italicizing, size, and color of text", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain the significance of bolding, italicizing, size, and color of text.", "value": "1"}]}]}, {"name": "Understanding of how to place labels close to features without interfering with other features", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain how to place labels close to features without interfering with other features.", "value": "1"}]}]}, {"name": "Basic acronyms and initialisms in the Geospatial Intelligence (GEOINT) community", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify what common acronyms and initialisms in the Geospatial Intelligence (GEOINT) community stand for and mean.", "value": "1"}]}]}, {"name": "Advanced abbreviations of text", "children": [{"name": "Application (A)", "children": [{"name": "Interpret and present advanced abbreviations of text.", "value": "1"}]}]}, {"name": "Ability to simplify and shorten complex descriptions without compromising content", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Design methods for simplifying and shortening complex descriptions without compromising an individual’s ability to understand the content.", "value": "1"}]}]}]}, {"name": "T22. Strategies for Electronic Delivery", "children": [{"name": "Knowledge of common media types like computers, tablets, and smartphones, as well as file types, jpeg, png, pdf, etc.", "children": [{"name": "Prerequisites (P)", "children": [{"name": "List common media types like computers, tablets, and smartphones, as well as file types, Joint Photographic Exerts Group (jpeg), Portable Network Graphic (png), Portable Document Format (PDF), etc. and explain considerations electronic delivery.", "value": "1"}]}]}, {"name": "Understanding of the limitations of media delivery like bandwidth, security, and size restrictions", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize understanding of the limitations of media delivery like bandwidth, security, and size restrictions.", "value": "1"}]}]}, {"name": "Knowledge of best practices for overcoming the limitations of media delivery", "children": [{"name": "Application (A)", "children": [{"name": "Compare and contrast media delivery methods, what limitations each delivery method has, and how to overcome those limitations. ", "value": "1"}]}]}, {"name": "Ability to improve on the current systems in place for media delivery", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Strategize how to improve on the current systems in place for media delivery.", "value": "1"}]}]}]}, {"name": "T23. Device and Network Limitations", "children": [{"name": "Basic understanding of Device processors and Networks", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Demonstrate basic understanding of device processors and networks.", "value": "1"}]}]}, {"name": "Device and network connectivity varies based on devices and location", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how device and network connectivity varies based on devices and location.", "value": "1"}]}]}, {"name": "Knowledge of common restrictions with networks", "children": [{"name": "Application (A)", "children": [{"name": "Apply knowledge of common restrictions with networks.", "value": "1"}]}]}, {"name": "Knowledge of security parameters with networks", "children": [{"name": "Application (A)", "children": [{"name": "Apply knowledge of security parameters with networks.", "value": "1"}]}]}, {"name": "Ability to create products that can be transmitted over low bandwidth connections", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Discern the best method of transmitting a product over low bandwidth connections.", "value": "1"}]}]}]}, {"name": "T24. Resolution of Product", "children": [{"name": "Understanding of Pixels", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize basic concepts relating to pixels (e.g., resolution and history of picture elements).", "value": "1"}]}]}, {"name": "Understanding of different forms of media for delivery and viewing products i.e. printed vs digital", "children": [{"name": "Foundational (F)", "children": [{"name": "Distinguish between different forms of media for delivery and viewing products (i.e., printed versus digital.", "value": "1"}]}]}, {"name": "Knowledge of displays", "children": [{"name": "Foundational (F)", "children": [{"name": "List and summarize the uses of different hardware display systems.", "value": "1"}]}]}, {"name": "Common printer limitations", "children": [{"name": "Foundational (F)", "children": [{"name": "Differentiate between common printer limitations to include printer size and print job quality.", "value": "1"}]}]}, {"name": "Ability to create both static or interactive products with knowledge of how to take into consideration the final viewing platform", "children": [{"name": "Application (A)", "children": [{"name": "Verify a product (i.e., static or interactive) is useable given the resolution the end user will be using (e.g., printed, cell phone, computer, projector, etc.).", "value": "1"}]}]}, {"name": "Ability to create products that are viewable across multiple platforms and resolutions", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Design products that are viewable across multiple platforms and resolutions.", "value": "1"}]}]}]}, {"name": "T25. Virtual and Augmented Reality", "children": [{"name": "Limitations of virtual reality", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize the limitations of virtual and augmented reality.", "value": "1"}]}]}, {"name": "Methods and modes of virtually displaying geospatial data", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Outline the various methods and modes of virtually displaying geospatial data.", "value": "1"}]}]}, {"name": "Experience with visualization tools (e.g. ArcGIS Online, D3.JS, MapBox, Tableau, etc.)", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize the importance visualizing data and list commonly used visualization tools.", "value": "1"}]}]}, {"name": "Knowledge of relational and non-relational database technologies", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Differentiate relational and non-relational database technologies.", "value": "1"}]}]}, {"name": "Combine geospatial data with other domains for virtual visualization", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline how to geospatial data is combined with other domains to create virtual visualization.", "value": "1"}]}]}, {"name": "Provide a geospatial underpinning for a virtual reality", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how to design a geospatial underpinning for a virtual or augmented reality.", "value": "1"}]}]}, {"name": "Ability to design, test, and debug software applying core Virtual reality methodologies ", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how to design, test, and debug software applying core virtual and augmented reality methodologies.", "value": "1"}]}]}, {"name": "Projection, transformations, and accuracies of geospatial data", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the projection, transformations, and accuracies of geospatial data.", "value": "1"}]}]}, {"name": "Limitations of displaying geospatial data virtually", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the advantages and limitations of displaying geospatial data virtually.", "value": "1"}]}]}, {"name": "Synthesizing multiple data sources for virtual display", "children": [{"name": "Application (A)", "children": [{"name": "Determine how multiple data sources should be synthesized in order to create a virtual display.", "value": "1"}]}]}, {"name": "Apply geospatial information as the base to a virtual reality system", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Design a virtual or augmented reality system with geospatial information as the base.", "value": "1"}]}]}]}]}, {"name": "GEOSPATIAL DATA MANAGEMENT", "children": [{"name": "T1. Map Services/Web Mapping Services", "children": [{"name": "1. What are data services", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize the types of data services commonly used for map services/web mapping services.", "value": "1"}]}]}, {"name": "2. Common on-line mapping services (e.g., Mapbox, Google, ArcGIS Online)", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize the major functions of the common online mapping services (e.g., Mapbox, Google, ArcGIS Online).", "value": "1"}]}]}, {"name": "1. Type of data service (e.g., physical versus logical)", "children": [{"name": "Foundational (F)", "children": [{"name": "List the different types of data service (e.g., physical versus logical) and explain when each is used.", "value": "1"}]}]}, {"name": "2. Shape of data service (e.g., entity versus library)", "children": [{"name": "Foundational (F)", "children": [{"name": "Categorize the different shapes of data service (e.g., entity versus library) and explain the importance of each.", "value": "1"}]}]}, {"name": "3. SOA", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize Service-Oriented Architecture (SOA) and explain its role in web mapping services.", "value": "1"}]}]}, {"name": "4. Web mapping file types (e.g., WMS, WFS, feature layers, map images, JSON, GeoJSON)", "children": [{"name": "Foundational (F)", "children": [{"name": "List the different web mapping file types (e.g., Web Mapping Service [WMS], Web Mapping Feature [WMF], feature layers, map images, JavaScript Object Notation [JSON], Geographic JSON [GeoJSON]).", "value": "1"}]}]}, {"name": "How to read and write the following services: XML, REST, SOAP, RPC", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the role of each of the following services in map service and web mapping service: XML, REST, SOAP, and RPC", "value": "1"}]}]}, {"name": "2. Open Geospatial Consortium (OGC) standards", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how Open Geospatial Consortium (OGC) standards are applied to map services and web mapping services", "value": "1"}]}]}, {"name": "1. RESTful services", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate when it is necessary to use REresentational State Transfer (RESTful) services when working with mapping services.", "value": "1"}]}]}, {"name": "1. Basic knowledge of open source/COTS GIS systems", "children": [{"name": "Prerequisites (P)", "children": [{"name": "List the basic principles of open source/Commercial Off-The-Shelf (COTS) Geospatial Information Systems (GIS).", "value": "1"}]}]}, {"name": "1. NSDI", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the National Spatial Data Infrastructure guidelines with regard to interoperability.", "value": "1"}]}]}, {"name": "1. Ability to articulate/deploy open source", "children": [{"name": "Application (A)", "children": [{"name": "Characterize different techniques for articulating and deploying open source data.", "value": "1"}]}]}, {"name": "2. COTS GIS systems", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the different Commercial Off-The-Shelf (COTS) Geospatial Information Systems (GISs) and explain their use in interoperability.", "value": "1"}]}]}, {"name": "3. Use of ETL tools (e.g., Safe Software’s FME)", "children": [{"name": "Application (A)", "children": [{"name": "Discern the different uses of Extract Transform Load (ETL) tools (e.g., Safe Software’s Feature Manipulation Engine [FME]) for interoperability.", "value": "1"}]}]}, {"name": "1. Ability to describe system requirements so developers can expand system offerings and IT professionals can support", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate the system requirements necessary to allow developers to expand system offerings and to support the work of IT professionals.", "value": "1"}]}]}]}, {"name": "T3. Data Sharing", "children": [{"name": "1. Fundamental database management", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Compare/contrast fundamental database management concepts (e.g., cloud storage, file transfers and backups, encryption, file naming conventions and protocols, etc.).", "value": "1"}]}]}, {"name": "2. Basic understanding of the types and functions of common geodatabases", "children": [{"name": "Prerequisites (P)", "children": [{"name": "List the different types of data sharing.", "value": "1"}, {"name": "List the functions of common geodatabases as they relate to data sharing.", "value": "1"}]}]}, {"name": "3. The purpose of a RDBMS and its relevance to maintaining and sharing data", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain the purpose of a Relational DataBase Management System (RDBMS) and its impact on maintaining and sharing data.", "value": "1"}]}]}, {"name": "1. Geodatabase replication", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the principles of geodatabase replication and explain its role in data sharing.", "value": "1"}]}]}, {"name": "2. RDBMS replication", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline the process of Relational DataBase Management System (RDBMS) replication.", "value": "1"}]}]}, {"name": "3. Bandwidth considerations", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize bandwidth considerations that should be considered when sharing data (e.g., uploads, downloads, the first responder’s data, etc.).", "value": "1"}]}]}, {"name": "4. How REST and SOAP services can be used to share data", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how REpresentational State Transfer (REST) and Simple Object Access Protocol (SOAP) services can be used to share data.", "value": "1"}]}]}, {"name": "1. Development environment or project allowing you to learn", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate the best methods used to develop an environment that allows for optimal learning in the context of sharing data.", "value": "1"}]}]}, {"name": "2. How to share data by writing REST and SOAP Services Frequency of revisions", "children": [{"name": "Application (A)", "children": [{"name": "Summarize how to share data by writing REpresentational State Transfer (REST) and Simple Object Access Protocol (SOAP) services and frequency of revisions.", "value": "1"}]}]}, {"name": "1. Automation", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate current methods of data sharing automation to develop more efficient automation techniques.", "value": "1"}]}]}, {"name": "2. Enterprise application integration tools (e.g., MuleSoft)", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate the different enterprise application integration tools (e.g., MuleSoft) and explain their role in data sharing.", "value": "1"}]}]}]}, {"name": "T4. Common Data Dictionary", "children": [{"name": "1. How to clearly define terminology", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Identify how terminology is defined in the common data dictionary and explain how definitions are disseminated.", "value": "1"}]}]}, {"name": "2. How to disseminate definitions", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "1. Which is the relevant information and related attributes that can constitute a common data dictionary", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize what information and attributes make up a common data dictionary.", "value": "1"}]}]}, {"name": "2. Entities versus attributes", "children": [{"name": "Foundational (F)", "children": [{"name": "List the differing principle between entities and attributes.", "value": "1"}]}]}, {"name": "3. NSDI", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the National Spatial Data Infrastructure (NSDI) guidelines and their impact on common data dictionaries.", "value": "1"}]}]}, {"name": "1. Importance of definitions, naming conventions and values", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the importance of definitions, naming conventions, and values with regard to establishing a common data dictionary.", "value": "1"}]}]}, {"name": "1. A design process for dictionary element descriptions", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Develop a design process to establish dictionary element descriptions.", "value": "1"}]}]}]}, {"name": "T5. Naming Conventions", "children": [{"name": "1. Supported naming convention for underlying database", "children": [{"name": "Prerequisites (P)", "children": [{"name": "List the supported naming conventions for underlying databases.", "value": "1"}]}]}, {"name": "2. Upper case/lower case/camel case/underscores/et cetera", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize fundamental language and naming conventions within databases (e.g., upper case, lower case, camel case, underscores).", "value": "1"}]}]}, {"name": "1. Knowledge of customers and support staff and how they will use datasets", "children": [{"name": "Foundational (F)", "children": [{"name": "Categorize different end users and explain how they will use datasets.", "value": "1"}]}]}, {"name": "2. Knowledge of databases and impact of choosing a naming convention", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the basic principles of databases and explain the importance of each as it relates to naming conventions.", "value": "1"}, {"name": "Demonstrate how to use databases and explain the impact of choosing a naming convention.", "value": "1"}]}]}, {"name": "3. NSDI", "children": [{"name": "Foundational (F)", "children": [{"name": "Explain the National Spatial Data Infrastructure (NSDI) guidelines and summarize their impact on naming conventions.", "value": "1"}]}]}, {"name": "4. Understand how naming conventions can be used to make work easier", "children": [{"name": "Foundational (F)", "children": [{"name": "Characterize the advantages and disadvantages of utilizing naming conventions, and how it impacts the professional field.", "value": "1"}, {"name": "Explain how naming conventions can be used to make working with data easier.", "value": "1"}]}]}, {"name": "1. Automate naming to improve efficiency", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Design techniques that can automate naming to improve efficiency when working with data.", "value": "1"}]}]}]}, {"name": "T6. Minimum Schema", "children": [{"name": "1. Online learning to understand what schema is in a geospatial database", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize the utilization of a schema in geospatial databases.", "value": "1"}]}]}, {"name": "1. Reviewing geodatabase schemas to learn about simple/complex schemas", "children": [{"name": "Foundational (F)", "children": [{"name": "Categorize the different principles for simple and complex geodatabase schemas.", "value": "1"}]}]}, {"name": "1. Create geodatabase schemas and learn from your mistakes", "children": [{"name": "Application (A)", "children": [{"name": "Categorize geodatabase schemas (e.g., ESRI, Hexagon, Intergraph, etc.) and understand the advantages and disadvantages or each.", "value": "1"}]}]}, {"name": "1. Help teach others how to develop schemas that are simple yet fulfill the requirements (principle of parsimony)", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Establish how to develop schemas that are simple yet fulfill requirements (principle of parsimony).", "value": "1"}]}]}]}, {"name": "T7. Data Normalization (e.g., first normal form, second normal form, third normal form)", "children": [{"name": "1. RDBMS concepts", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize the concepts of Relational DataBase Management Systems (RDBMS).", "value": "1"}]}]}, {"name": "2. Benefits of removing unwanted redundancy in a table design", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain what unwanted redundancy is, and the benefits of removing it from a table design.", "value": "1"}]}]}, {"name": "1. Rules that detect excessive redundancy in a table design", "children": [{"name": "Foundational (F)", "children": [{"name": "List the rules used to detect excessive redundancy in table design and explain when they apply.", "value": "1"}]}]}, {"name": "2. Understand why and how to normalize data", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline how to normalize data and explain why data normalization is important.", "value": "1"}]}]}, {"name": "1. NSDI standards and guidelines", "children": [{"name": "Application (A)", "children": [{"name": "Explain the National Spatial Data Infrastructure standards and guidelines and how they apply to data normalization.", "value": "1"}]}]}, {"name": "1. Voronoi polygons/Thiessen polygons/ Dirichlet regions", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate the methods for using Voronoi polygons, Thiessen polygons, and Dirichlet regions when applying to data normalization.", "value": "1"}]}]}]}, {"name": "T8. Conceptual Database Models (e.g., requirements definition, database planning, Entity-Relationship diagram)", "children": [{"name": "1. Understanding of the requirement", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain the requirements of conceptual database models.", "value": "1"}]}]}, {"name": "2. Understanding of relationships between objects", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize how entities are formed from objects and how the entities’ attributes are analyzed.", "value": "1"}]}]}, {"name": "3. Data modeling tools", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Characterize the different data modeling tools and explain their uses.", "value": "1"}]}]}, {"name": "4. Visually representable", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain the difference between visually and non-visually representable conceptual database models.", "value": "1"}, {"name": "Characterize the advantages and disadvantages of various conceptual database models.", "value": "1"}]}]}, {"name": "1. Precise use of ERD notation", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how Entity-Relational Diagram (ERD) notation is used when developing database models.", "value": "1"}]}]}, {"name": "2. Entities/attributes", "children": [{"name": "Foundational (F)", "children": [{"name": "List the different entities and attributes used for conceptualizing database models.", "value": "1"}]}]}, {"name": "3. Data flow modeling", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline the key concepts of data flow modeling and explain their roles in database modeling.", "value": "1"}]}]}, {"name": "1. Converting schemas into a system design", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how different schemas are converted into a system design.", "value": "1"}]}]}, {"name": "1. The benefits of using and limitations of OOP languages", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate the benefits and limitations of using Object-Oriented Programming (OOP) languages to establish standards of application to database modeling.", "value": "1"}]}]}, {"name": "2. Ability to implement the conceptual model in reality", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Design techniques for converting conceptual models into usable products.", "value": "1"}]}]}]}, {"name": "T9. Logical Database Models (e.g., cardinality, incidental and structural relationships, storage requirements)", "children": [{"name": "1. Based on conceptual database models", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain how logical database models are based on conceptual database models.", "value": "1"}]}]}, {"name": "2. Normalization", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Characterize how data normalization is different when applied to logical database models.", "value": "1"}]}]}, {"name": "3. Entities / attributes", "children": [{"name": "Prerequisites (P)", "children": [{"name": "List the different entities and attributes used for logical database models.", "value": "1"}]}]}, {"name": "4. Impact analysis", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain how to perform impact analysis on logical database models.", "value": "1"}]}]}, {"name": "5. Data modeling tools", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Characterize the different data modeling tools used for logical database models.", "value": "1"}]}]}, {"name": "6. Visually representable", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain the difference between visually and non-visually representable logical database models.", "value": "1"}, {"name": "Characterize the advantages and disadvantages of various logical database models.", "value": "1"}]}]}, {"name": "1. Precise use of ERD notation", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how Entity-Relational Diagram (ERD) notation is used when developing logical database models.", "value": "1"}]}]}, {"name": "2. Entities/attributes", "children": [{"name": "Foundational (F)", "children": [{"name": "List the different entities and attributes used for logical database models.", "value": "1"}]}]}, {"name": "3. Data flow modeling", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline the key concepts of data flow modeling and explain their roles in logical database modeling.", "value": "1"}]}]}, {"name": "1. Converting schemas into a system design", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how different schemas are converted into a system design.", "value": "1"}]}]}, {"name": "1. How OOP languages can be used to structure and manage as database", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate the benefits and limitations of using Object-Oriented Programming (OOP) languages.", "value": "1"}, {"name": "Evaluate the benefits and limitations of using Object-Oriented Programming (OOP) languages to design methods for structuring and managing logical database models.", "value": "1"}]}]}]}, {"name": "T10. Physical Database Models (e.g., software capabilities and limitations)", "children": [{"name": "1. Based on logical database models", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain how physical database models are based on logical database models.", "value": "1"}]}]}, {"name": "2. Database design", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize the concepts of database design and how each is used in physical database modeling.", "value": "1"}]}]}, {"name": "3. Database storage", "children": [{"name": "Prerequisites (P)", "children": [{"name": "List the concepts of database storage and how each is used in physical database modeling.", "value": "1"}]}]}, {"name": "4. Database performance", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize the concepts of database performance and when it is best to use the different types of physical database models.", "value": "1"}]}]}, {"name": "5. Data modeling tools", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Characterize the different data modeling tools and how they are used in physical databases.", "value": "1"}]}]}, {"name": "1. Precise use of Entity-Relational Diagram (ERD) notation", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how Entity-Relational Diagram (ERD) notation is used when developing physical database models.", "value": "1"}]}]}, {"name": "2. Entities/attributes", "children": [{"name": "Foundational (F)", "children": [{"name": "List the different entities and attributes used for physical database models.", "value": "1"}]}]}, {"name": "3. Data flow modeling", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline the key concepts of data flow modeling and explain their roles in physical database modeling.", "value": "1"}]}]}, {"name": "1. Converting schemas into a system design", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how different schemas are converted into a system design.", "value": "1"}]}]}, {"name": "1. Object-Oriented Programming (OOP)", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate the benefits and limitations of using Object-Oriented Programming (OOP) languages in physical database modeling.", "value": "1"}]}]}, {"name": "1. Ability to refine the database design in response to changes in data or purpose", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Consider how database design changes in response to data or purpose in order to establish standards for refining databases.", "value": "1"}]}]}]}, {"name": "T11. Types of Databases (e.g., schema types)", "children": [{"name": "1. What is a database schema", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain the uses and purposes of database schemas.", "value": "1"}]}]}, {"name": "2. Entities versus attributes", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Differentiate entities and attributes and explain their roles in databases.", "value": "1"}]}]}, {"name": "1. Hierarchical databases", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the different database types (e.g., hierarchical, network, sequential, and relational) and explain how each is used.", "value": "1"}]}]}, {"name": "2. Network databases", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "3. Sequential databases", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "4. Relational databases", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "1. Semantic databases", "children": [{"name": "Application (A)", "children": [{"name": "Characterize when semantic databases should and should not be used.", "value": "1"}]}]}, {"name": "1. Object-oriented databases", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate current methods of constructing an object-oriented database to develop more efficient methods.", "value": "1"}]}]}, {"name": "2. Object-Oriented Programming (OOP)", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate the benefits and limitations of using Object-Oriented Programming (OOP) languages for each of the different database types.", "value": "1"}]}]}]}, {"name": "T12. Distributed Databases (e.g., cloud databases)", "children": [{"name": "1. What are the current limitations and scaling issues?", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize the current limitations and scaling issues of distributed databases (e.g., access restrictions, costs, synchronization, and replication, storage and services, etc.).", "value": "1"}]}]}, {"name": "2. Basic to advanced knowledge about data transfer", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Demonstrate in-depth knowledge of data transfer from the basic to advanced level (e.g., services versus delivery).", "value": "1"}]}]}, {"name": "3. Scripting language for parallelism", "children": [{"name": "Prerequisites (P)", "children": [{"name": "List the various scripting languages used in distributed databases.", "value": "1"}, {"name": "Summarize the use of scripting languages for parallelism in distributed databases.", "value": "1"}]}]}, {"name": "1. Data placement options", "children": [{"name": "Foundational (F)", "children": [{"name": "Categorize the different data placement options and explain how each is used in distributed databases.", "value": "1"}]}]}, {"name": "2. Transparencies in DDB", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the various transparencies in Distributed DataBases (DDB).", "value": "1"}]}]}, {"name": "3. Two-phase commit", "children": [{"name": "Foundational (F)", "children": [{"name": "Explain the concept of two-phase commit and summarize how it is used in distributed databases.", "value": "1"}]}]}, {"name": "4. Global deadlock detection", "children": [{"name": "Foundational (F)", "children": [{"name": "Explain how to use global deadlock detection in the context of distributed databases.", "value": "1"}]}]}, {"name": "1. Enterprise application integration tools (e.g., MuleSoft)", "children": [{"name": "Application (A)", "children": [{"name": "Compare/contrast the different types of enterprise application integration tools (e.g., MuleSoft) and explain their role in distributed databases.", "value": "1"}]}]}, {"name": "2. RESTful tools", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between the different types of REpresentational State Transfer (RESTful) tools and explain when each should be used with distributed databases.", "value": "1"}]}]}, {"name": "1. Knowledge of the best course of action for storing and managing distributed data across the cloud platform and common limitations associated with remote data", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate the current methods for storing and managing distributed data across cloud platforms to design more efficient methods to store and manage data.", "value": "1"}, {"name": "Dissect the common limitations associated with remote data (e.g., bandwidth, synchronization, storage, services, etc.) to design methods of improving the use of remote data in distributed databases.", "value": "1"}]}]}]}, {"name": "T13. Common Geospatial Database Tools", "children": [{"name": "1. Fundamental database management", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Compare/contrast fundamental database management concepts (e.g., cloud storage, file transfers and backups, encryption, file naming conventions and protocols, etc.).", "value": "1"}]}]}, {"name": "2. How to create, move, share, modify, remove and delete data and files in a typical file sharing system", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain how to create, move, share, modify, remove, and delete data and files in a typical file sharing system.", "value": "1"}]}]}, {"name": "1. Knowledge of open source/ Commercial Off-The-Shelf (COTS) Geospatial Information Systems (GISs)", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the key concepts of open source/Commercial Off-The-Shelf (COTS) Geospatial Information Systems (GIS).", "value": "1"}]}]}, {"name": "2. Knowledge of specific proprietary systems used by employer", "children": [{"name": "Foundational (F)", "children": [{"name": "Categorize the different proprietary systems and explain when it is appropriate to use each.", "value": "1"}, {"name": "List the different proprietary systems and explain the various uses across employers.", "value": "1"}]}]}, {"name": "3. How to create, move, share, modify, remove and delete data and files in a database", "children": [{"name": "Foundational (F)", "children": [{"name": "Explain the process of creating, moving, sharing, modifying, removing and deleting data and files in a database.", "value": "1"}]}]}, {"name": "1. Experience using multiple tools", "children": [{"name": "Application (A)", "children": [{"name": "Summarize the different geospatial database tools and explain when each should be used.", "value": "1"}]}]}, {"name": "1. Automation options", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate the different geospatial database automation options to design new methods of automation.", "value": "1"}]}]}]}, {"name": "T14. Data Searching (e.g., query operations, query languages)", "children": [{"name": "1. Knowledge of any query language", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain the purpose and function of different query languages (e.g., Structure Query Language [SQL]).", "value": "1"}]}]}, {"name": "2. Basic understanding of Structure Query Language (SQL)", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize basic Structure Query Language (SQL) concepts including the purpose of SQL, how SQL functions, how to read and write SQL, and the benefits of SQL over ad-hoc queries.", "value": "1"}]}]}, {"name": "2. Analytical skills", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize basic analytical skills including building queries, analyzing results of queries, categorization of data, and normalization of data.", "value": "1"}]}]}, {"name": "1. Proficiency with Structure Query Language (SQL)", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize basic Structure Query Language (SQL) skills including building queries, analyzing results of queries, categorization of data, and normalization of data.", "value": "1"}]}]}, {"name": "1. Extensions to standard SQL", "children": [{"name": "Application (A)", "children": [{"name": "Compare/contrast different data searching extensions to standard Structure Query Language (SQL) and explain when to use each.", "value": "1"}]}]}, {"name": "1. NoSQL", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate current methods of utilizing Not only Structure Query Language (NoSQL) when performing data searches and determine how the methods should be improved.", "value": "1"}]}]}, {"name": "2. XQuery (XML Query)", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate current methods of utilizing XQuery (eXtensible Markup Language [XML] Query) when performing data searches and determine how the methods should be improved.", "value": "1"}]}]}, {"name": "3. Study new SQL-based data management tools (e.g., MemSQL)", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate current and new Structure Query Language (SQL)-based data management tools (e.g., MemSQL) and develop standards of when each tool should be used.", "value": "1"}]}]}]}, {"name": "T15. Big Data Management", "children": [{"name": "1. Limitations of common tools and software when applied to big data", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize the limitations of common tools and software when applied to big data (e.g., storage, data processing, etc.).", "value": "1"}]}]}, {"name": "2. The volatility of data (e.g., the rate of change)", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain how the volatility of data (e.g., the rate of change) changes in different scenarios of big data management.", "value": "1"}]}]}, {"name": "3. Understand current enterprise processing capacity", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain the concept of enterprise processing capacity and how it relates to big data management.", "value": "1"}]}]}, {"name": "1. Key characteristics are volume, velocity and variety.", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline and define volume, velocity, and variety in relation to big data management.", "value": "1"}]}]}, {"name": "1. Big data applications contributed to the growth of NoSQL databases", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how big data applications have contributed to the growth of Structure Query Language (NoSQL) databases.", "value": "1"}]}]}, {"name": "1. NoSQL", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate how Not only Structure Query Language (NoSQL) is utilized in big data management and determine how NoSQL can be used more effectively.", "value": "1"}]}]}, {"name": "2. Study Tufte’s -The Visual Display of Quantitative Information", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Critique traditional methods of understanding data meaning and explain how visual analysis may lead to a better understanding of data meaning.", "value": "1"}]}]}, {"name": "3. Applications of artificial intelligence", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Establish techniques for how artificial intelligence can be applied to big data management.", "value": "1"}]}]}, {"name": "4. Principles of data aggregation", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate the principles of data aggregation and define more efficient and effective methods for application to big data.", "value": "1"}]}]}]}, {"name": "T16. Storage and Retrieval Principles", "children": [{"name": "1. Data sharing versus data delivery", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Distinguish between data sharing and data delivery.", "value": "1"}]}]}, {"name": "2. Creator of data should be maintained", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain why it is important for the creator of data to also maintain the data and list the implications it could have if the creator is not the maintainer.", "value": "1"}]}]}, {"name": "1. Archiving versus tiered storage approach", "children": [{"name": "Foundational (F)", "children": [{"name": "Distinguish between the archiving and tiered approaches to storing data.", "value": "1"}]}]}, {"name": "1. SQL", "children": [{"name": "Application (A)", "children": [{"name": "Characterize when it is and is not appropriate to use SQL for data retrieval.", "value": "1"}]}]}, {"name": "2. REST (for retrieval & dissemination)", "children": [{"name": "Application (A)", "children": [{"name": "Characterize when it is and is not appropriate to use REpresentational State Transfer (RESTful) services for retrieving and disseminating data.", "value": "1"}]}]}, {"name": "3. Local storage versus cloud storage", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between local storage and cloud storage and explain when each should be used.", "value": "1"}]}]}, {"name": "4. Off-site back-ups", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between the different types of off-site back-ups and characterize when each type should and should not be used.", "value": "1"}]}]}, {"name": "1. Analysis of on-site/off-site/near-site storage options and issues", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Establish standards for when on-site, off-site and near-site storage options should be used.", "value": "1"}, {"name": "Evaluate the issues associated with on-site, off-site, and near-site storage options to develop more efficient and effective storage options.", "value": "1"}]}]}]}, {"name": "T17. Query Tool Fundamentals (e.g., SQL, python)", "children": [{"name": "1. Fundamental database management", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Compare/contrast fundamental database management concepts (e.g., cloud storage, file transfers and backups, encryption, file naming conventions and protocols, etc.).", "value": "1"}]}]}, {"name": "2. Fundamental understanding of SQL", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize basic Structured Query Language (SQL) concepts including the purpose of SQL, how SQL functions, how to read and write SQL, and the benefits of SQL over ad-hoc queries.", "value": "1"}]}]}, {"name": "1. Basic syntax to start practicing SQL and Python", "children": [{"name": "Foundational (F)", "children": [{"name": "List the basic syntax used for Structured Query Language (SQL) and Python and the purpose of each.", "value": "1"}]}]}, {"name": "1. Work in a setting that encourages/ permits extension of knowledge as it relates to query tools", "children": [{"name": "Application (A)", "children": [{"name": "Explain when it is necessary to use Structured Query Language (SQL) and Python for querying data.", "value": "1"}]}]}, {"name": "1. Innovation for implementing query tools", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Strategize with other professionals to develop innovative methods and techniques for implementing different query tools.", "value": "1"}]}]}]}, {"name": "T18. User and Role Management", "children": [{"name": "1. Fundamental user access management", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Compare/contrast fundamental user management concepts (e.g., cloud storage, file transfers and backups, encryption, file naming conventions and protocols, etc.).", "value": "1"}]}]}, {"name": "1. Knowledge of customers", "children": [{"name": "Foundational (F)", "children": [{"name": "Compile a list of different types of customers a professional may encounter when performing user and role management duties.", "value": "1"}]}]}, {"name": "2. Knowledge of institutional policies", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the common user and role management policies and why it is important that policies change based on the ability of the institution.", "value": "1"}]}]}, {"name": "1. Knowledge of how to create users and group permissions", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between the permissions provided to users and those provided to groups.", "value": "1"}, {"name": "Explain how to create users and group permissions when managing data.", "value": "1"}]}]}, {"name": "1. Define methods of automating processes for efficiency", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate current methods of user and role management to define methods of automating the process for higher efficiency.", "value": "1"}]}]}]}, {"name": "T19. Schema Design/Creation", "children": [{"name": "1. How data will be used", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Characterize how the purpose of data influences which schema design will be used and how the data is created.", "value": "1"}]}]}, {"name": "2. User Feedback of design", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Analyze the different types of user feedback that can be provided on schema design.", "value": "1"}]}]}, {"name": "1. How are schemas created?", "children": [{"name": "Foundational (F)", "children": [{"name": "Explain how schemas are created and why schemas are useful when managing data.", "value": "1"}]}]}, {"name": "2. How can they help you?", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "3. Review of schema designs", "children": [{"name": "Foundational (F)", "children": [{"name": "List the different types of schema designs and explain their uses.", "value": "1"}]}]}, {"name": "1. Access to GIS software to view existing schemas and create new schemas", "children": [{"name": "Application (A)", "children": [{"name": "Explain how GIS software is used to view existing schemas and how to create new schemas.", "value": "1"}]}]}, {"name": "2. Access to data modeling tools", "children": [{"name": "Application (A)", "children": [{"name": "Explain how different data modeling tools are utilized to design and create schemas.", "value": "1"}]}]}, {"name": "1. Automation", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate current methods of designing and creating schemas and determine how automation can be used to expediate the process.", "value": "1"}]}]}, {"name": "2. Templates", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate current methods for using templates to design and create schemas to develop more effective templates.", "value": "1"}]}]}, {"name": "3. Use data modeling tools to manage schema design/creation", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Develop techniques of using data modeling tools to manage the design and creation of schemas.", "value": "1"}]}]}]}, {"name": "T20. Analysis Resulting in Metrics", "children": [{"name": "1. Basic understanding of spatial statistics, including the distinction between correlation and causation", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize the basic concepts of spatial statistics including Root Mean Square Error (RMSE) testing, Chi-squared testing, spatial autocorrelation, correlation vs. causation, and 2D/3D regression and correlation analysis.", "value": "1"}]}]}, {"name": "1. Spatial autocorrelation", "children": [{"name": "Foundational (F)", "children": [{"name": "Explain the purpose of spatial auto-correlation and how the results are utilized.", "value": "1"}]}]}, {"name": "2. Standard geoprocessing tools and methods (e.g., feature overlays, selections, topological processes, raster processes, data conversion)", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how the most common tools and methods are used in data analysis (e.g., feature overlays, selections, topological processes, raster processes, data conversion).", "value": "1"}]}]}, {"name": "3. Learn analytical scripting language (e.g., JavaScript)", "children": [{"name": "Foundational (F)", "children": [{"name": "Explain how different analytical scripting languages (e.g., JavaScript) are used in data analysis.", "value": "1"}]}]}, {"name": "1. How to use Python to analyze geospatial data", "children": [{"name": "Application (A)", "children": [{"name": "Explain how Python is used to analyze geospatial data.", "value": "1"}]}]}, {"name": "2. The significance of spatial statistics", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how the spatial statistic results are utilized to manage data.", "value": "1"}]}]}, {"name": "3. Ability to use programming languages like R and Python to script geospatial analysis", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between programming languages (e.g., R and Python) and how they are used to script geospatial analysis.", "value": "1"}]}]}, {"name": "1. Learn data science", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate standard data science principles and practice to determine how data science can be applied to data management.", "value": "1"}]}]}, {"name": "2. Aggregation through use of Voronoi polygons/Thiessen polygons/Dirichlet regions", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Design techniques for aggregating data using Voronoi polygons, Thiessen polygons, and Dirichlet regions.", "value": "1"}]}]}]}, {"name": "T21. Archiving Data", "children": [{"name": "1. Online/classroom/on the job training regarding tape backups, previous versions, and deleting unnecessary files", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain why the concepts of tape backups, previous versions, and deleting unnecessary files are important when archiving data.", "value": "1"}, {"name": "", "value": "1"}]}]}, {"name": "1. Data storage techniques", "children": [{"name": "Foundational (F)", "children": [{"name": "List the different data storage techniques and explain their roles in archiving data.", "value": "1"}]}]}, {"name": "2. How to collaborate with IT professionals", "children": [{"name": "Foundational (F)", "children": [{"name": "Explain the benefits of collaborating with IT professionals when archiving data.", "value": "1"}]}]}, {"name": "3. Use of metadata for retrieval", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline the techniques of using metadata to retrieve data.", "value": "1"}]}]}, {"name": "1. Understanding customer requirements", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate the requirements that should be considered when archiving data.", "value": "1"}]}]}, {"name": "2. Understanding how long data must be available (e.g., expiration policies)", "children": [{"name": "Application (A)", "children": [{"name": "Discern how long data should be available (e.g., expiration policies) based on the type of data and its intended use.", "value": "1"}]}]}, {"name": "1. Automation", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate current methods of archiving data and determine how automation can be used to expedite the process.", "value": "1"}]}]}, {"name": "2. Use of artificial intelligence to classify needs for access", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate current techniques for classifying needs for access and determine how artificial intelligence can be used to expedite the process.", "value": "1"}]}]}]}, {"name": "T22. Retrieving Data", "children": [{"name": "1. Data sharing versus data delivery", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Distinguish between data sharing and data delivery.", "value": "1"}]}]}, {"name": "2. Creator of data should be maintainer", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain why it is important for the creator of data to also maintain the data and list the implications it could have if the creator is not the maintainer.", "value": "1"}]}]}, {"name": "1. Archiving versus tiered storage approach", "children": [{"name": "Foundational (F)", "children": [{"name": "Distinguish between the archiving and tiered approaches to storing data.", "value": "1"}]}]}, {"name": "2. Metadata for retrieval", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline the techniques of using metadata to retrieve data.", "value": "1"}]}]}, {"name": "1. RESTful services for access", "children": [{"name": "Application (A)", "children": [{"name": "Discern how REpresentational State Transfer (RESTful) services are utilized for accessing and retrieving data.", "value": "1"}]}]}, {"name": "1. Automation", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate current methods of retrieving data and determine how automation can be used to expedite the process.", "value": "1"}]}]}, {"name": "2. Use of artificial intelligence to classify needs for access", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate current techniques for classifying needs for access and determine how artificial intelligence can be used to expedite the process.", "value": "1"}]}]}]}, {"name": "T23. Metadata Maintenance", "children": [{"name": "1. Standardized exchange formats and metadata", "children": [{"name": "Prerequisites (P)", "children": [{"name": "List the different standardized geospatial data exchange formats and explain how they are used to present metadata.", "value": "1"}]}]}, {"name": "2. Understanding what metadata is", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain the concept of metadata and describe when and how it is used.", "value": "1"}]}]}, {"name": "1. National Spatial Data Infrastructure (NSDI)standards", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize why it is important to understand the National Spatial Data Infrastructure (NSDI) standards and guidelines when performing metadata maintenance.", "value": "1"}]}]}, {"name": "2. Federal Geographic Data Committee (FGDC) metadata standards", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize why it is important to understand the Federal Geographic Data Committee (FGDC) metadata standards.", "value": "1"}]}]}, {"name": "https://www.fgdc.gov/metadata ", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "1. National Spatial Data Infrastructure (NSDI)", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate which National Spatial Data Infrastructure (NSDI) standards and guidelines relate to metadata maintenance.", "value": "1"}]}]}, {"name": "2. Federal Geographic Data Committee (FGDC) metadata standards (Ability to write clear and understandable metadata)", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how each of the Federal Geographic Data Committee (FGDC) metadata standards influence metadata maintenance.", "value": "1"}]}]}, {"name": "3. Open Geospatial Consortium (OGC) Standards", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how Open Geospatial Consortium (OGC) standards are applied to metadata maintenance.", "value": "1"}]}, {"name": "MASTERY/UGP (M/U)", "children": [{"name": "Establish methods for ensuring the Open Geospatial Consortium (OGC) standards  for metadata maintenance are followed.", "value": "1"}]}]}, {"name": "1. Global Spatial Data Infrastructure (GSDI)", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate the importance, purpose, and uses of the Global Spatial Data Infrastructure (GSDI).", "value": "1"}]}]}, {"name": "2. Federal Geographic Data Committee (FGDC) metadata standards (always includes metadata with any geospatial data, particularly when sharing)", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Establish methods for ensuring Federal Geographic Data Committee (FGDC) standards for metadata are followed, especially when sharing geospatial data.", "value": "1"}]}]}]}, {"name": "T24. Data Privacy and Confidentiality Considerations", "children": [{"name": "1. The distinction between privacy and confidentiality", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Differentiate between data privacy and data confidentiality.", "value": "1"}]}]}, {"name": "1. Applicable laws specific to the field (e.g., Health Insurance Portability and Accountability Act of 1996 [HIPAA])", "children": [{"name": "Foundational (F)", "children": [{"name": "List and summarize the different laws that deal with data privacy and confidentiality (e.g., Health Insurance Portability and Accountability Act of 1996).", "value": "1"}]}, {"name": "Application (A)", "children": [{"name": "Differentiate the various laws that deal with data privacy and confidentiality (e.g., Health Insurance Portability and Accountability Act of 1996 [HIPAA]).", "value": "1"}]}]}, {"name": "2. Personally Identifiable Information (PII)", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the concept of Personally Identifiable Information (PII) and explain why it is important when considering data privacy and confidentiality.", "value": "1"}]}, {"name": "Application (A)", "children": [{"name": "Characterize what constitutes Personally Identifiable Information (PII) and when PII should and should not be shared.", "value": "1"}]}]}, {"name": "3. Knowledge of institutional policies", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the common data privacy and confidentiality policies and why it is important that policies change based on the ability of the institution.", "value": "1"}]}]}, {"name": "1. Advanced study of ethics", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Establish and explain the importance of ethics when dealing with data privacy and confidentiality.", "value": "1"}]}]}]}, {"name": "T25. Data Encryption", "children": [{"name": "1. Principles of encryption", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize the principles of data encryption (e.g., obfuscation, encryption methods, public key vs. private key, etc.).", "value": "1"}]}]}, {"name": "2. Public key versus private key", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Differentiate between a public key and private key encryption and why each method is used.", "value": "1"}]}]}, {"name": "1. Commercially available encryption tools", "children": [{"name": "Foundational (F)", "children": [{"name": "List some of the different commercially available data encryption tools and explain their uses.", "value": "1"}]}]}, {"name": "2. Knowledge of institutional policies", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize common policies that dictate how data encryption is used.", "value": "1"}]}]}, {"name": "1. Restrictions on the export of encryption tools", "children": [{"name": "Application (A)", "children": [{"name": "Characterize which restrictions apply when exporting encryption tools internationally.", "value": "1"}]}]}, {"name": "2. Reverse proxies", "children": [{"name": "Application (A)", "children": [{"name": "Characterize when reverse proxies should and should not be used when encrypting data.", "value": "1"}]}]}, {"name": "3. Secure Sockets Layer (SSL)", "children": [{"name": "Application (A)", "children": [{"name": "Characterize when Secure Sockets Layer (SSL) technology should and should not be used when encrypting data.", "value": "1"}]}]}, {"name": "4. JavaScript Object Notation (JSON) Web Token (JWT)", "children": [{"name": "Application (A)", "children": [{"name": "Determine when it is and is not appropriate to encrypt a JavaScript Object Notation (JSON) Web Token (JWT).", "value": "1"}]}]}, {"name": "1. Cryptography", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate current methods of encrypting data and determine how cryptography can be used to improve these methods.", "value": "1"}]}]}, {"name": "2. Geo-blocking", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Determine how geo-blocking can be used to improve current data encryption techniques.", "value": "1"}]}]}]}, {"name": "T26. Database Security Ethics (e.g., who should have access, roles)", "children": [{"name": "1. Online/classroom learning about database access", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain the basic concepts of database access.", "value": "1"}]}]}, {"name": "1. Knowledge of customers", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize what customer considerations should be addressed when accessing database security (e.g., customers access to secure data).", "value": "1"}]}]}, {"name": "2. Knowledge of institutional policies", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the common database security policies and why it is important that policies change based on the ability of the institution.", "value": "1"}]}]}, {"name": "1. Knowledge of how to create users, login roles and group permissions", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between the permissions provided to users, login roles, and groups.", "value": "1"}, {"name": "Explain how to create users, login roles, and group permissions.", "value": "1"}]}]}, {"name": "1. Automating the process for efficiency", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate current database security techniques and determine how automation can be used to expediate the process.", "value": "1"}]}]}, {"name": "2. Advanced study of ethics", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Establish standards for teaching and implementing advanced ethics principles.", "value": "1"}]}]}]}, {"name": "T27. Mechanisms of Compromise (e.g., intentional versus accidental)", "children": [{"name": "1. User authorization", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain the purpose of user authorization and how to determine user authorization.", "value": "1"}]}]}, {"name": "2. User access methods", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Differentiate between the different types of user access methods.", "value": "1"}]}]}, {"name": "1. Installing keyboard loggers", "children": [{"name": "Foundational (F)", "children": [{"name": "Explain what keyboard loggers are and how they are installed.", "value": "1"}]}]}, {"name": "2. Adding routing/wireless equipment", "children": [{"name": "Foundational (F)", "children": [{"name": "Explain techniques for adding routing and wireless equipment.", "value": "1"}]}]}, {"name": "3. Connecting computing devices", "children": [{"name": "Foundational (F)", "children": [{"name": "Explain how to connect different types of computing devices properly (e.g., wired connections vs. wireless connections).", "value": "1"}]}]}, {"name": "4. Knowledge of institutional policies", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize common policies that influence the mechanisms of data compromise.", "value": "1"}]}]}, {"name": "1. Methods of detection", "children": [{"name": "Application (A)", "children": [{"name": "Compare/contrast different methods of detecting data compromised by phishing, spoofing, and human agent activities.", "value": "1"}]}]}, {"name": "2. Trust and privacy", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate the concepts of trust and privacy and explain how they prevent data from being compromised.", "value": "1"}]}]}, {"name": "3. Internal versus external threats", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate internal versus external threats to data and explain how they can compromise data.", "value": "1"}]}]}]}, {"name": "T28. Consequent Risk Management (e.g., best practices concerning tradeoff between security and accessibility)", "children": [{"name": "1. User authorization", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain when user authorization should be granted or denied.", "value": "1"}]}]}, {"name": "2. User access methods", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Differentiate between the different types of user access methods.", "value": "1"}]}]}, {"name": "3. User roles (e.g., view, publisher, administrator)", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain the different roles that users can have when working with data (e.g., view, publisher, administrator).", "value": "1"}]}]}, {"name": "1. Knowledge of institutional policies", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the risk management policies for various institutions.", "value": "1"}]}]}, {"name": "1. The Information Technology Infrastructure Library (ITIL) Framework of best practices for risk management", "children": [{"name": "Application (A)", "children": [{"name": "Order the five stages of the Information Technology Infrastructure Library (ITIL) risk management process and summarize the purpose of each phase.", "value": "1"}]}]}, {"name": "2. Consequent risk versus outcome risk", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between consequent risks and outcome risks about the data.", "value": "1"}]}]}, {"name": "1. Theory of risk management", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Define the theory of risk management and explain why it is implemented in data risk management.", "value": "1"}]}]}]}, {"name": "T29. Common Programming Languages (e.g., Python)", "children": [{"name": "1. Computer fundamentals from GIS&T - bit, byte, name components of a computer, and similar", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Differentiate between a bit and a byte and explain the purpose of each.", "value": "1"}]}]}, {"name": "2. List structured programming language", "children": [{"name": "Prerequisites (P)", "children": [{"name": "List the different types of structured programming languages.", "value": "1"}]}]}, {"name": "3. List query language", "children": [{"name": "Prerequisites (P)", "children": [{"name": "List the different types of query languages.", "value": "1"}]}]}, {"name": "4. List scripting languages", "children": [{"name": "Prerequisites (P)", "children": [{"name": "List the different types of scripting languages.", "value": "1"}]}]}, {"name": "5. List schema languages", "children": [{"name": "Prerequisites (P)", "children": [{"name": "List the different types of schema languages.", "value": "1"}]}]}, {"name": "1. Explain the purpose of pseudocode and flow diagrams", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the purpose of pseudocode and flow diagrams.", "value": "1"}]}]}, {"name": "2. Describe flow control ", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the concept of flow control and why it is important when programming.", "value": "1"}]}]}, {"name": "3. Describe the purpose of a counter", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the purpose of a counter and why it is important when programming.", "value": "1"}]}]}, {"name": "4. List and describe the types and purpose of loops (Do (counter), Do (while condition true), and similar)", "children": [{"name": "Foundational (F)", "children": [{"name": "List and summarize the types and purpose of loops (e.g., Do [counter], Do [while condition true]).", "value": "1"}]}]}, {"name": "5. List and describe the types of conditional statements (If, ElseIf, and similar)", "children": [{"name": "Foundational (F)", "children": [{"name": "List and summarize the types of conditional statements (e.g., If, Else If [Elself]).", "value": "1"}]}]}, {"name": "6. Explain the purpose of a subroutine", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the purpose of a subroutine and why it is important when programming.", "value": "1"}]}]}, {"name": "7. Compare and contrast scripting and programming", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the relationship between scripting and programming.", "value": "1"}]}]}, {"name": "8. Describe an application and the role of an application-program interface (API)", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize what an application is and the role Application-Program Interfaces (APIs) have.", "value": "1"}]}]}, {"name": "9. Describe variable, array, array depth, parameter, string, single precision, double precision", "children": [{"name": "Foundational (F)", "children": [{"name": "Define the following terms and summarize how they are used while programming: variable, array, array depth, parameter, string, single precision, double precision", "value": "1"}]}]}, {"name": "10. Explain the purpose of variable definition", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the purpose of variable definition and why it is important when programming.", "value": "1"}]}]}, {"name": "11. Explain the need for and use of commenting in code", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the need for and use of commenting in code.", "value": "1"}]}]}, {"name": "12. Describe the versioning process", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the steps taken during the versioning process.", "value": "1"}]}]}, {"name": "1. Competency in one or more programming languages", "children": [{"name": "Application (A)", "children": [{"name": "Compare/contrast some of the different types of programming languages.", "value": "1"}]}]}, {"name": "2. Given a snippet of code and the starting value for a variable, provide its value at the end of the code", "children": [{"name": "Application (A)", "children": [{"name": "Determine the value of a variable at the end of a given snippet of code and the variable’s starting value.", "value": "1"}]}]}, {"name": "3. Identify spatial object names from a Geographic Markup Language (GML) schema", "children": [{"name": "Application (A)", "children": [{"name": "Distinguish spatial object names from a Geographic Markup Language (GML) schema.", "value": "1"}]}]}, {"name": "4. Determine the output of a basic Structured Query Language (SQL) query", "children": [{"name": "Application (A)", "children": [{"name": "Determine the output of a basic Structured Query Language (SQL) query.", "value": "1"}]}]}, {"name": "5. Given a block of text, identify the correct pseudocode statement for performing a given action (trim, concatenate, and similar tasks)", "children": [{"name": "Application (A)", "children": [{"name": "Determine the most appropriate pseudocode statements for performing a given action given a block of text.", "value": "1"}]}]}, {"name": "6. Identify the block of pseudocode code used to search and replace a number", "children": [{"name": "Application (A)", "children": [{"name": "Characterize a block of pseudocode code used to search and replace numbers.", "value": "1"}]}]}, {"name": "7. Identify the block of pseudocode to convert latitude and longitude in one format to another", "children": [{"name": "Application (A)", "children": [{"name": "Characterize a block of pseudocode used to convert latitude and longitude in one format to another.", "value": "1"}]}]}]}, {"name": "T30. Web Application Program Interfaces (e.g., iOS, Android)", "children": [{"name": "1. What are Application-Program Interfaces (APIs)", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Explain the concept and purpose of Application-Program Interfaces (APIs).", "value": "1"}]}]}, {"name": "2. Web programming fundamentals", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize the fundamental concepts of web programming (e.g., web services, Application-Program Interfaces [APIs]).", "value": "1"}]}]}, {"name": "3. Uniform Resource Identifiers (URIs) versus Uniform Resource Locators (URLs)", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Differentiate between Uniform Resource Identifiers (URIs) and Uniform Resource Locators (URLs), and when it is appropriate to use each in web application program interfaces.", "value": "1"}]}]}, {"name": "1. Ability to read and write in eXtensible Markup Language (XML)", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize basic concepts of reading and writing in eXtensible Markup Language (XML) in web application program interfaces.", "value": "1"}]}]}, {"name": "1. Advanced understanding of Graphical User Interfaces (GUI) development", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate techniques used to develop and apply Graphical User Interfaces (GUI) in web application program interfaces.", "value": "1"}]}]}, {"name": "2. Advanced knowledge of and their use in creating and serving Application-Program Interfaces (APIs):", "children": [{"name": "Application (A)", "children": [{"name": "Compare and contrast the following web application program interfaces and explain when it is appropriate to use each: REST, SOAP, RPC, JSON, XML", "value": "1"}]}]}, {"name": "1. Ability to create program interfaces for mobile devices using:", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Design techniques to create program interfaces for mobile devices using the following: Android SDK, iOS SDK, and other relevant SDK's", "value": "1"}]}]}]}, {"name": "T31. API Types and Classifications", "children": [{"name": "1. Basic understanding of the purpose and use of common Application Programming Interfaces (APIs) like REpresentational State Transfer (REST), Simple Object Access Protocol (SOAP), and Remote Procedure Call (RPC)", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize the principles of the following common Application Programming Interfaces (APIs): REST, SOAP, RPC", "value": "1"}]}]}, {"name": "1. Ability to read and write the following REpresentational State Transfer (REST), Simple Object Access Protocol (SOAP), and Remote Procedure Call (RPC) Application Programming Interfaces (APIs).", "children": [{"name": "Foundational (F)", "children": [{"name": "Explain the basic concepts and principles of REpresentational State Transfer (REST), Simple Object Access Protocol (SOAP), and Remote Procedure Call (RPC) Application Programming Interfaces (APIs), and how to use each.", "value": "1"}]}]}, {"name": "1. Expert level understanding of how to create advances Application Programming Interfaces (APIs)", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between the various techniques used to create advanced Application Programming Interfaces, and when it is appropriate to use each method.", "value": "1"}]}]}, {"name": "1. Proficient knowledge of Application Programming Interfaces (APIs) and ability to determine which is the best use case in any scenario", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Evaluate the advantages and disadvantages of the various Application Programming Interfaces (APIs) to construct new methods of utilizing APIs in varying environments.", "value": "1"}]}]}]}, {"name": "T32. Raster", "children": [{"name": "1. Define pixel, tone, contrast, digital number, dynamic range, and brightness as they relate to photography", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Define the following terms and outline how they relate to photography: pixel, tone, contrast, digital number, dynamic range, brightness", "value": "1"}]}]}, {"name": "2. Label the components of a diagram depicting the major components of a digital camera", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Identify the major components of a digital camera and summarize their purpose.", "value": "1"}]}]}, {"name": "3. Define resolution and image scale", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Define resolution and image scale and summarize the role they play in collecting raster data.", "value": "1"}]}]}, {"name": "4. Perform basic arithmetic", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Connect basic math principles (e.g., averaging, creating bar graphs, discrete numbers, continuous numbers) to other fields of work such as science.", "value": "1"}]}]}, {"name": "5. Create a bar graph", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "6. Average a list of numbers", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "7. Differentiate between discrete and continuous numeric data", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "8. Describe \"least squares\" regression and residual analysis", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Define “least squares” regression and residual analysis, and summarize what information they methodology provides.", "value": "1"}]}]}, {"name": "1. List and describe the advantages and disadvantages of converting vector data to raster", "children": [{"name": "Foundational (F)", "children": [{"name": "Compare the advantages and disadvantages of converting raster to vector data.", "value": "1"}, {"name": "Summarize the process taken to convert raster data into vector data.", "value": "1"}]}]}, {"name": "2. List and describe the following sources for raster data: direct acquisition by a sensor system, scanning, interpolation, conversion from vector data, and map algebra or similar analytic processes", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline the similarities and differences between the following raster data sources: direct acquisition by a sensor system, scanning, interpolation, conversion from vector data, map algebra", "value": "1"}]}]}, {"name": "3. Describe quantization", "children": [{"name": "Foundational (F)", "children": [{"name": "Define quantization and summarize its role in analyzing raster data.", "value": "1"}]}]}, {"name": "4. Describe the process of converting an electrical signal to a pixel value", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline the process of converting an electrical signal into a pixel value.", "value": "1"}]}]}, {"name": "5. List three common cell types used in a Tessellation model", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify common cell types used in Tessellation models.", "value": "1"}]}]}, {"name": "6. Describe a Tessellation model", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize what a Tessellation model is and how it is used with raster data.", "value": "1"}]}]}, {"name": "7. Define image caching", "children": [{"name": "Foundational (F)", "children": [{"name": "Define image caching and summarize why it is important when working with raster data.", "value": "1"}]}]}, {"name": "8. Describe the effects of transforming raster data from one coordinate system to another", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify how raster data is affected when it is transformed from one coordinate system into another coordinate system.", "value": "1"}]}]}, {"name": "9. Compare and contrast 8-bit and 24-bit imagery", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the similarities and differences between 8-bit imagery and 24-bit imagery.", "value": "1"}]}]}, {"name": "10. Describe the process of representing color using a 24-bit image", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify how color is represented in a 24-bit image.", "value": "1"}, {"name": "Summarize the process performed to represent color in a 24-bit image.", "value": "1"}]}]}, {"name": "11. Describe the process used for transmitting images using electro-optical sensor systems", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline the process taken to prepare and transmit images using electro-optical sensor systems.", "value": "1"}]}]}, {"name": "12. Compare and contrast georeferencing, orthorectification, and georectification of raster data", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the similarities and differences between georeferencing, orthorectification, and georectification of raster data.", "value": "1"}]}]}, {"name": "13. Create a histogram which represents the distribution of values in a raster image", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline the process taken to represent the distribution of values in a raster image in a histogram and summarize why it is important to understand the distribution of values.", "value": "1"}]}]}, {"name": "14. Explain the use of histograms in digital image processing", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify the various uses of histograms in digital image processing and summarize how each type of histogram is used.", "value": "1"}]}]}, {"name": "1. Describe the process for creating a mosaic from individual raster data tiles", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the process taken to prepare a mosaic from individual raster data tiles.", "value": "1"}]}]}, {"name": "2. Compare and contrast the following methods for visually representing raster datasets: equal interval, quartile, percentile, Jenks, and histogram normalize", "children": [{"name": "Application (A)", "children": [{"name": "Compare/contrast the following methods for visually representing raster datasets: equal interval, quartile, percentile, Jenks natural breaks, histogram normalization", "value": "1"}]}]}, {"name": "3. Calculate area based upon class", "children": [{"name": "Application (A)", "children": [{"name": "Determine the area of a figure based upon the figure’s class.", "value": "1"}]}]}, {"name": "4. Describe the process of re-sampling data", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between the various methods of resampling data and explain when each method would be used.", "value": "1"}]}]}, {"name": "5. Georeference an image using least squares fitting methods", "children": [{"name": "Application (A)", "children": [{"name": "Determine how an image should be georeferenced using least squares fitting methods.", "value": "1"}]}]}, {"name": "6. Interpolate data to a raster layer from point data using inverse distance weighting", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how inverse distance weighting is used to interpolate data to a raster layer from point data.", "value": "1"}]}]}, {"name": "7. Convert from raster to vector and vector to raster", "children": [{"name": "Application (A)", "children": [{"name": "Compare/contrast methods of converting data from raster formats to vector formats and from vector formats to raster formats.", "value": "1"}]}]}, {"name": "8. Create metadata for raster data", "children": [{"name": "Application (A)", "children": [{"name": "Create an example of metadata for raster data.", "value": "1"}]}]}, {"name": "9. Describe the data storage model for raster data", "children": [{"name": "Application (A)", "children": [{"name": "Describe a data storage model for raster data.", "value": "1"}]}]}, {"name": "10. Define and list lossy and lossless raster data types and data compression", "children": [{"name": "Application (A)", "children": [{"name": "Define and list lossy and lossless raster data types.", "value": "1"}, {"name": "Define and list raster data compression methods.", "value": "1"}]}]}, {"name": "11. Select data based upon cell value", "children": [{"name": "Application (A)", "children": [{"name": "Select data based upon cell value.", "value": "1"}]}]}, {"name": "12. Describe a process to rescale raster data", "children": [{"name": "Application (A)", "children": [{"name": "Describe techniques used to rescale raster data.", "value": "1"}]}]}, {"name": "13. Calculate ground sample distance when provided sensor size, sensing element size, focal length, and height", "children": [{"name": "Application (A)", "children": [{"name": "Calculate ground sample distance when provided sensor size, sensing element size, focal length, and height.", "value": "1"}]}]}, {"name": "14. Distinguish among x-ray, gamma ray, ultraviolet, visible, infra-red, far infra-red, microwave wavelengths", "children": [{"name": "Application (A)", "children": [{"name": "Distinguish among x-ray, gamma ray, ultraviolet, visible, infra-red, far infra-red, microwave portions of the electromagnetic spectrum.", "value": "1"}]}]}, {"name": "15. Define the Normalized Difference Vegetation Index (NDVI) and the wavelengths used for its calculation", "children": [{"name": "Application (A)", "children": [{"name": "Define the Normalized Difference Vegetation Index (NDVI) and the wavelengths used for its calculation.", "value": "1"}]}]}, {"name": "16. Define \"lossy\" image compression methods, pyramids, and caching", "children": [{"name": "Application (A)", "children": [{"name": "Compare/contrast the various “lossy” image compression methods, “lossy” pyramids, and caching of “lossy” data.", "value": "1"}]}]}, {"name": "17. Identify common lossy raster data formats", "children": [{"name": "Application (A)", "children": [{"name": "Characterize common lossy raster data formats.", "value": "1"}]}]}]}, {"name": "T33. Spatial Topology", "children": [{"name": "1. Describe fundamental rules for how common geographic features relate to one another (ex: counties must be within states, which must be within countries)", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize the fundamental rules for how common geographic features relate to one another.", "value": "1"}, {"name": "Characterize nation-specific differences between rules for how common geographic features relate to one another.", "value": "1"}]}]}, {"name": "2. Create a Venn diagram that illustrates the spatial relationship among different objects", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Assess the spatial relationships among a group of objects.", "value": "1"}]}]}, {"name": "1. List and describe the fundamental tables required in a geospatial database needed to support topological relationships", "children": [{"name": "Foundational (F)", "children": [{"name": "List and summarize the fundamental tables required in a geospatial database to support topological relationships.", "value": "1"}]}]}, {"name": "2. Define topology", "children": [{"name": "Foundational (F)", "children": [{"name": "Define topology and summarize why it is important to geographic information systems.", "value": "1"}]}]}, {"name": "3. Describe how topologic rules may be used to ensure the integrity of a dataset", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify how topologic rules can verify the integrity of a dataset.", "value": "1"}]}]}, {"name": "4. Identify two or more topologic rules needed to manage a cadastral dataset", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify topologic rules used to manage cadastral datasets.", "value": "1"}]}]}, {"name": "5. Describe the use of topology for spatial statistical analysis", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how topology is used for spatial statistical analyses.", "value": "1"}]}]}, {"name": "6. Author appropriate topology rules based on project needs", "children": [{"name": "Foundational (F)", "children": [{"name": "Determine appropriate topology rules based on the needs of a project.", "value": "1"}]}]}, {"name": "7. Create a logic diagram which illustrates the application of topology to a data model", "children": [{"name": "Foundational (F)", "children": [{"name": "Determine an appropriate logic diagram that illustrates how to apply topology to a data model.", "value": "1"}]}]}, {"name": "8. List and describe the fundamental tables required to create and maintain topology in a relational database", "children": [{"name": "Foundational (F)", "children": [{"name": "Compare/contrast the fundamental tables required to create and maintain topology in a relational database.", "value": "1"}]}]}, {"name": "9. Provide two fundamental topologic rules for managing parcel datasets (must not overlap, must not have gaps)", "children": [{"name": "Foundational (F)", "children": [{"name": "Differentiate between the fundamental topologic rules for managing various datasets (e.g., parcel datasets, road network datasets).", "value": "1"}]}]}, {"name": "10. Provide two fundamental topologic rules for managing road network datasets (must not have dangles, must not overshoot)", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}]}, {"name": "T34. Data Selection and Validation", "children": [{"name": "1. Define precision, accuracy, the uncertainty of measurement, relative uncertainty, the absolute uncertainty of measurement.", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Define the following terms and summarize why there are important for data selection and validation: precision, accuracy, uncertainty of measurement, relative uncertainty, absolute uncertainty of measurement", "value": "1"}]}]}, {"name": "2. List System International (SI) and Imperial units for distance, direction, velocity, voltage, luminance, illuminance, energy, and work", "children": [{"name": "Prerequisites (P)", "children": [{"name": "List the System International (SI) and Imperial units for the following: distance, direction, velocity, voltage, luminance, illuminance, energy, and work", "value": "1"}]}]}, {"name": "3. Use dimensional analysis to convert units of measure and perform calculations", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Define dimensional analysis and determine when it should and should not be used to convert units of measure.", "value": "1"}]}]}, {"name": "4. Round numbers", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Decide when to round and truncate numbers.", "value": "1"}]}]}, {"name": "5. Truncate numbers", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Differentiate between rounding and truncation.", "value": "1"}]}]}, {"name": "6. Differentiate between rounding and truncation", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "7. Define integer and ratio data", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Identify integer and ratio data.", "value": "1"}, {"name": "Compare/contrast integer and ratio data.", "value": "1"}]}]}, {"name": "8. Compare and contrast qualitative and quantitative data", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Compare/contrast qualitative and quantitative data.", "value": "1"}]}]}, {"name": "9. Use a spreadsheet to create basic tables", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Interpret data in a spreadsheet in order to create basic tables.", "value": "1"}]}]}, {"name": "10. Use a spreadsheet to add, subtract, multiply and divide", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Outline how to perform basic math operations (e.g., addition, subtraction, multiplication, division) in a spreadsheet.", "value": "1"}]}]}, {"name": "1. Calculate simple potential for error using significant digits", "children": [{"name": "Foundational (F)", "children": [{"name": "Determine the simple potential for error using significant digits.", "value": "1"}]}]}, {"name": "2. Compare and contrast precision and accuracy", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the concepts of precision and accuracy and summarize their relationship.", "value": "1"}]}]}, {"name": "3. Compare and contrast absolute accuracy and relative accuracy", "children": [{"name": "Foundational (F)", "children": [{"name": "Define absolute accuracy and relative accuracy and summarize the relationship between the two.", "value": "1"}]}]}, {"name": "4. List measures of central tendency and measures of dispersion", "children": [{"name": "Foundational (F)", "children": [{"name": "List the different measures of central tendency and measures of dispersion.", "value": "1"}]}]}, {"name": "5. Define and calculate the mean, median, mode, frequency, range, and quartile", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how to calculate the following: mean, median, mode, frequency, range, and quartile", "value": "1"}]}]}, {"name": "6. Define and calculate standard deviation, standard error, skewness, and kurtosis", "children": [{"name": "Foundational (F)", "children": [{"name": "Define the following terms and summarize how each is calculated: standard deviation, standard error, skewness, and kurtosis", "value": "1"}]}]}, {"name": "7. Calculate the precision of the measure", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how the precision of a measurement is calculated.", "value": "1"}]}]}, {"name": "8. Calculate relative error and relative uncertainty", "children": [{"name": "Foundational (F)", "children": [{"name": "Define relative error and relative uncertainty and summarize the relationship between the two.", "value": "1"}, {"name": "Summarize how relative error and relative uncertainty are calculated.", "value": "1"}]}]}, {"name": "9. Define random errors", "children": [{"name": "Foundational (F)", "children": [{"name": "Define random error and systematic error and summarize the relationship between the two.", "value": "1"}]}]}, {"name": "10. Define systemic errors", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "11. List common causes of error", "children": [{"name": "Foundational (F)", "children": [{"name": "List common causes of random error and systematic error.", "value": "1"}]}]}, {"name": "12. List and define the means for the propagation of error", "children": [{"name": "Foundational (F)", "children": [{"name": "List and define the means for the propagation of error.", "value": "1"}]}]}, {"name": "13. Define correlated and independent measures", "children": [{"name": "Foundational (F)", "children": [{"name": "Define correlated and independent measures.", "value": "1"}]}]}, {"name": "14. Identify normal, binomial, and discrete rare event distributions", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify normal, binomial, and discrete rare event distributions.", "value": "1"}]}]}, {"name": "15. Define confidence interval and percent confidence", "children": [{"name": "Foundational (F)", "children": [{"name": "Define confidence interval and percent confidence.", "value": "1"}]}]}, {"name": "16. List and describe the potential for error associated with various qualitative sampling methods", "children": [{"name": "Foundational (F)", "children": [{"name": "List and summarize the potential for error associated with various qualitative sampling methods.", "value": "1"}]}]}, {"name": "17. Compare and contrast the characteristics of structured vs non-structured data", "children": [{"name": "Foundational (F)", "children": [{"name": "Compare/contrast the characteristics of structured and non-structured data.", "value": "1"}]}]}, {"name": "18. Describe the fundamental risks associated with crowd-sourced data and suggest methods which may be used to overcome risk", "children": [{"name": "Foundational (F)", "children": [{"name": "Characterize the fundamental risks associated with crowd-sourced data.", "value": "1"}, {"name": "Determine methods overcome risks associated with crowd-sourced data.", "value": "1"}]}]}, {"name": "19. Define the role of metadata as it relates to geodata", "children": [{"name": "Foundational (F)", "children": [{"name": "Compare/contrast the types of information that may be included in metadata and summarize how it relates to geodata.", "value": "1"}]}]}, {"name": "20. List at least 5 critical components required in metadata (Author, generation date, attribute descriptions, attribute units of measure, projection and coordinate system, collection scale or resolution, source method, horizontal/vertical accuracy, modification dates)", "children": [{"name": "Foundational (F)", "children": [{"name": "Categorize the metadata components (e.g., Author, generation date, attribution descriptions, etc.) according to their level of importance (e.g., critical, important, etc.) of maintaining geospatial data.", "value": "1"}]}]}, {"name": "21. Identify the correct primary data standards organization governing civilian US Federal data standards.", "children": [{"name": "Foundational (F)", "children": [{"name": "Organize data standards organizations according to whether they govern civilian, United States Federal, United States military, or international geospatial data standards.", "value": "1"}]}]}, {"name": "Identify the correct primary data standards organization governing US military data standards.", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "22. Identify the two international standards organizations for geospatial data", "children": [{"name": "Foundational (F)", "children": [{"name": "Compare/contrast the United Nations committee for Global Spatial Data Infrastructure (GSDI) and the Open Geospatial Consortium (OGC) specifications for geospatial data.", "value": "1"}]}]}, {"name": "23. Identify the primary US standards organization for units of measure", "children": [{"name": "Foundational (F)", "children": [{"name": "Compare/contrast Imperial units of measurement and System International (SI) units of measurement.", "value": "1"}]}]}, {"name": "24. Identify the primary international standards organization for units of measure", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "25. Identify the primary international organization for printed page size", "children": [{"name": "Foundational (F)", "children": [{"name": "Characterize international standards organizations requirement for printed page size.", "value": "1"}]}]}, {"name": "26. Define the standard page/paper sizes", "children": [{"name": "Foundational (F)", "children": [{"name": "Compare the following page sizes: ISO series A, B, and C and ANSI A-E", "value": "1"}]}]}, {"name": "27. Describe data and position \"spoofing\"", "children": [{"name": "Foundational (F)", "children": [{"name": "Contrast data “spoofing” and position “spoofing.”", "value": "1"}]}]}, {"name": "28. Determine requirements for precision and accuracy", "children": [{"name": "Foundational (F)", "children": [{"name": "Determine requirements for precision and accuracy.", "value": "1"}]}]}, {"name": "29. List and describe the steps used for an error analysis", "children": [{"name": "Foundational (F)", "children": [{"name": "Verify that the steps necessary to conduct an error analysis have been performed correctly.", "value": "1"}]}]}, {"name": "30. Conduct methods appropriate error analysis for quantitative and qualitative data sets used to construct geographic layers and their attributes", "children": [{"name": "Foundational (F)", "children": [{"name": "Determine which error analysis method should be used for quantitative and qualitative data sets that are used to construct geographic layers and their attributes. ", "value": "1"}]}]}, {"name": "31. Use R-Squared values to determine the appropriateness of use for imagery (example: targeting vs. general positioning)", "children": [{"name": "Foundational (F)", "children": [{"name": "Determine what the most appropriate use of imagery is (e.g., targeting, general positioning) based on the image R-Squared value.", "value": "1"}]}]}, {"name": "32. List and describe the categories of error as associated with Intelligence Community Directive (ICD) 203", "children": [{"name": "Foundational (F)", "children": [{"name": "Differentiate the categories of error associated with Intelligence Community Directive (ICD) 203 from each other.", "value": "1"}]}]}, {"name": "33. Assess the probability of Type I and Type II error", "children": [{"name": "Foundational (F)", "children": [{"name": "Determine the probability of Type I and Type II error.", "value": "1"}]}]}, {"name": "34. Identify the three main categories of error", "children": [{"name": "Foundational (F)", "children": [{"name": "Compare/contrast the main categories of error.", "value": "1"}]}]}, {"name": "35. List at least five common sources of error in geospatial data sets", "children": [{"name": "Foundational (F)", "children": [{"name": "Characterize the common sources of error found in geospatial datasets.", "value": "1"}]}]}, {"name": "36. Calculate relative error and absolute error", "children": [{"name": "Foundational (F)", "children": [{"name": "Compare/contrast relative error and absolute error and characterize how each is calculated.", "value": "1"}]}]}, {"name": "37. Identify cases where data self-validate a model", "children": [{"name": "Foundational (F)", "children": [{"name": "Determine whether data can self-validate a model.", "value": "1"}]}]}, {"name": "38. Identify when it is appropriate to combine data sets of different ages, spatial resolutions, numeric types, and collection methods", "children": [{"name": "Foundational (F)", "children": [{"name": "Determine when it is and is not appropriate to combine data sets of different ages, spatial resolutions, numeric types, and collection methods.", "value": "1"}]}]}, {"name": "1. Advanced statistical modeling techniques", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Integrate advanced statistical modeling techniques into geospatial data selection and validation.", "value": "1"}]}]}, {"name": "2. Technical writing skills", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Generate useable products by utilizing advanced technical writing skills.", "value": "1"}]}]}, {"name": "3. Programming skills", "children": [{"name": "MASTERY/UGP (M/U)", "children": [{"name": "Implement advanced programming skills to efficiently and effectively select and validate data.", "value": "1"}]}]}]}, {"name": "T35. Spatial Data Structures and Models", "children": [{"name": "1. Completion of a high school-level computer fundamentals course", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Execute basic computer tasks including typing, use of commercial software products, navigating file systems, reading and writing computer files, internet navigation, downloading and uploading files.", "value": "1"}]}]}, {"name": "1. Given a file size and transfer rate, calculate transmission time", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify transmission time given a file’s size and transfer rate.", "value": "1"}]}]}, {"name": "2. Describe how a binary system is used to store, retrieve, and compute data", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how a binary system is used to store, retrieve, and compute data.", "value": "1"}]}]}, {"name": "3. Differentiate between attribute and geographic components for a spatial data set", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify attribute and geographic components within a spatial data set.", "value": "1"}]}]}, {"name": "4. Describe the information needed to construct point, line, and polygon features", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize what information is needed to construct point, line, and polygon features.", "value": "1"}, {"name": "Summarize what information is needed to display three-dimensional (3D) data (e.g., voxels).", "value": "1"}]}]}, {"name": "5. Describe the relationship between spatial data file size and spatial resolution", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the relationship between spatial data file size and spatial resolution.", "value": "1"}]}]}, {"name": "6. List the primary considerations when establishing specifications for a spatial data model", "children": [{"name": "Foundational (F)", "children": [{"name": "List the primary considerations taken into account when establishing specifications for a spatial data model.", "value": "1"}]}]}, {"name": "7. List the primary considerations when selecting geometry type", "children": [{"name": "Foundational (F)", "children": [{"name": "List the primary considerations taken into account when selecting geometry type.", "value": "1"}]}]}, {"name": "1. Describe the following data storage models: flat, hierarchical, network, and relational", "children": [{"name": "Application (A)", "children": [{"name": "Compare/contrast the following data storage models: flat, hierarchical, network, and relational", "value": "1"}]}]}, {"name": "2. Describe the fundamental tables required to create and maintain topology in a relational database", "children": [{"name": "Application (A)", "children": [{"name": "Classify the fundamental tables required to create and maintain topology in a relational database.", "value": "1"}]}]}, {"name": "3. Define dynamic segmentation and linear referencing and provide general descriptions of how these factors are modeled in spatial data structures", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how dynamic segmentation and linear referencing are modeling in spatial data structures.", "value": "1"}]}]}, {"name": "4. List appropriate cell shapes for raster data and compare and contrast their corresponding use cases", "children": [{"name": "Application (A)", "children": [{"name": "Classify which cell shapes are appropriate for use in raster data.", "value": "1"}, {"name": "Compare/contrast the use cases for cell shapes used in raster data.", "value": "1"}]}]}, {"name": "5. Define tessellation", "children": [{"name": "Application (A)", "children": [{"name": "Characterize a tessellation and how it is created.", "value": "1"}]}]}, {"name": "6. Describe the structure of a fundamental raster dataset. Include the information required in the header.", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the structure and components of a fundamental raster dataset.", "value": "1"}]}]}, {"name": "7. Identify the shapes associated with entities, attributes, and relationships in Entity-Relationship Diagrams (ERD)", "children": [{"name": "Application (A)", "children": [{"name": "Categorize shapes associated with entities, attributes, and their relationships in Entity-Relationship Diagrams (ERD).", "value": "1"}]}]}, {"name": "8. Define cardinality and list the three possible cases", "children": [{"name": "Application (A)", "children": [{"name": "Characterize database cardinality and possible cases associated with cardinality.", "value": "1"}]}]}, {"name": "9. Differentiate between a spatial join and an attribute join", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between a spatial join and an attribute join.", "value": "1"}]}]}, {"name": "10. Differentiate between a relationship class and a related table", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between a relationship class and a related table.", "value": "1"}]}]}, {"name": "11. Given an image resolution and dimensions, calculate its approximate size on disk", "children": [{"name": "Application (A)", "children": [{"name": "Determine the approximate disk size given an image resolution and dimensions.", "value": "1"}]}]}, {"name": "12. Describe the purpose of a Redundant Array of Independent/Inexpensive Disks (RAID)", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the purpose of Redundant Array of Independent/Inexpensive Disks (RAID) and differentiate the different levels of RAID.", "value": "1"}]}]}, {"name": "13. Describe cloud computing", "children": [{"name": "Application (A)", "children": [{"name": "Characterize cloud computing and its use in data structures and models.", "value": "1"}]}]}, {"name": "14. Identify appropriate strategies for disaster recovery", "children": [{"name": "Application (A)", "children": [{"name": "Determine the most appropriate strategies for disaster recovery.", "value": "1"}]}]}, {"name": "15. Describe versioning and identify its potential uses", "children": [{"name": "Application (A)", "children": [{"name": "Characterize versioning and differentiate between its potential uses in data structures and models.", "value": "1"}]}]}, {"name": "16. Define parity as it applies to storage solutions and data structures", "children": [{"name": "Application (A)", "children": [{"name": "Characterize parity and compare/contrast how it is applied to data storage solutions and data structures.", "value": "1"}]}]}]}]}, {"name": "GIS & ANALYSIS TOOLS", "children": [{"name": "T1. Vector and Vectorization (e.g., digitization)", "children": [{"name": "1. Perform addition and subtraction using a number line", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize how a number line can be used to perform basic math functions (e.g., addition and subtraction).", "value": "1"}]}]}, {"name": "2. Plot an x,y point using a cartesian coordinate system based graph", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Discern where an x,y point should be plotted on a graph using a cartesian coordinate system.", "value": "1"}, {"name": "Discern where an x,y point should be plotted on a graph using a polar coordinate system.", "value": "1"}]}]}, {"name": "3. Plot a point using a polar coordinate system", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Compare/Contrast various coordinate systems (e.g., cartesian, polar, etc.).", "value": "1"}]}]}, {"name": "4. Connect ordered points on a graph together using a line", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Identify how ordered points on a graph should be connected.", "value": "1"}]}]}, {"name": "5. Solve for any one side of a triangle using the Pythagorean Theorem", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Determine the length of one side of a triangle using the Pythagorean Theorem.", "value": "1"}]}]}, {"name": "6. Trace a feature", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Define what it means to trace a feature and outline the steps taken to perform a trace.", "value": "1"}]}]}, {"name": "7. Connect ordered dots", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Determine how ordered dots should be connected.", "value": "1"}]}]}, {"name": "1. Calculate angular displacement for polar and cartesian coordinate system", "children": [{"name": "Foundational (F)", "children": [{"name": "Define angular displacement and summarize how it is calculated for a polar and cartesian coordinate system.", "value": "1"}]}]}, {"name": "2. List and describe the relationship among the general tables used for vector data models", "children": [{"name": "Foundational (F)", "children": [{"name": "List the general tables used for vector data models and summarize their uses.", "value": "1"}, {"name": "Outline the relationship between the various general tables used for vector data models.", "value": "1"}]}]}, {"name": "3. Define the three fundamental geometries", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the role points, lines, polygons, and surfaces play in vectorization.", "value": "1"}]}]}, {"name": "4. Describe the relationship between image resolution and positional error for digitized features", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the relationship between image resolution and positional error for digitized features.", "value": "1"}]}]}, {"name": "5. Describe the relationship between image resolution and feature shape/identification", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the relationship between image resolution and feature shape/identification.", "value": "1"}]}]}, {"name": "6. Describe the effect of caching of imagery on the digitizing process", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the effect caching of imagery has on the digitizing process.", "value": "1"}]}]}, {"name": "7. Match effective/appropriate scale to imagery resolution when digitizing features", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify the most effective and appropriate scale to use when digitizing features given the resolution of an image.", "value": "1"}]}]}, {"name": "8. Define supervised imagery classification", "children": [{"name": "Foundational (F)", "children": [{"name": "Compare supervised imagery classification and unsupervised imagery classification and summarize how each are used when digitizing images.", "value": "1"}]}]}, {"name": "9. Define unsupervised imagery classification", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "10. List the advantages and disadvantages of converting raster to vector data", "children": [{"name": "Foundational (F)", "children": [{"name": "Compare the advantages and disadvantages of converting raster data to vector data.", "value": "1"}, {"name": "Summarize the process taken to convert raster data into vector data.", "value": "1"}]}]}, {"name": "11. Define attribute", "children": [{"name": "Foundational (F)", "children": [{"name": "Define what an attribute is and summarize the purpose it has in the digitization of an image.", "value": "1"}]}]}, {"name": "12. Define attribute data types (text, Boolean, single precision, double precision, date, and time)", "children": [{"name": "Foundational (F)", "children": [{"name": "List the different attribute data types and summarize the role they play in the digitization of images.", "value": "1"}]}]}, {"name": "13. Explain the relationship between scale and vertex placement", "children": [{"name": "Foundational (F)", "children": [{"name": "Define scale and vertex placement and outline the relationship they have with each other.", "value": "1"}]}]}, {"name": "1. Perform simple arithmetic involving coordinates", "children": [{"name": "Application (A)", "children": [{"name": "Determine the appropriate arithmetic that should be performed on coordinates based on how the coordinates will be used.", "value": "1"}]}]}, {"name": "2. Select an appropriate spacing of vertices with respect to source imagery scale", "children": [{"name": "Application (A)", "children": [{"name": "Determine the how vertices should be spaced given the scale of a source image.", "value": "1"}]}]}, {"name": "3. Select an appropriate scale for digitizing features based upon source imagery resolution", "children": [{"name": "Application (A)", "children": [{"name": "Determine what scale should be used to digitize features given the resolution of a source image.", "value": "1"}]}]}, {"name": "4. Draw a basic data model for point, polyline, and polygon data", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how basic data models change when they are developed for point, polyline, and polygon data.", "value": "1"}]}]}, {"name": "5. Define attribute data types (float, double, text, Boolean, and similar)", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast float, double, test, and Boolean attribute data types.", "value": "1"}]}]}, {"name": "6. List and describe at least three means for smoothing digitized features", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the different means for smoothing digitized features.", "value": "1"}]}]}, {"name": "7. List and describe at least three methods for simplifying complex features when digitizing", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between the various methods used to simplify complex features when digitizing images.", "value": "1"}]}]}, {"name": "8. Digitize route features into a geographic network (m-values)", "children": [{"name": "Application (A)", "children": [{"name": "Determine how digitized route features should be converted into a geographic network (i.e., m-values).", "value": "1"}]}]}, {"name": "9. Digitize terrain features with elevation into a topographic data model (z-values)", "children": [{"name": "Application (A)", "children": [{"name": "Determine how elevated terrain features should be converted in a topographic data model (i.e., z-values).", "value": "1"}]}]}, {"name": "10. Digitize features with respect to time (spatio-temporal representation)", "children": [{"name": "Application (A)", "children": [{"name": "Interpret how features can be digitized with respect to time (i.e., spatio-temporal representation).", "value": "1"}]}]}, {"name": "11. Given a set of bearings and distances, create a polygon or line as appropriate", "children": [{"name": "Application (A)", "children": [{"name": "Determine what polygon or line should be created (e.g., polygon, line) given a set of bearings and distances.", "value": "1"}]}]}, {"name": "1. Statistical methods for smoothing features", "children": [{"name": "Mastery/UGP (M/U)", "children": [{"name": "Evaluate the advantages and disadvantages of current statistical methods for smoothing features to develop more efficient methods.", "value": "1"}]}]}, {"name": "2. Statistical methods for interpolating missing points/vertices", "children": [{"name": "Mastery/UGP (M/U)", "children": [{"name": "Establish methods for interpolating missing points and/or vertices in an image.", "value": "1"}]}]}, {"name": "3. Design 4D data models which support vectorization", "children": [{"name": "Mastery/UGP (M/U)", "children": [{"name": "Establish methods for developing 4D data models that support vectorization.", "value": "1"}]}]}]}, {"name": "T2. Raster", "children": [{"name": "1. Define pixel, tone, contrast, digital number, dynamic range, and brightness as they relate to photography", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Define the following terms and outline how they relate to photography: pixel, tone, contrast, digital number, dynamic range, and brightness as they relate to photography", "value": "1"}]}]}, {"name": "2. Label the components of a diagram depicting the major components of a digital camera", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Identify the major components of a digital camera and summarize their purpose.", "value": "1"}]}]}, {"name": "3. Define resolution and image scale", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Define resolution and image scale and summarize the role they play in collecting raster data.", "value": "1"}]}]}, {"name": "4. Perform basic arithmetic", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Connect basic math principles (e.g., averaging a list of numbers, creating bar graphs, discrete numbers, continuous numbers) to other fields of work such as science.", "value": "1"}]}]}, {"name": "5. Create a bar graph", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "6. Average a list of numbers", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "7. Differentiate between discrete and continuous numeric data", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "8. Describe \"least squares\" and residual", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Define “least squares” and residual and summarize what information they provide.", "value": "1"}]}]}, {"name": "1. List and describe the advantages and disadvantages of converting vector data to raster", "children": [{"name": "Foundational (F)", "children": [{"name": "Compare the advantages and disadvantages of converting raster data to vector data.", "value": "1"}, {"name": "Summarize the process taken to convert raster data into vector data.", "value": "1"}]}]}, {"name": "2. List and describe the following sources for raster data: direct acquisition by a sensor system, scanning, interpolation, conversion from vector data, and map algebra or similar analytic processes", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline the similarities and differences between the following raster data sources: direct acquisition by a sensor system, scanning, interpolation, conversion from vector data, and map algebra or similar analytic processes", "value": "1"}]}]}, {"name": "3. Describe quantization", "children": [{"name": "Foundational (F)", "children": [{"name": "Define quantization and summarize its role in analyzing raster data.", "value": "1"}]}]}, {"name": "4. Describe the process of converting an electrical signal to a pixel value", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline the process of converting an electrical signal into a pixel value.", "value": "1"}]}]}, {"name": "5. List three common cell types used in a Tessellation model", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify common cell types used in Tessellation models.", "value": "1"}]}]}, {"name": "6. Describe a Tessellation model", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize what a Tessellation model is and how it is used with raster data.", "value": "1"}]}]}, {"name": "7. Define image caching", "children": [{"name": "Foundational (F)", "children": [{"name": "Define image caching and summarize why it is important when working with raster data.", "value": "1"}]}]}, {"name": "8. Describe the effects of transforming raster data from one coordinate system to another", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify how raster data is affected when it is transformed from one coordinate system into another coordinate system.", "value": "1"}]}]}, {"name": "9. Compare and contrast 8-bit and 24-bit imagery", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the similarities and differences between 8-bit imagery and 24-bit imagery.", "value": "1"}]}]}, {"name": "10. Describe the process of representing color using a 24-bit image", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify how color is represented in a 24-bit image.", "value": "1"}, {"name": "Summarize the process performed to represent color in a 24-bit image.", "value": "1"}]}]}, {"name": "11. Describe the process used for transmitting images using electro optical sensor systems", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline the process taken to prepare and transmit images using electro-optical sensor systems.", "value": "1"}]}]}, {"name": "12. Compare and contrast georeferencing, orthorectification, and georectification of raster data", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the similarities and differences between georeferencing, orthorectification, and georectification of raster data.", "value": "1"}]}]}, {"name": "13. Create a histogram which represents the distribution of values in a raster image", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline the process taken to create a histogram that represent the distribution of values in a raster image and summarize why it is important to understand the distribution of values.", "value": "1"}]}]}, {"name": "14. Explain the use of histograms in digital image processing", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify the various uses of histograms in digital image processing and summarize how each type of histogram is used.", "value": "1"}]}]}, {"name": "1. Describe the process for creating a mosaic from individual raster data tiles", "children": [{"name": "Application (A)", "children": [{"name": "Order the steps taken to create a mosaic from individual raster data tiles.", "value": "1"}]}]}, {"name": "2. Compare and contrast the following methods for visually representing raster data sets: equal interval, quartile, percentile, Jenks, and histogram normalize", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the following methods for visually representing raster data sets: equal interval, quartile, percentile, Jenks, and histogram normalize", "value": "1"}]}]}, {"name": "2. Calculate area based upon class", "children": [{"name": "Application (A)", "children": [{"name": "Determine the total area of value in a raster dataset using the value’s class.", "value": "1"}]}]}, {"name": "3. Describe the process of re-sampling data", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between the various methods used to resample data and explain when each method is used.", "value": "1"}]}]}, {"name": "4. Georeference an image using least squares", "children": [{"name": "Application (A)", "children": [{"name": "Determine how an image should be georeferenced using least squares.", "value": "1"}]}]}, {"name": "5. Interpolate data to a raster layer from point data using inverse distance weighted", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how inverse distance weighted is used to interpolate data to a raster layer from point data.", "value": "1"}]}]}, {"name": "6. Convert from raster to vector and vector to raster", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the process of converting raster data to vector data.", "value": "1"}, {"name": "Compare/Contrast how vector data is converted to raster data.", "value": "1"}]}]}, {"name": "7. Create metadata for raster data", "children": [{"name": "Application (A)", "children": [{"name": "Distinguish how metadata is created for raster data.", "value": "1"}]}]}, {"name": "8. Describe the data storage model for raster data", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between the various models used to store data and identify which models are appropriate for raster data.", "value": "1"}]}]}, {"name": "9. Define and list lossy raster data types", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the different types of lossy raster data.", "value": "1"}]}]}, {"name": "10. Select data based upon digital number", "children": [{"name": "Application (A)", "children": [{"name": "Classify how data is selected based upon digital numbers.", "value": "1"}]}]}, {"name": "11. Describe when it is appropriate to re-scale raster data", "children": [{"name": "Application (A)", "children": [{"name": "Determine when it is and is not appropriate to re-scale raster data.", "value": "1"}]}]}, {"name": "12. Calculate ground sample distance when provided sensor size, sensing element size, focal length, and height", "children": [{"name": "Application (A)", "children": [{"name": "Determine ground sample distance when provided sensor size, sensing element size, focal length, and height.", "value": "1"}]}]}, {"name": "13. Distinguish among x-ray, gamma ray, ultraviolet, visible, infra-red, far infra-red, microwave wavelengths using wavelength", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the following wavelengths: x-ray, gamma ray, ultraviolet, visible, infra-red, far infra-red, microwave wavelengths using wavelength", "value": "1"}]}]}, {"name": "14. Define Normalized Difference Vegetation Index (NDVI) and the wavelengths used for its calculation", "children": [{"name": "Application (A)", "children": [{"name": "Interpret a Normalized Difference Vegetation Index (NDVI) and distinguish which wavelengths are used to calculate the NDVI.", "value": "1"}]}]}, {"name": "15. Define \"lossy\" methods, pyramids, and caching", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the various “lossy” methods, “lossy” pyramids, and caching of “lossy” data.", "value": "1"}]}]}, {"name": "16. Identify common lossy raster data formats", "children": [{"name": "Application (A)", "children": [{"name": "Characterize common lossy raster data formats.", "value": "1"}]}]}]}, {"name": "T3. Fundamentals of Geodesic Science, Geographically Referencing Spatial Information, and Positioning", "children": [{"name": "1. Solve for one variable in the Pythagorean Theorem", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Solve for one variable in the Pythagorean Theorem.", "value": "1"}]}]}, {"name": "2. Solve univariate equations", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Solve univariate equations.", "value": "1"}]}]}, {"name": "3. Solve univariate polynomial", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Solve univariate polynomial.", "value": "1"}]}]}, {"name": "4. Convert fractions to decimals and vice-versa", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Convert fractions to decimals and vice-versa.", "value": "1"}]}]}, {"name": "5. Plot an x/y point on a map", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Plot an x/y point on a map.", "value": "1"}]}]}, {"name": "6. Plot a polar coordinate", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Plot a polar coordinate.", "value": "1"}]}]}, {"name": "7. Describe the purpose of map projections and coordinate systems", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Describe the purpose of map projections and coordinate systems.", "value": "1"}]}]}, {"name": "8. Provide a generalized description of Global Positioning System (GPS)", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Provide a generalized description of Global Positioning System (GPS).", "value": "1"}]}]}, {"name": "1. Transform point coordinate systems among planar and spherical coordinate systems", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how to transform a point coordinate system among planar and spherical coordinate systems.", "value": "1"}]}]}, {"name": "2. Distinguish between polar and cartesian style coordinate systems", "children": [{"name": "Foundational (F)", "children": [{"name": "Compare/Contrast various coordinate systems (e.g., cartesian, polar, etc.).", "value": "1"}]}]}, {"name": "3. List the major components used to describe the ellipsoid", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify the major components used to describe an ellipsoid.", "value": "1"}]}]}, {"name": "4. Compare and contrast geoid with ellipsoid", "children": [{"name": "Foundational (F)", "children": [{"name": "Categorize components that determine whether an object is a geoid or an ellipsoid.", "value": "1"}]}]}, {"name": "5. Compare and contrast orthometric vs ellipsoid heights", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the similarities and differences between orthometric and ellipsoid heights.", "value": "1"}]}]}, {"name": "6. Plot a spherical coordinate on a map without the aid of a computer", "children": [{"name": "Foundational (F)", "children": [{"name": "Define how to manually plot various types of coordinates (e.g., spherical, planar) on a map without the aid of a computer.", "value": "1"}]}]}, {"name": "7. Plot a planar coordinate on a map without the aid of a computer", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "8. Convert a coordinate from decimal degrees to degrees, minutes, and seconds and vice versa", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the relationship between decimal degrees, degrees, minutes, and seconds.", "value": "1"}, {"name": "Summarize how to convert a coordinate from decimal degrees to degrees, minutes, and seconds and vice versa.", "value": "1"}]}]}, {"name": "9. List and describe the three major components of a GPS systems", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify the major components of a Global Positioning System (GPS) and explain how each are used.", "value": "1"}]}]}, {"name": "10. Describe the three fundamental styles of map projection", "children": [{"name": "Foundational (F)", "children": [{"name": "List the three fundamental styles of map projection and explain how each style is utilized.", "value": "1"}]}]}, {"name": "11. List the primary defining features of a cylindrical, conical, and azimuthal projection", "children": [{"name": "Foundational (F)", "children": [{"name": "List the primary defining features of a cylindrical, conical, and azimuthal projection.", "value": "1"}]}]}, {"name": "12. Describe what is meant by \"unprojected\" map data", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize what “unprojected” map data is and how it is used in georeferencing and positioning.", "value": "1"}]}]}, {"name": "13. Describe address georeferencing/geocoding", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the principle of address georeferencing and geocoding.", "value": "1"}]}]}, {"name": "14. Differentiate between georeferencing and orthorectification of imagery", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the similarities and differences between georeferencing and orthorectification of an image.", "value": "1"}]}]}, {"name": "1. Choose the appropriate coordinate system and projection based upon use (planar for engineering solutions and targeting vs web auxiliary Mercator for web view)", "children": [{"name": "Application (A)", "children": [{"name": "Determine which coordinate system and projection is most appropriate to use given the end use of a map.", "value": "1"}]}]}, {"name": "2. Estimate the error associated with converting among planar and spherical coordinates", "children": [{"name": "Application (A)", "children": [{"name": "Determine how much error occurs when converting planar coordinates to spherical coordinates.", "value": "1"}, {"name": "Determine how much error occurs when converting spherical coordinates to planar coordinates.", "value": "1"}]}]}, {"name": "3. Describe the effects of gravity and the Earth's magnetic field upon coordinate measurement", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how gravity and the Earth’s magnetic field effect coordinate measurement.", "value": "1"}]}]}, {"name": "4. List the major wavelength/information carrier bands associated with Global Positioning System (GPS) and describe their purpose", "children": [{"name": "Application (A)", "children": [{"name": "Categorize the major wavelength and information carrier bands associated with Global Positioning System (GPS) and describe their purpose.", "value": "1"}]}]}, {"name": "5. Describe the relationship between positioning error and number of visible satellites in a Global Positioning System (GPS) constellation", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the relationship between positioning error and the number of visible satellites in a Global Positioning System (GPS) constellation.", "value": "1"}]}]}, {"name": "6. Define the term \"lag\" as it pertains to the transmission and receiving time for Global Positioning System (GPS) signals and list common causal factors", "children": [{"name": "Application (A)", "children": [{"name": "Distinguish how “lag” relates to the transmission and receiving time of Global Positioning System (GPS) signals.", "value": "1"}, {"name": "Compare/Contrast causal factors that may inhibit the transmission and reception time of Global Positioning System (GPS) signals.", "value": "1"}]}]}, {"name": "7. List the major Global Positioning System (GPS) constellation for the USA, Europe, Russia, and China", "children": [{"name": "Application (A)", "children": [{"name": "Organize the major Global Positioning System (GPS) constellation in order of importance for the United States, Europe, Russia, and China.", "value": "1"}]}]}, {"name": "8. List the factors required for georeferencing imagery and potential sources of error in the georeferencing process", "children": [{"name": "Application (A)", "children": [{"name": "Characterize factors required for georeferencing imagery and summarize the potential sources of error in the georeferencing process.", "value": "1"}]}]}, {"name": "9. List the factors required for orthorectifying imagery and the potential sources of error in the orthorectification process", "children": [{"name": "Application (A)", "children": [{"name": "Characterize factors required for orthorectifying imagery and summarize the potential sources of error in the orthorectification process.", "value": "1"}]}]}, {"name": "10. Define vertical and horizontal control and describe how they are assessed/referenced", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast vertical and horizontal control and how they are assessed and referenced.", "value": "1"}]}]}, {"name": "11. State the precision of measure and absolute accuracy for un-corrected hand-held Global Positioning System (GPS), differential GPS used for navigation, and Real Time Kinematic (RTK) GPS used for surveying", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate the precision of measure and absolute accuracy for the following: un-corrected hand-held Global Positioning System (GPS), differential GPS used for navigation, and Real Time Kinematic (RTK) GPS used for surveying", "value": "1"}]}]}, {"name": "12. Describe the relationship between Global Positioning System (GPS) accuracy and time spent occupying a point", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the relationship between Global Positioning System (GPS) accuracy and the time spent occupying a point.", "value": "1"}]}]}, {"name": "13. Define the term \"epoch\" as it relates to Global Positioning System (GPS)", "children": [{"name": "Application (A)", "children": [{"name": "Interpret how “epoch” relates to Global Positioning System (GPS).", "value": "1"}]}]}, {"name": "14. Define \"false accuracy\" as it relates to positioning devices", "children": [{"name": "Application (A)", "children": [{"name": "Classify how false accuracy changes based on the positioning of devices.", "value": "1"}]}]}, {"name": "15. Identify the approximate accuracy required, per the National Map Accuracy Standard and general convention, for mapping at the following scales: 1:2,400, 1:5,000, 1:10,000, 1:25,000, 1:50,000, 1:100,000, 1:250,000, 1:1,000,000", "children": [{"name": "Application (A)", "children": [{"name": "Determine the appropriate accuracy required for mapping at the following scales based on the National Map Accuracy Standard: 1:2,400, 1:5,000, 1:10,000, 1:25,000, 1:50,000, 1:100,000, 1:250,000, 1:1,000,000", "value": "1"}]}]}, {"name": "16. List the steps involved in geocoding a street address", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the steps involved in geocoding a street address.", "value": "1"}]}]}, {"name": "17. Describe the purpose of an address locator", "children": [{"name": "Application (A)", "children": [{"name": "Classify the reasons why an address locator would be used.", "value": "1"}]}]}, {"name": "18. List sources of error in address geocoding", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the sources of error in address geocoding and why each source of error occurs.", "value": "1"}]}]}]}, {"name": "T4. Spatial Topology", "children": [{"name": "1. Describe fundamental rules for how common geographic features relate to one another (ex: Counties must be within states must be within countries)", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize the fundamental rules for how common geographic features relate to one another.", "value": "1"}]}]}, {"name": "2. Create a Venn diagram which illustrates the spatial relationship among different objects", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Assess the spatial relationships among a group of objects.", "value": "1"}]}]}, {"name": "1. List and describe the fundamental tables required in a geospatial database needed to support topological relationships", "children": [{"name": "Foundational (F)", "children": [{"name": "List and summarize the fundamental tables required in a geospatial database to support topological relationships.", "value": "1"}]}]}, {"name": "2. Define topology", "children": [{"name": "Foundational (F)", "children": [{"name": "Define topology and summarize why it is important to geographic information systems.", "value": "1"}]}]}, {"name": "3. Describe how topologic rules may be used to ensure the integrity of a dataset", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify how topologic rules can verify the integrity of a dataset.", "value": "1"}]}]}, {"name": "4. Identify two or more topologic rules needed to manage a cadastral dataset", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify the various topologic rules used to manage cadastral datasets.", "value": "1"}]}]}, {"name": "5. Describe the use of topology for spatial statistical analysis", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how topology is used for spatial statistical analyses.", "value": "1"}]}]}, {"name": "1. Describe the use of versioned geodatabases in managing topology", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast how different versioned geodatabases are used to manage topology.", "value": "1"}]}]}, {"name": "2. Author appropriate topology rules based on project needs", "children": [{"name": "Application (A)", "children": [{"name": "Determine appropriate topology rules based on the needs of a project.", "value": "1"}]}]}, {"name": "3. Create a logic diagram which illustrates the application of topology to a data model", "children": [{"name": "Application (A)", "children": [{"name": "Determine an appropriate logic diagram that illustrates how to apply topology to a data model.", "value": "1"}]}]}, {"name": "4. List and describe the fundamental tables required to create and maintain topology in a relational database", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the fundamental tables required to create and maintain topology in a relational database.", "value": "1"}]}]}, {"name": "5. Provide two fundamental topologic rules for managing parcel datasets (must not overlap, must not have gaps)", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between the fundamental topologic rules for managing various datasets (e.g., parcel datasets, road network datasets).", "value": "1"}]}]}, {"name": "6. Provide two fundamental topologic rules for managing road network datasets (must not have dangles, must not overshoot)", "children": [{"name": "Application (A)", "children": [{"name": "", "value": "1"}]}]}]}, {"name": "T5. Data Selection and Validation", "children": [{"name": "1. Define precision, accuracy, uncertainty of measure, relative uncertainty, absolute uncertainty of measure.", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Define the following terms and summarize why each are important for selecting and validating data: precision, accuracy, uncertainty of measure, relative uncertainty, absolute uncertainty of measure.", "value": "1"}]}]}, {"name": "2. List System International (SI) and Imperial units for distance, direction, velocity, voltage, luminance, illuminance, energy, and work", "children": [{"name": "Prerequisites (P)", "children": [{"name": "List System International (SI) and Imperial units for the following: distance, direction, velocity, voltage, luminance, illuminance, energy, and work", "value": "1"}]}]}, {"name": "2. Use dimensional analysis to convert units of measure and perform calculations", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Define dimensional analysis and determine when it should and should not be used to convert units of measure.", "value": "1"}]}]}, {"name": "3. Round numbers", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Characterize when it is appropriate to round and truncate numbers.", "value": "1"}]}]}, {"name": "4. Truncate numbers", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Differentiate between rounding and truncation as they relate to data selection and validation.", "value": "1"}]}]}, {"name": "5. Differentiate between rounding and truncation", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "6. Define integer and ratio data", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Characterize integer and ratio data.", "value": "1"}, {"name": "Compare/Contrast integer and ratio data.", "value": "1"}]}]}, {"name": "7. Compare and contrast qualitative and quantitative data", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Compare/Contrast qualitative and quantitative data.", "value": "1"}]}]}, {"name": "8. Use a spreadsheet to create basic tables", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Interpret data in a spreadsheet in order to create basic tables.", "value": "1"}]}]}, {"name": "9. Use a spreadsheet to add, subtract, multiply and divide", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Outline how to perform basic math operations (e.g., addition, subtraction, multiplication, division) in a spreadsheet.", "value": "1"}]}]}, {"name": "1. Calculate simple potential for error using significant digits", "children": [{"name": "Foundational (F)", "children": [{"name": "Determine the simple potential for error using significant digits.", "value": "1"}]}]}, {"name": "2. Compare and contrast precision and accuracy", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the similarities and differences between precision and accuracy.", "value": "1"}]}]}, {"name": "3. Compare and contrast absolute accuracy and relative accuracy", "children": [{"name": "Foundational (F)", "children": [{"name": "Define absolute accuracy and relative accuracy and summarize the relationship between the two.", "value": "1"}]}]}, {"name": "4. List measures of central tendency and measures of dispersion", "children": [{"name": "Foundational (F)", "children": [{"name": "List the different measures of central tendency and measures of dispersion.", "value": "1"}]}]}, {"name": "5. Define and calculate mean, median, mode, frequency, range, and quartile", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how to calculate the following: mean, median, mode, frequency, range, and quartile", "value": "1"}]}]}, {"name": "6. Define and calculate standard deviation, standard error, skewness, and kurtosis", "children": [{"name": "Foundational (F)", "children": [{"name": "Define the following terms and summarize how each is calculated: standard deviation, standard error, skewness, and kurtosis", "value": "1"}]}]}, {"name": "7. Calculate precision of measure", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how the precision of measurement is calculated.", "value": "1"}]}]}, {"name": "8. Calculate relative error and relative uncertainty", "children": [{"name": "Foundational (F)", "children": [{"name": "Define relative error and relative uncertainty and summarize the relationship between the two.", "value": "1"}, {"name": "Summarize how relative error and relative uncertainty are calculated.", "value": "1"}]}]}, {"name": "9. Define random errors", "children": [{"name": "Foundational (F)", "children": [{"name": "Define random error and systematic error and summarize the relationship between the two.", "value": "1"}]}]}, {"name": "10. Define systemic errors", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "11. List common causes of error", "children": [{"name": "Foundational (F)", "children": [{"name": "List common causes of random error and systematic error.", "value": "1"}]}]}, {"name": "12. List and define the means for propagation of error", "children": [{"name": "Foundational (F)", "children": [{"name": "List and define the means for propagation of error.", "value": "1"}]}]}, {"name": "13. Define correlated and independent measures", "children": [{"name": "Foundational (F)", "children": [{"name": "Define correlated and independent measures.", "value": "1"}]}]}, {"name": "14. Identify normal, binomial, and discrete rare event distributions", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify normal, binomial, and discrete rare event distributions.", "value": "1"}]}]}, {"name": "15. Define confidence interval and percent confidence", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the similarities and differences between confidence interval and percent confidence.", "value": "1"}]}]}, {"name": "16. List and describe the potential for error associated with various qualitative sampling methods", "children": [{"name": "Foundational (F)", "children": [{"name": "List and summarize the potential for error associated with various qualitative sampling methods.", "value": "1"}]}]}, {"name": "1. Differentiate among authoritative-, open-, and crowd-sourced data", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate the characteristics among authoritative-sourced data, open-sourced data, and crowd-sourced data.", "value": "1"}]}]}, {"name": "2. Compare and contrast the characteristics of structured vs non-structured data", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the characteristics of structured and non-structured data.", "value": "1"}]}]}, {"name": "3. Describe the fundamental risks associated with crowd-sourced data and suggest methods which may be used to overcome risk", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the fundamental risks associated with crowd-sourced data.", "value": "1"}, {"name": "Determine methods that mitigate against risks associated with crowd-sourced data.", "value": "1"}]}]}, {"name": "4. Define the role of metadata as it relates to geodata", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the types of information that may be included in metadata and summarize how it relates to geodata.", "value": "1"}]}]}, {"name": "5. List at least 5 critical components required in metadata (Author, generation date, attribute descriptions, attribute units of measure, projection and coordinate system, collection scale or resolution, source method, horizontal/vertical accuracy, modification dates)", "children": [{"name": "Application (A)", "children": [{"name": "Categorize the metadata components (e.g., Author, generation date, attribution descriptions, etc.) according to their level of importance (e.g., critical, important, etc.) that are necessary to maintain geospatial data.", "value": "1"}]}]}, {"name": "6. Identify the correct primary data standards organization governing civilian US Federal data standards.", "children": [{"name": "Application (A)", "children": [{"name": "Organize data standards organizations according to whether they govern civilian, United States Federal, United States military, or international geospatial data standards.", "value": "1"}]}]}, {"name": "7. Identify the correct primary data standards organization governing US military data standards.", "children": [{"name": "Application (A)", "children": [{"name": "", "value": "1"}]}]}, {"name": "8. Identify the two international standards organizations for geospatial data", "children": [{"name": "Application (A)", "children": [{"name": "", "value": "1"}]}]}, {"name": "9. Identify the primary US standards organization for units of measure", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast United States and international standards organizations for units of measures.", "value": "1"}]}]}, {"name": "10. Identify the primary international standards organization for units of measure", "children": [{"name": "Application (A)", "children": [{"name": "", "value": "1"}]}]}, {"name": "11. Identify the primary international organization for printed page size", "children": [{"name": "Application (A)", "children": [{"name": "Characterize international standards organizations requirement for printed page size.", "value": "1"}]}]}, {"name": "12. Define the following page sizes: A1, A4, C1, and E1", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the following page sizes and summarize when each is used: A1, A4, C1, and E1", "value": "1"}]}]}, {"name": "13. Describe data and position \"spoofing\"", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast data “spoofing” and position “spoofing” and summarize when each are used.", "value": "1"}]}]}, {"name": "14. Determine requirements for precision and accuracy", "children": [{"name": "Application (A)", "children": [{"name": "Determine the requirements necessary to obtain data precision and data accuracy.", "value": "1"}]}]}, {"name": "15. List and describe the steps used for an error analysis", "children": [{"name": "Application (A)", "children": [{"name": "Verify that the steps necessary to conduct an error analysis have been performed correctly.", "value": "1"}]}]}, {"name": "16. Conduct a methods appropriate error analysis for quantitative and qualitative data sets used to construct geographic layers and their attributes", "children": [{"name": "Application (A)", "children": [{"name": "Determine which error analysis method should be used for quantitative data sets and qualitative data sets to construct geographic layers and their attributes. ", "value": "1"}]}]}, {"name": "17. Use r-squared values to determine appropriateness of use for imagery (example: targeting vs general positioning)", "children": [{"name": "Application (A)", "children": [{"name": "Determine what the most appropriate use of imagery is (e.g., targeting, general positioning) based on the image’s r-squared value.", "value": "1"}]}]}, {"name": "18. List and describe the categories of error as associated with Intelligence Community Directive 203", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate the various categories of error associated with the Intelligence Community Directive (ICD) 203.", "value": "1"}]}]}, {"name": "19. Assess the probability of a Type I and Type II error", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the factors associated with Type I error and Type II error.", "value": "1"}, {"name": "Determine the probability of a Type I error and Type II error occurring.", "value": "1"}]}]}, {"name": "20. Identify the three main categories of error", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the main categories of error and summarize when each occurs.", "value": "1"}]}]}, {"name": "21. List at least 5 common sources of error in geospatial data sets", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the common sources of error found in geospatial data sets.", "value": "1"}]}]}, {"name": "22. Calculate relative error and absolute error", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast relative error and absolute error.", "value": "1"}, {"name": "Characterize how relative error and absolute error are calculated.", "value": "1"}]}]}, {"name": "23. Identify cases where data self-validate a model", "children": [{"name": "Application (A)", "children": [{"name": "Determine whether data is able to self-validate a model.", "value": "1"}]}]}, {"name": "24. Identify when it is appropriate to combine data sets of different ages, spatial resolutions, numeric types, and collection methods", "children": [{"name": "Application (A)", "children": [{"name": "Determine when it is and is not appropriate to combine data sets of different ages, spatial resolutions, numeric types, and collection methods.", "value": "1"}]}]}, {"name": "25. Differentiate among authoritative-, open-, and crowd-sourced data", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate the characteristics among authoritative-sourced data, open-sourced data, and crowd-sourced data.", "value": "1"}]}]}, {"name": "1. Advanced statistical modeling techniques", "children": [{"name": "Mastery/UGP (M/U)", "children": [{"name": "Integrate advanced statistical modeling techniques into geospatial data selection and validation.", "value": "1"}]}]}, {"name": "2. Technical writing skills", "children": [{"name": "Mastery/UGP (M/U)", "children": [{"name": "Generate useable products by utilizing advanced technical writing skills.", "value": "1"}]}]}, {"name": "2. Programming skills", "children": [{"name": "Mastery/UGP (M/U)", "children": [{"name": "Implement advanced programming skills to efficiently and effectively select and validate data.", "value": "1"}]}]}]}, {"name": "T6. Spatial Data Structures and Models", "children": [{"name": "1. Completion of a high school-level computer science course", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Execute basic computer tasks including typing, use of commercial software products, navigating file systems, reading and writing computer files, internet navigation, downloading and uploading files.", "value": "1"}]}]}, {"name": "1. Given a file size and transfer rate, calculate transmission time", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify transmission time given a file’s size and transfer rate.", "value": "1"}]}]}, {"name": "2. Describe how a binary system is used to store, retrieve, and compute data", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize how a binary system is used to store, retrieve, and compute data.", "value": "1"}]}]}, {"name": "3. Differentiate between attribute and geographic components for a spatial data set", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify attribute and geographic components within a spatial data set and summarize the similarities and differences.", "value": "1"}]}]}, {"name": "4. Describe the information needed to construct point, line, and polygon features", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize what information is required to construct point, line, and polygon features.", "value": "1"}]}]}, {"name": "5. Describe the relationship between spatial data file size and spatial resolution", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the relationship between spatial data file size and spatial resolution.", "value": "1"}]}]}, {"name": "6. List the primary considerations when establishing specifications for a spatial data model", "children": [{"name": "Foundational (F)", "children": [{"name": "List the primary considerations necessary to establish specifications for a spatial data model.", "value": "1"}]}]}, {"name": "7. List the primary considerations when selecting geometry type", "children": [{"name": "Foundational (F)", "children": [{"name": "List the primary considerations necessary to select geometry type.", "value": "1"}]}]}, {"name": "1. Describe the following data storage models: flat, hierarchical, network, relational, and graph", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the following data storage models: flat, hierarchical, network, relational, and graph", "value": "1"}]}]}, {"name": "2. Describe the fundamental tables required to create and maintain topology in a relational database", "children": [{"name": "Application (A)", "children": [{"name": "Classify the fundamental tables required to create and maintain topology in a relational database.", "value": "1"}]}]}, {"name": "3. Define dynamic segmentation and linear referencing and provide general descriptions about how these factors are modeled in spatial data structures", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how dynamic segmentation and linear referencing are modeling in spatial data structures.", "value": "1"}]}]}, {"name": "4. List appropriate cell shapes for raster data and compare and contrast their corresponding use cases", "children": [{"name": "Application (A)", "children": [{"name": "Classify which cell shapes are appropriate for use in raster data.", "value": "1"}, {"name": "Compare/Contrast the use cases for cell shapes used in raster data.", "value": "1"}]}]}, {"name": "5. Define tessellation", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how tessellations are developed.", "value": "1"}]}]}, {"name": "6. Describe the structure of a fundamental raster data set. Include information required in the header.", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the structure and components of a fundamental raster data set.", "value": "1"}]}]}, {"name": "7. Identify the shapes associated with entities, attributes, and relationships in Entity-Relationship Diagrams (ERDs)", "children": [{"name": "Application (A)", "children": [{"name": "Categorize shapes associated with entities, attributes, and their relationships in Entity-Relationship Diagrams (ERDs).", "value": "1"}]}]}, {"name": "8. Define cardinality and list the three possible cases", "children": [{"name": "Application (A)", "children": [{"name": "Characterize database cardinality and possible cases associated with cardinality.", "value": "1"}]}]}, {"name": "9. Differentiate between a spatial join and an attribute join", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate a spatial join from an attribute join.", "value": "1"}]}]}, {"name": "10. Differentiate between a relationship class and a related table", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between a relationship class and a related table.", "value": "1"}]}]}, {"name": "11. Given an image resolution and dimensions, calculate its approximate size on disk", "children": [{"name": "Application (A)", "children": [{"name": "Determine the approximate disk size/file size given an image’s resolution and dimensions.", "value": "1"}]}]}, {"name": "12. Describe the purpose of a Redundant Array of Independent/Inexpensive Disks (RAID)", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the purpose of Redundant Array of Independent/Inexpensive Disks (RAID) and differentiate the different levels of RAID.", "value": "1"}]}]}, {"name": "13. Describe cloud computing", "children": [{"name": "Application (A)", "children": [{"name": "Characterize cloud computing and its use in data structures and models.", "value": "1"}]}]}, {"name": "14. Identify appropriate strategies for disaster recovery", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the various strategies for disaster recovery and determine the most appropriate strategy for disaster recovery.", "value": "1"}]}]}, {"name": "15. Describe versioning and identify its potential uses", "children": [{"name": "Application (A)", "children": [{"name": "Characterize versioning and differentiate between its various uses in data structures and models.", "value": "1"}]}]}, {"name": "16. Define parity as it applies to storage solutions and data structures", "children": [{"name": "Application (A)", "children": [{"name": "Characterize parity and compare/contrast how it is applied to data storage solutions and data structures.", "value": "1"}]}]}]}, {"name": "T7. Analytic Techniques Using Geometric and Topologic Relations", "children": [{"name": "1. Completion of a high-school algebra", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize how advanced math principles (e.g., Algebra, trigonometry, geometry, statistics) apply to other fields, such as science.", "value": "1"}]}]}, {"name": "1. Completion of a collegiate-level statistics course", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize statistics principles and concepts apply them to the analysis of geometric and topologic relations.", "value": "1"}]}]}, {"name": "1. Define inverse distance weighted interpolation and identify the equation used", "children": [{"name": "Application (A)", "children": [{"name": "Characterize inverse distance weighted interpolation and how it is calculated.", "value": "1"}]}]}, {"name": "2. Describe a histogram and how it is used for assessing the distribution of data", "children": [{"name": "Application (A)", "children": [{"name": "Characterize histogram distributions and interpret how data is distributed.", "value": "1"}]}]}, {"name": "3. Define normal, binomial, and Poisson distributions and match them to an appropriate use case", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the following distributions and their appropriate use cases: normal, binomial, Poisson", "value": "1"}]}]}, {"name": "4. Describe nearest neighbor analysis", "children": [{"name": "Application (A)", "children": [{"name": "Characterize nearest neighbor analysis.", "value": "1"}]}]}, {"name": "5. State Tobler's Law/First Law of Geography", "children": [{"name": "Application (A)", "children": [{"name": "Characterize Tobler’s First Law of Geography and how it applies to geometric analytic techniques and topologic relations.", "value": "1"}]}]}, {"name": "6. Define momentum and anisotropy as they relate to spatial data sets", "children": [{"name": "Application (A)", "children": [{"name": "Characterize momentum and anisotropy as they relate to spatial data sets.", "value": "1"}]}]}, {"name": "7. Identify the correct application for the following spatial statistics: Geary's C, Moran's I, Getis-Ord Gi*", "children": [{"name": "Application (A)", "children": [{"name": "Determine the correct application for the following spatial statistics: Geary's C, Moran's I, Getis-Ord Gi*", "value": "1"}]}]}, {"name": "8. Differentiate among normal, ordinary, and co-kriging", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate among the following geostatistical methods: normal, ordinary, and co-kriging", "value": "1"}]}]}, {"name": "9. Describe the role of nugget size and lag in kriging", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the role nugget size and lag play in kriging.", "value": "1"}]}]}]}, {"name": "T8. Terrain and 3D Analysis", "children": [{"name": "1. Completion of a high-school level Earth science or geography course", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Outline geography principles (e.g., location, place, relationships, movement, regions) and how they can be used in other fields of study.", "value": "1"}]}]}, {"name": "1. Completion of a collegiate-level physical geography course", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline physical geography principles and how they can be used in other fields of study.", "value": "1"}]}]}, {"name": "2. Basic competency in orienteering/land navigation", "children": [{"name": "Foundational (F)", "children": [{"name": "Outline orienteering/land navigation principles and how they relate to other fields of study.", "value": "1"}]}]}, {"name": "1. Describe line of sight and list three significant application spaces (visual, radio/telecommunications, object flight/trajectory/terrain avoidance)", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how line of sight is used in terrain and 3D analysis.", "value": "1"}, {"name": "Compare/Contrast the significant application spaces (i.e., visual, radio/telecommunications, object flight/trajectory, terrain avoidance) that use line of sight.", "value": "1"}]}]}, {"name": "2. Provide the equation for calculating slope and identify the terms used", "children": [{"name": "Application (A)", "children": [{"name": "Distinguish the components of the equation for calculating the slope of terrain.", "value": "1"}]}]}, {"name": "3. Define the term \"aspect\" as it relates to terrain modeling", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how \"aspect\" relates to terrain modeling.", "value": "1"}]}]}, {"name": "4. Define the term \"hillshade\"", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how \"hillshade\" is used in terrain and 3D analysis.", "value": "1"}]}]}, {"name": "5. Describe the effect of increasing light source angle as it relates to the illumination of a hillshade model", "children": [{"name": "Application (A)", "children": [{"name": "Interpret the illumination of a hillshade model while considering the effect of increasing light source angles.", "value": "1"}, {"name": "Characterize how the increasing light source angle effect influences the illumination of a hillshade model.", "value": "1"}]}]}, {"name": "6. Identify the following major topographic features from a sample topographic map - depression, hill, glacial valley, water valley, saddle, ridge, and cliff", "children": [{"name": "Application (A)", "children": [{"name": "Distinguish the following features on a topographic map: depression, hill, glacial valley, water valley, saddle, ridge, and cliff", "value": "1"}]}]}, {"name": "7. Describe the relationship among day length, latitude/longitude, elevation", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the relationship between day length, latitude, longitude, and elevation.", "value": "1"}]}]}, {"name": "8. Describe the relationship between and object's height, shadow length, time of day, and latitude/longitude", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the relationship between an object's height, shadow length, time of day, and latitude/longitude.", "value": "1"}]}]}, {"name": "9. Select an appropriate color ramp for a given terrain sample", "children": [{"name": "Application (A)", "children": [{"name": "Determine the appropriate color ramp for a given terrain sample.", "value": "1"}]}]}, {"name": "10. List the five basic colors used in topographic maps", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the five basic colors used in topographic maps.", "value": "1"}]}]}, {"name": "11. Match the correct National System for Geospatial-Intelligence (NSG) symbol with the correct topographic map feature", "children": [{"name": "Application (A)", "children": [{"name": "Determine the correct National System for Geospatial-Intelligence (NSG) symbol for a topographic map feature.", "value": "1"}]}]}, {"name": "12. Differentiate among true north, magnetic north, and grid north", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between true north, magnetic north, and grid north.", "value": "1"}]}]}, {"name": "13. Given a declination diagram, calculate Grid-Magnetic (G-M) angle", "children": [{"name": "Application (A)", "children": [{"name": "Determine the Grid-Magnetic (G-M) angle given a declination diagram.", "value": "1"}]}]}, {"name": "14. Given Grid-Magnetic (G-M) angle, convert a grid to magnetic angle and vice-versa", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how to convert a grid angle to a magnetic angle and vice versa when given the Grid-Magnetic (G-M) angle.", "value": "1"}]}]}, {"name": "15. Calculate slope given two elevations", "children": [{"name": "Application (A)", "children": [{"name": "Determine slope given two elevations.", "value": "1"}]}]}, {"name": "16. Interpolate elevation from two contour lines", "children": [{"name": "Application (A)", "children": [{"name": "Determine an interpolated elevation from two contour lines.", "value": "1"}]}]}, {"name": "17. Given a range of elevations and a corresponding horizontal distance, select an appropriate contour line interval", "children": [{"name": "Application (A)", "children": [{"name": "Determine an appropriate contour line interval given a range of elevations and a corresponding horizontal distance.", "value": "1"}]}]}, {"name": "1. Generate a topographic map from imagery and elevation data", "children": [{"name": "Mastery/UGP (M/U)", "children": [{"name": "Generate a topographic map from imagery and elevation data.", "value": "1"}]}]}]}, {"name": "T9. Imagery Analysis", "children": [{"name": "1. Define pixel, tone, contrast, digital number, dynamic range, and brightness as they relate to photography", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Define the following terms: pixel, tone, contrast, digital number, dynamic range, and brightness as they relate to photography", "value": "1"}]}]}, {"name": "2. Label the components of a diagram depicting the major components of a digital camera", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Identify the major components of a digital camera and summarize their purpose.", "value": "1"}]}]}, {"name": "3. Define resolution and image scale", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Define resolution and image scale.", "value": "1"}]}]}, {"name": "4. Perform basic arithmetic", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Connect basic math principles (e.g., averaging, creating bar graphs, discrete numbers, continuous numbers) to other fields of work such as science.", "value": "1"}]}]}, {"name": "5. Create a bar graph", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "6. Average a list of numbers", "children": [{"name": "Prerequisites (P)", "children": [{"name": "", "value": "1"}]}]}, {"name": "7. Differentiate between discrete and continuous numeric data", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Differentiate between discrete and continuous numeric data.", "value": "1"}]}]}, {"name": "8. Describe \"least squares\" and residual", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Define the statistical terms \"least squares\" and residual.", "value": "1"}]}]}, {"name": "1. Completion of a collegiate-level statistics course", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize basic statistics principles and explain how they relate to dynamic range adjustments.", "value": "1"}]}]}, {"name": "1. Define nearest neighbor, least squares, and cubic convolution", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the following terms: nearest neighbor, least squares, and cubic convolution", "value": "1"}]}]}, {"name": "2. Define quantization", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how quantization is used in imagery analysis and list the different methods of performing quantization.", "value": "1"}]}]}, {"name": "3. Define imagery spatial resolution and spectral resolution", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast imagery spatial resolution and spectral resolution.", "value": "1"}]}]}, {"name": "4. Differentiate when it is appropriate to combine images of different resolutions during the analytic process", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate when it is appropriate to combine images of different resolutions during the analytic process.", "value": "1"}]}]}, {"name": "5. Describe the re-sample process and identify when it may be appropriately used", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the re-sample process and determine when it is appropriate to use.", "value": "1"}]}]}, {"name": "6. Define \"down-sampling\"", "children": [{"name": "Application (A)", "children": [{"name": "Distinguish when down-sampling should and should not be used.", "value": "1"}]}]}, {"name": "7. Differentiate between supervised and unsupervised classification", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast supervised and unsupervised classification.", "value": "1"}]}]}, {"name": "8. Define the term spectral signature and identify where the spectral signatures for common objects may be sourced", "children": [{"name": "Application (A)", "children": [{"name": "Characterize what a spectral signature is and identify where the spectral signatures for common objects may be sourced.", "value": "1"}]}]}, {"name": "9. List the conditions necessary for performing \"map algebra\" or the use of mathematics to derive new surfaces/images from combinatorial techniques", "children": [{"name": "Application (A)", "children": [{"name": "Distinguish which conditions are necessary to perform “map algebra.”", "value": "1"}, {"name": "Characterize how mathematics is used to derive new surfaces and images from combinatorial techniques.", "value": "1"}]}]}]}, {"name": "T10. Non-structured Data Analysis", "children": [{"name": "1. Completion of a collegiate-level statistics course", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize basic statistics principles and explain how they relate to dynamic range adjustments.", "value": "1"}]}]}, {"name": "1. Describe methods for estimating the complexity of data", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast methods for estimating the complexity of data.", "value": "1"}]}]}, {"name": "2. Define semantics, taxonomy, semantic analysis, and ontology", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between semantics, taxonomy, semantic analysis, and ontology.", "value": "1"}]}]}, {"name": "3. List common techniques for visualizing un- or partially- structured data", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast common techniques for visualizing un-structured data or partially-structured data.", "value": "1"}]}]}, {"name": "4. Describe the role of data connectors in unstructured data analysis", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the role of data connectors in unstructured data analysis.", "value": "1"}]}]}, {"name": "5. Compare and contrast filtering vs tuning", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast filtering and tuning.", "value": "1"}]}]}, {"name": "6. Define co-occurrence (bigram/unigram pair)", "children": [{"name": "Application (A)", "children": [{"name": "Characterize co-occurrence (bigram/unigram pair).", "value": "1"}]}]}, {"name": "7. Describe the machine learning process", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the machine learning process.", "value": "1"}]}]}]}, {"name": "T11. Scientific Methods and Conceptual Analytic Modeling", "children": [{"name": "1. Differentiate among inductive, deductive, and abductive reasoning", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the inductive, deductive, and abductive reasoning.", "value": "1"}]}]}, {"name": "2. Differentiate among conceptual and logical models", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between conceptual and logical models.", "value": "1"}]}]}, {"name": "3. Select an appropriate hypothesis", "children": [{"name": "Application (A)", "children": [{"name": "Determine an appropriate hypothesis for a given problem.", "value": "1"}]}]}, {"name": "4. Describe Type I and Type II errors as related to hypothesis testing", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast Type I and Type II errors and summarize how each relates to hypothesis testing.", "value": "1"}]}]}, {"name": "5. Complete a table illustrating Type I vs Type II errors", "children": [{"name": "Application (A)", "children": [{"name": "", "value": "1"}]}]}, {"name": "6. Describe the scope and applicability of ICD 206 as it relates to the analytic process", "children": [{"name": "Application (A)", "children": [{"name": "Distinguish how the scope and applicability of Intelligence Community Directive (ICD) 206 relates to the analytic process.", "value": "1"}]}]}, {"name": "7. Define the terms natural law, theory, and theorem", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate the following terms: natural law, theory, theorem", "value": "1"}]}]}, {"name": "8. Define accuracy, precision, absolute error, and relative error", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the following pairs of terms: accuracy vs precision and absolute error vs relative error", "value": "1"}]}]}]}, {"name": "T12. Structure Analytic Techniques", "children": [{"name": "1. Compare and contrast System 1 and System 2 thinking", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast System 1 and System 2 thinking.", "value": "1"}]}]}, {"name": "2. Describe the objectives of applying structured analytic techniques", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the objectives of applying structured analytic techniques to geospatial science.", "value": "1"}]}]}, {"name": "3. Describe the following techniques: Venn diagramming, red team, Devil's advocate, matrices, brainstorming, starbursting, diagnostic reasoning, argument mapping, role playing, Delphi method, structured debate, force field analysis, and SWOT", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the following structed analytic techniques: Venn diagramming, red team, Devil's advocate, matrices, brainstorming, starbursting, diagnostic reasoning, argument mapping, role playing, Delphi method, structured debate, force field analysis, and SWOT", "value": "1"}]}]}, {"name": "4. List the pitfalls associated with small groups", "children": [{"name": "Application (A)", "children": [{"name": "Characterize the challenges associated with small groups of individuals.", "value": "1"}]}]}, {"name": "5. Describe the role of advocacy in structured analytic techniques", "children": [{"name": "Application (A)", "children": [{"name": "Distinguish why advocacy is used in structured analytic techniques.", "value": "1"}]}]}, {"name": "6. Match the appropriate numeric probability with the following subjective terms: remote, highly improbable, improbable, roughly even odds, probable, highly probable, nearly certain", "children": [{"name": "Application (A)", "children": [{"name": "Determine which of following terms should be used based on a given numeric probability: remote, highly improbable, improbable, roughly even odds, probable, highly probable, nearly certain", "value": "1"}]}]}, {"name": "7. Compare and contrast ICD 206 with scientific hypothesis testing (ICD seeks to establish probability of an event occurring whereas the scientific method either supports or refutes a hypothesis)", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast Intelligence Community Directive (ICD) 206 with scientific hypothesis testing.", "value": "1"}]}]}, {"name": "8. Define bias and list at least 10 types", "children": [{"name": "Application (A)", "children": [{"name": "1. Compare/Contrast the following types of biases:", "value": "1"}, {"name": "· cognitive bias", "value": "1"}, {"name": "· conformity bias", "value": "1"}, {"name": "· affinity bias", "value": "1"}, {"name": "· attribution bias", "value": "1"}, {"name": "· confirmation bias", "value": "1"}, {"name": "· halo effect", "value": "1"}, {"name": "· horns effect", "value": "1"}]}]}, {"name": "9. Identify cognitive bias, conformity bias, affinity bias, attribution bias, confirmation bias, halo effect, horns effect, and contrast effect", "children": [{"name": "Application (A)", "children": [{"name": "· contrast effect", "value": "1"}]}]}]}, {"name": "T13. Fundamental Concepts in Geography", "children": [{"name": "1. Complete an introductory Earth Sciences course at the high school level", "children": [{"name": "Prerequisites (P)", "children": [{"name": "1. Summarize how Earth Science principles can be applied to other areas of science.", "value": "1"}]}]}, {"name": "2. Complete one of the following at the high school level: sociology, anthropology, geography, psychology, economics", "children": [{"name": "Prerequisites (P)", "children": [{"name": "1. Summarize how basic social science principles (i.e. sociology, anthropology, geography, psychology, economics) can be utilized in other fields of study.", "value": "1"}]}]}, {"name": "1. Completion of a collegiate human geography and physical geography course", "children": [{"name": "Foundational (F)", "children": [{"name": "1. Summarize how the principles of the following topics are utilized in Geospatial Intelligence (GEOINT):", "value": "1"}, {"name": "· Geography", "value": "1"}, {"name": "· Human geography", "value": "1"}]}]}, {"name": "2. Describe the role of geography in Geospatial Intelligence (GEOINT)", "children": [{"name": "Foundational (F)", "children": [{"name": "· Physical geography", "value": "1"}]}]}, {"name": "3. Define Geospatial Intelligence (GEOINT)", "children": [{"name": "Foundational (F)", "children": [{"name": "1. Define Geospatial Intelligence (GEOINT) and summarize some of its major principles.", "value": "1"}]}]}, {"name": "2. List major events in the history of computer science, geospatial technologies, and geography", "children": [{"name": "Foundational (F)", "children": [{"name": "1. Outline the major events and key figures in the history of computer science, geospatial technologies, and geography.", "value": "1"}]}]}, {"name": "3. Identify key figures in the history of computer science, geospatial technologies, and geography", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "1. Define the roles of human and physical geography in Geospatial Intelligence (GEOINT)", "children": [{"name": "Application (A)", "children": [{"name": "1. Differentiate between the roles of human and physical geography in Geospatial Intelligence (GEOINT).", "value": "1"}]}]}, {"name": "2. List and describe the major application areas for human geography", "children": [{"name": "Application (A)", "children": [{"name": "1. Characterize the major application areas for human geography and physical geography in Geospatial Intelligence (GEOINT).", "value": "1"}]}]}, {"name": "3. List and describe the major application areas for physical geography", "children": [{"name": "Application (A)", "children": [{"name": "", "value": "1"}]}]}, {"name": "4. Describe the following trends in geographic thought - existentialism, Marxism, Realism, Post-modern geography, and feminist geography", "children": [{"name": "Application (A)", "children": [{"name": "1. Compare/Contrast the following trends in geographic thought:", "value": "1"}, {"name": "· Existentialism", "value": "1"}, {"name": "· Marxism", "value": "1"}, {"name": "· Realism", "value": "1"}, {"name": "· Post-modernism", "value": "1"}, {"name": "", "value": "1"}]}]}, {"name": "5. List the three categories of knowledge by Kant", "children": [{"name": "Application (A)", "children": [{"name": "1. Compare/Contrast Kant’s three categories of knowledge.", "value": "1"}]}]}, {"name": "6. Differentiate among the following conceptual pairings of geographic approaches - nomothetic vs descriptive, regional vs systemic, theoretical vs historic-institutional", "children": [{"name": "Application (A)", "children": [{"name": "1. Differentiate among the following conceptual pairings of geographic approaches:", "value": "1"}, {"name": "· nomothetic vs descriptive", "value": "1"}, {"name": "· regional vs systemic", "value": "1"}, {"name": "· theoretical vs historic-institutional", "value": "1"}]}]}, {"name": "7. Compare and contrast meteorology, climatology, and geomorphology", "children": [{"name": "Application (A)", "children": [{"name": "1. Compare/Contrast meteorology, climatology, and geomorphology.", "value": "1"}]}]}, {"name": "8. Define topography", "children": [{"name": "Application (A)", "children": [{"name": "1. Characterize how topography is utilized in physical geography.", "value": "1"}]}]}, {"name": "9. List the major phenomena which weather the Earth's surface and identify their primary physical characteristics in a landscape", "children": [{"name": "Application (A)", "children": [{"name": "1. Compare/Contrast the major phenomena which withstand the Earth’s surface.", "value": "1"}, {"name": "2. Characterize which major phenomena is represented given its primary physical characteristics in a landscape.", "value": "1"}]}]}, {"name": "10. Identify the major stages of the hydrologic cycle when provided a diagram", "children": [{"name": "Application (A)", "children": [{"name": "1. Characterize the major stages of the of the hydrologic cycle using a hydrologic diagram.", "value": "1"}]}]}, {"name": "11. List the six main components of weather", "children": [{"name": "Application (A)", "children": [{"name": "1. Differentiate the six main components of weather.", "value": "1"}]}]}, {"name": "12. Describe plate tectonics", "children": [{"name": "Application (A)", "children": [{"name": "1. Distinguish why plate tectonics is important to understand geography.", "value": "1"}]}]}, {"name": "13. Describe orographic lift and rainshadow", "children": [{"name": "Application (A)", "children": [{"name": "1. Characterize the effects of orographic lift and the rain shadow effects.", "value": "1"}]}]}, {"name": "14. Describe what is meant by an ensemble forecast", "children": [{"name": "Application (A)", "children": [{"name": "1. Characterize what an ensemble forecast is and why it important to geographic information systems.", "value": "1"}]}]}, {"name": "15. List and describe the 5 major climate classes according to the Köppen system", "children": [{"name": "Application (A)", "children": [{"name": "1. Compare/Contrast the Köppen system’s five major climate classes.", "value": "1"}]}]}, {"name": "16. Identify the major effects of the following on the physical geography of a landscape - volcanic eruption, tsunami, earthquakes, and landslides", "children": [{"name": "Application (A)", "children": [{"name": "1. Characterize the major effects the following natural disasters have on the physical geography of a landscape:", "value": "1"}, {"name": "· Volcanic eruptions", "value": "1"}, {"name": "· Tsunamis", "value": "1"}, {"name": "· Earthquakes", "value": "1"}, {"name": "· Landslides", "value": "1"}]}]}, {"name": "17. Differentiate among environmental determinism, possibilism, environmental perception, and cultural determinism", "children": [{"name": "Application (A)", "children": [{"name": "1. Compare/Contrast the following theories:", "value": "1"}, {"name": "· Environmental determinism", "value": "1"}, {"name": "· Possibilism", "value": "1"}, {"name": "· Environmental perception", "value": "1"}, {"name": "· Cultural determinism", "value": "1"}]}]}, {"name": "18. Identify the contributions of Tobler, Miller, EF Codd, Fisher, George Washington, James Clapper, Richard Wells, Abner Martin, Thomas Finnie, Ivan Getting, John Snow, Brad Parkinson, and Mary Sears to Geospatial Intelligence (GEOINT)", "children": [{"name": "Application (A)", "children": [{"name": "1. Distinguish the contributions of the following individuals to the field of Geospatial Intelligence (GEOINT): ", "value": "1"}, {"name": "· Waldo Tobler", "value": "1"}, {"name": "· Harvey J. Miller", "value": "1"}, {"name": "· Edgar Frank Codd", "value": "1"}, {"name": "· Dr. Irene K. Fischer", "value": "1"}, {"name": "· George Washington", "value": "1"}, {"name": "· Lt. Gen. James R. Clapper", "value": "1"}, {"name": "· Maj. Gen. Richard M. Wells", "value": "1"}, {"name": "· Lt. Gen. Abner Martin", "value": "1"}, {"name": "· Thomas C. Finnie", "value": "1"}, {"name": "· Ivan Getting", "value": "1"}, {"name": "· John Snow", "value": "1"}, {"name": "· Brad Parkinson", "value": "1"}, {"name": "· Mary Sears", "value": "1"}]}]}, {"name": "19. Trace the lineage of National Geospatial-Intelligence Agency (NGA) to the start of WWII", "children": [{"name": "Application (A)", "children": [{"name": "1. Order the lineage of National Geospatial-Intelligence Agency (NGA) to the start of WWII.", "value": "1"}]}]}, {"name": "20. Describe the significance of the following events as they pertain to GEOINT Haiti earthquake, Crash of Columbia, Landsat, Ho Chi Minh Trail, OXCART, Apollo 11, KH-9, KH-7, and CORONA", "children": [{"name": "Application (A)", "children": [{"name": "1. Characterize the significance of the following events as they pertain to Geospatial Intelligence (GEOINT): ", "value": "1"}, {"name": "· Haiti earthquake", "value": "1"}, {"name": "· Crash of Columbia", "value": "1"}, {"name": "· Landsat", "value": "1"}, {"name": "· Ho Chi Minh Trail", "value": "1"}, {"name": "· OXCART, Apollo 11", "value": "1"}, {"name": "· KH-9, KH-7", "value": "1"}, {"name": "· CORONA", "value": "1"}]}]}]}, {"name": "T14. Neural Networks/Artificial Intelligence (AI)", "children": [{"name": "1. Experience with statistical and neural network scenario modeling.", "children": [{"name": "Prerequisites (P)", "children": [{"name": "1. Summarize how statistical modeling and neural network scenario modeling is used in Geospatial Intelligence (GEOINT). ", "value": "1"}]}]}, {"name": "2. Knowledge of statistics, probabilities, economics, or ", "children": [{"name": "Prerequisites (P)", "children": [{"name": "1. Summarize the basic principles of statistics, probabilities, and economics and explain how they can be used in other fields.", "value": "1"}]}]}, {"name": "Decision analysis, including optimization methods.", "children": [{"name": "Prerequisites (P)", "children": [{"name": "2. List the various methods of performing a decision analysis.", "value": "1"}]}]}, {"name": "3. knowledge of relational and non-relational database technologies", "children": [{"name": "Prerequisites (P)", "children": [{"name": "1. Differentiate relational and non-relational database technologies.", "value": "1"}]}]}, {"name": "1. The ability to develop and refine machine learning, data mining, and statistical algorithms for pattern recognition, anomaly detection, and prediction", "children": [{"name": "Foundational (F)", "children": [{"name": "1. Outline how machine learning, data mining, and statistical algorithms refine pattern recognition, anomaly detection, and prediction.", "value": "1"}]}]}, {"name": "2. Ability to design, test, and debug software applying Neural networks/Artificial Intelligence (AI) methodologies ", "children": [{"name": "Foundational (F)", "children": [{"name": "1. Outline how neural networks and Artificial Intelligence (AI) are used to design, test, and debug software.", "value": "1"}]}]}, {"name": "1. Recognize differences of Supervised, Unsupervised, and Reinforced learning", "children": [{"name": "Application (A)", "children": [{"name": "1. Differentiate supervised, unsupervised, and reinforced learning and characterize when each should be applied.", "value": "1"}]}]}, {"name": "2. Know when to apply Supervised, Unsupervised, and Reinforced machine learning", "children": [{"name": "Application (A)", "children": [{"name": "", "value": "1"}]}]}, {"name": "1. Apply Regression, Naive Bayesian classifier, Clustering, Matrix Factorization, k-Nearest Neighbors, Natural Language processing, Decision trees, Support Vector Machines, Neural Networks & Deep Learning", "children": [{"name": "Mastery/UGP (M/U)", "children": [{"name": "1. Implement the following techniques when using neural networks and Artificial Intelligence (AI):", "value": "1"}, {"name": "· Regression", "value": "1"}, {"name": "· Naive Bayesian Classifier", "value": "1"}, {"name": "· Clustering", "value": "1"}, {"name": "· Matrix Factorization", "value": "1"}, {"name": "· k-Nearest Neighbors", "value": "1"}, {"name": "· Natural Language Processing", "value": "1"}, {"name": "· Decision Trees", "value": "1"}, {"name": "· Support Vector Machines", "value": "1"}, {"name": "· Deep Learning", "value": "1"}]}]}]}]}, {"name": "REMOTE SENSING", "children": [{"name": "Science Essentials", "children": [{"name": "Units of measure and calculations", "children": [{"name": "Pre-requisite", "children": [{"name": "List SI units of measure used for mass, energy, force, illumination, brightness, wavelength, frequency, length, time, and power. ", "value": "1"}, {"name": "Convert from imperial units of measure to SI units of measure for mass, energy, force, illumination, brightness, wavelength, frequency, length, time, and power. ", "value": "1"}, {"name": "Perform dimensional analysis to determine correct units of measure when solving equations", "value": "1"}, {"name": "Match the appropriate SI prefix to the scientific notation/multiplier (ex., centi -10-2)", "value": "1"}]}]}, {"name": "Fundamental biology", "children": [{"name": "Pre-requisite", "children": [{"name": "Describe the basics of the process of human vision", "value": "1"}, {"name": "Describe the hydrologic cycle", "value": "1"}, {"name": "Describe the process of photosynthesis", "value": "1"}, {"name": "Describe how pigment systems transfer physical energy to chemical energy", "value": "1"}]}]}, {"name": "Scientific processes", "children": [{"name": "Pre-requisite", "children": [{"name": "List the steps in the scientific method", "value": "1"}, {"name": "Formulate a hypothesis and null hypothesis", "value": "1"}, {"name": "Graph data using a histogram, scatterplot, and line graph", "value": "1"}, {"name": "Describe Type I and Type II errors", "value": "1"}]}]}, {"name": "Physics", "children": [{"name": "Pre-requisite", "children": [{"name": "Describe color theory", "value": "1"}, {"name": "Describe conservation of mass and energy", "value": "1"}, {"name": "Describe the conservation of momentum", "value": "1"}, {"name": "Describe the conservation of angular momentum", "value": "1"}, {"name": "Describe Newton's 3 laws of motion", "value": "1"}]}, {"name": "Essentials", "children": [{"name": "Compare and contrast light as a particle and light as a wave", "value": "1"}, {"name": "Describe Planck's law with respect to spectral density, temperature, and a black body", "value": "1"}, {"name": "Describe Stefan-Boltzmann's law with respect to radiant emittance and temperature", "value": "1"}, {"name": "Calculate emissivity when given radiant emittance, Stefan-Boltzmann constant, and temperature", "value": "1"}, {"name": "Define black body, gray body, radiant emittance, energy flux, power, wavelength, and frequency", "value": "1"}, {"name": "Identify the major bandwidth groups associated with the electro-magnetic spectrum", "value": "1"}, {"name": "Define the solar constant and provide its value at the outer-most edge of the Earth's atmosphere", "value": "1"}, {"name": "Describe atmospheric attenuation as it relates to wavelength", "value": "1"}, {"name": "Describe Fraunhofer lines and why they are useful in remote sensing of the Earth", "value": "1"}, {"name": "Define the Law of Conservation of Energy", "value": "1"}, {"name": "Define Raleigh, Mie, and nonselective scattering", "value": "1"}, {"name": "Describe the specific atmospheric absorption effects of ozone, water vapor, and carbon dioxide", "value": "1"}, {"name": "Define the term atmospheric window and identify those most appropriate for remote sensing", "value": "1"}]}]}, {"name": "Mathematics", "children": [{"name": "Pre-requisite", "children": [{"name": "Solve equations requiring basic algebra(no polynomial terms)", "value": "1"}, {"name": "Plot coordinates in a cartesian plane", "value": "1"}, {"name": "Substitute numeric values for constants to solve a polynomial", "value": "1"}, {"name": "Given a set of values, calculate mean, median, mode, frequency, minimum, maximum, standard deviation, skewness, and kurtosis with the aid of a spreadsheet or calculator", "value": "1"}, {"name": "Differentiate between rounding and truncation", "value": "1"}]}, {"name": "Essentials", "children": [{"name": "Create a histogram", "value": "1"}, {"name": "Solve equations using polynomials", "value": "1"}, {"name": "Solve equations using exponents", "value": "1"}, {"name": "Graph polynomial equations", "value": "1"}]}]}, {"name": "Terminology", "children": [{"name": "Essentials", "children": [{"name": "Define the following terms and specify their appropriate units of measure: spectral reflectance, radiant emmitance, energy flux, frequency, emissivity, phase, bandwidth, spectral resolution, illumination, reflectivity, absoprtion, absorbance, transmission, radiance, irradiance, radiometric resolution, ", "value": "1"}, {"name": "Define remote sensing and describe its purpsose", "value": "1"}, {"name": "List the major steps in remote sensing", "value": "1"}]}]}, {"name": "Computer Science", "children": [{"name": "Essentials", "children": [{"name": "Define bit, byte, and binary", "value": "1"}, {"name": "Describe how an RGB pixel renders color", "value": "1"}, {"name": "Describe screen resolution with respect to pixels", "value": "1"}, {"name": "Listy lossy data types", "value": "1"}, {"name": "Compare lossy with non-lossy data compression methods.", "value": "1"}, {"name": "Describe the relationship between pixel depth and data size on disk", "value": "1"}, {"name": "Differentiate between tif, jpg, png, and similar image storage formats", "value": "1"}, {"name": "List commonly used remotely sensed data formats (e.g., Band Interleaved by Line [BIL], Band Interleaved by Pixel [BIP], Band SeQuential [BSQ]) and their uses.", "value": "1"}]}, {"name": "Application", "children": [{"name": "Given appropriate values solve for transmission, absorption, and reflectance.", "value": "1"}, {"name": "Identify the spectral signature of an object", "value": "1"}, {"name": "Describe spectroscopy and its uses", "value": "1"}, {"name": "Identify resources which help with the identification of an object based upon spectral properties", "value": "1"}, {"name": "Given Plank's Law and/or Stefan-Boltzman's Law, identify the variables and constants used", "value": "1"}, {"name": "Given a set of values for an equation with stated units of measure that are not compatible for calculation, convert to appropriate SI units and solve", "value": "1"}, {"name": "Estimate the area under a curve", "value": "1"}, {"name": "Perform compensatory calculations to adjust for atmospheric effects", "value": "1"}, {"name": "Correct for image distortion due to the perspective of the sensor optics, the motion of the scanning system, the motion and (in)stability of the platform, the platform altitude, attitude, and velocity, the terrain relief, and the curvature and rotation of the Earth.", "value": "1"}, {"name": "Differentiate and select the appropriate processing level of data for a given need (L1, L2…)", "value": "1"}, {"name": "Differentiate between and correct for skew and tangential scale distortion", "value": "1"}, {"name": "Describe the relationship between IFOV, sensor resolution, and altitude", "value": "1"}]}, {"name": "Mastery", "children": [{"name": "Solve differential equations", "value": "1"}, {"name": "Code numeric solutions using Taylor approximation and similar computational methods", "value": "1"}, {"name": "Use advanced engineering skills to design and build sensors and systems", "value": "1"}, {"name": "Use advanced engineering skills to design and build launch and delivery systems for remote sensing interests", "value": "1"}]}]}]}, {"name": "Sensors", "children": [{"name": "Digital Sensors", "children": [{"name": "Application", "children": [{"name": "Differentiate between a sensor and a platform", "value": "1"}, {"name": "Compare and contrast sun-synchronous, geo-stationary, and polar orbits", "value": "1"}, {"name": "Compare and contrast ascending and descending orbital trajectories", "value": "1"}, {"name": "Define swath, nadir, and revisit period", "value": "1"}, {"name": "Differentiate between visible, thermal, IR, multi-spectral and hyper-spectral applications", "value": "1"}, {"name": "Define a passive sensor", "value": "1"}, {"name": "Identify passive sensor systems from a list of remote sensing systems", "value": "1"}, {"name": "Define an active sensor", "value": "1"}, {"name": "Identify active sensor systems from a list of remote sensing systems", "value": "1"}, {"name": "Define parallax and view direction", "value": "1"}, {"name": "Given a diagram, label the major components of a single sensing element", "value": "1"}, {"name": "Given a diagram, label the major components of a line sensor system", "value": "1"}, {"name": "Given a diagram, lable the major components of an array sensor system", "value": "1"}, {"name": "Differentiate between across-track and along-track imaging", "value": "1"}, {"name": "Describe how a single sensing element works with linear mechanical motion and a flat sensor arranged as a strip", "value": "1"}, {"name": "Describe how a single sensing element works with linear mechanical motion and a sensor arranged as a ring", "value": "1"}, {"name": "List the general phenomena measured by remote sensing systems (time, intensity, distance)", "value": "1"}, {"name": "Describe the use of the following sensor types: laser altimeter, lidar, rangefinder, scatterometer, sounder, hydrographic echo sounder, radar, and sonar", "value": "1"}, {"name": "Describe the use of the following sensor types: radiometer, spectrometer, spectroradiometer, accelerometer, panchromatic camera, imaging radiometer, and thermal infrared sensor", "value": "1"}, {"name": "Match sensor type to the wavelength in which it measures", "value": "1"}, {"name": "Match the appropriate EM spectrum to the radiometer type provided", "value": "1"}, {"name": "Match sensor types to mission requirements", "value": "1"}, {"name": "Match mission requirements to end-user needs (Example: The end user needs to estimate wildland fire danger)", "value": "1"}, {"name": "Differentiate among K, Ka, Ku, X, C, ERS-1, ERS-2, RADARSAT, S, L, and P microwave bands and their uses", "value": "1"}, {"name": "Differentiate among HH, HV, VV, and VH transmit and receive polarizations and their uses", "value": "1"}, {"name": "Define look angle, slant range distance, and ground range distance", "value": "1"}, {"name": "Describe the purpose and process of increasing azimuth resolution for microwave systems", "value": "1"}, {"name": "Compare and contrast layover and foreshortening", "value": "1"}]}]}, {"name": "Quantization", "children": [{"name": "Application", "children": [{"name": "Describe the process of signal acquisition and transduction from kinetic to potential energy", "value": "1"}, {"name": "Describe the process of sampling as it relates to quantization and pixel size", "value": "1"}, {"name": "Describe dynamic range", "value": "1"}, {"name": "Relate sampling to signal amplitude", "value": "1"}, {"name": "Define quantization", "value": "1"}, {"name": "Compare and contrast linear versus coordinate indexing", "value": "1"}, {"name": "Compare and contrast spatial and intensity resolution", "value": "1"}, {"name": "Describe the relationship between detected intensity and output voltage", "value": "1"}, {"name": "Describe the general process of calibrating sensors", "value": "1"}, {"name": "Relate bit depth to image color", "value": "1"}, {"name": "List the factors which effect sensor calibration and the means used to minimize their influence", "value": "1"}]}]}, {"name": "Film", "children": [{"name": "Application", "children": [{"name": "List three factors contributing the creation of an exposed frame of film, sometimes referred to as the exposure triangle.", "value": "1"}, {"name": "List the units used to measure aperture, film sensitivity, and time", "value": "1"}, {"name": "List the abbrevations commonly used to describe aperture, film sensitivity, and time", "value": "1"}, {"name": "Describe a \"stop\"", "value": "1"}, {"name": "Define, with respect to film, the terms: sensitometry, density, transmission, and opacity", "value": "1"}, {"name": "Describe the relationship between film density and its exposure to light", "value": "1"}, {"name": "Given a sample characteristic curve for film, identify the areas representing mid-tones, highlights, and shadows.", "value": "1"}, {"name": "Relate Dmin and Dmax in film photography to its digital imagery equivalent", "value": "1"}, {"name": "Describe the relationship between contrast and a characteristic curve", "value": "1"}, {"name": "Provide the digital pixel equivalent dimensions for a full frame, 4/3, and 4x6 photograph", "value": "1"}, {"name": "List the standard film speeds from 0 to 800.", "value": "1"}, {"name": "Describe ISO", "value": "1"}, {"name": "Describe the relationship between contrast index and development time", "value": "1"}, {"name": "Describe the process of converting film to digital", "value": "1"}, {"name": "Identify major considerations for converting film to digital format", "value": "1"}, {"name": "Compare and contrast the advantages and disadvantages of multi-band film areal photography with the use of multi-band digital imaging", "value": "1"}, {"name": "Given a case study, select the appropriate satellite platform(s) from among the following for obtaining the needed data: GOES, Landsat, AVHRR, MODIS, DMSP, WordView, SPOT, IRS, MEIS-II, CASI, Nimbus, Sentinel 3B, Sentinel 5, Aqua and SeaWiFS", "value": "1"}]}, {"name": "Mastery", "children": [{"name": "Given a description of a target and the desired use of collected data, select the appropriate sensor package ", "value": "1"}]}]}]}, {"name": "Targets", "children": [{"name": "Film", "children": [{"name": "Mastery", "children": [{"name": "List the potential outcomes for radiation striking a target", "value": "1"}, {"name": "Differentiate between specular and diffuse reflection", "value": "1"}, {"name": "List the major plant phytochemicals and the wavelengths in which they are active", "value": "1"}, {"name": "Describe the effects of seasonality on remote sensing processes associated with vegetative life", "value": "1"}, {"name": "Calculate SVI, NDVI, and ", "value": "1"}, {"name": "Describe the spectral characteristics of water", "value": "1"}, {"name": "Identify how sediment, salinity, temperature, and algae/phytoplankton effect the remote sensing of water", "value": "1"}, {"name": "Describe the effects of AFOV on target detection and interpretation", "value": "1"}, {"name": "Describe the relationship between wavelength and surface roughness", "value": "1"}, {"name": "Define corner reflection and its effects on image interpretation", "value": "1"}, {"name": "Describe the effects of target moisture content on microwave remote sensing images", "value": "1"}, {"name": "Define speckle and the means by which it is overcome", "value": "1"}, {"name": "Define volume scattering and the means by which it is overcome", "value": "1"}, {"name": "Define antenna pattern and the means by which it is overcome", "value": "1"}, {"name": "Describe bi-temporal and multi-temporal characteristics associated with common targets", "value": "1"}, {"name": "Describe stokes vectors in association with common targets and when they are considered", "value": "1"}, {"name": "Describe relief displacement and relate it to terrain types", "value": "1"}, {"name": "", "value": "1"}]}]}]}, {"name": "Positioning", "children": [{"name": "Film", "children": [{"name": "Mastery", "children": [{"name": "Compare and contrast photogrammetry, radargrammetry, and interferometry", "value": "1"}, {"name": "Summarize sensor parameters that should be considered when performing geometric registration.", "value": "1"}, {"name": "Describe the process of using polarization to determine elevation", "value": "1"}, {"name": "Describe the use of fiduciary marks", "value": "1"}, {"name": "Differentiate among orthometric height and elevation", "value": "1"}, {"name": "Describe the purpose and process of deriving elevation from visible imagery", "value": "1"}, {"name": "Define ground reference points and their use in positioning an image", "value": "1"}, {"name": "Describe the process of using a least squares method to adjust the position of an image", "value": "1"}, {"name": "Describe the errors created by adjusting the position of an image using rubber sheeting, rotation, and least squares fitting", "value": "1"}, {"name": "Describe the process, advantages, and disadvantages of mosaiking an image set with respect to positioning", "value": "1"}, {"name": "", "value": "1"}, {"name": "Create algorithms for positioning imagery with respect to custom coordinate systems, locations with extreme terrain relief, and fine scale needs", "value": "1"}, {"name": "Develop automated systems for positioning imagery", "value": "1"}]}]}]}, {"name": "Image Analysis and Signal Processing", "children": [{"name": "Film", "children": [{"name": "Mastery", "children": [{"name": "Describe metadata", "value": "1"}, {"name": "List the key elements required for metadata with respect to most all remote sensing products", "value": "1"}, {"name": "Describe phase and phase differentiation", "value": "1"}, {"name": "Describe the additional concerns needed for terrestrial image processing", "value": "1"}, {"name": "Differentiate situations for which repeat photography would and would not be appropriate.", "value": "1"}, {"name": "Describe repeat photography", "value": "1"}, {"name": "Define the traceability of standards and describe why it important and customary practice when performing radiometric corrections and calibrations.", "value": "1"}, {"name": "Characterize how cross-sensor radiometric correction is different from other correction techniques.", "value": "1"}, {"name": "List and describe the major steps for color correction", "value": "1"}, {"name": "Summarize how a contrast stretch is performed and what in the data would indicate that it should be performed.", "value": "1"}, {"name": "Outline the differences between continuous and discrete representations of image histograms.", "value": "1"}, {"name": "Define probability density.", "value": "1"}, {"name": "Summarize the purpose of probability density.", "value": "1"}, {"name": "Outline the different cumulative distribution functions and why each is used.", "value": "1"}, {"name": "Discern when histogram matching/equalization should be performed and explain the steps needing to be performed.", "value": "1"}, {"name": "Differentiate the various histogram segmentation methods and how to know when each method should be used.", "value": "1"}, {"name": "Describe pan-sharpening and when it is used", "value": "1"}, {"name": "Summarize what orthogonal subspaces are and how they are used in Principal Components Analysis.", "value": "1"}, {"name": "Summarize the concept of separability and why a separability analysis would be performed.", "value": "1"}, {"name": "Define data reduction.", "value": "1"}, {"name": "Outline the various data reduction concepts and the role they play in Principal Components Analysis.", "value": "1"}, {"name": "Interpret Principal Components", "value": "1"}, {"name": "Transformation/Principal Components Analysis (PCT/PCA) output to determine if the results should be used.", "value": "1"}, {"name": "Discern where certain Principal Components Transformation/Principal Components Analysis (PCT/PCA) output are located.", "value": "1"}, {"name": "Interpret Principal Components Transformation/Principal Components Analysis (PCT/PCA) output to determine if the results should be used.", "value": "1"}, {"name": "Perform basic Principal Components Transformation / Principal Components Analysis tasks using an electronic light table (ELT) and related software.", "value": "1"}, {"name": "Differentiate between the spectral and temporal uses of Principal Components Transformation/Principal Components Analysis (PCT/PCA) output.", "value": "1"}, {"name": "Differentiate between various algorithms related to Principal Components Transformation/Principal Components Analysis (PCT/PCA; e.g., Independent Component Analysis (ICA), Minimum/Maximum Noise Fraction (MNF)) and why they would be used.", "value": "1"}, {"name": "Describe the Tasseled Cap (Kauth-Thomas) transformation and when it is used", "value": "1"}, {"name": "Describe how each of the following factors effects image interpretation: tone, shape, size, pattern, texture, shadow, and association", "value": "1"}, {"name": "Define the following major image processing steps and their associated events: Preprocessing, Image Enhancement, Image Transformation, Image Classification and Analysis", "value": "1"}, {"name": "Describe the following processing techniques and their uses: spatial filtering, band ratioing, and principle components analysis", "value": "1"}, {"name": "Define striping and dropped lines and the processes used to correct for them", "value": "1"}, {"name": "Compare and contrast bilinear interpoation, nearest neighbor, and cubic convolution", "value": "1"}, {"name": "Match the appropriate processing case for using bilinear interpolation, neareast neighbor analysis, and cubic convolution", "value": "1"}, {"name": "Compare and contrast linear contrast stretch and histogram equalize stretch", "value": "1"}, {"name": "Compare and contrast low- and high-pass filtering and their associated used cases", "value": "1"}, {"name": "Describe the process of edge detection", "value": "1"}, {"name": "Describe the use cases for supervised vs unsupervised classification", "value": "1"}, {"name": "Describe the General Image Quality Equation and its use case", "value": "1"}, {"name": "Describe the National Image Interpretability Rating Scale and its use case", "value": "1"}, {"name": "Characterize when it is and when it is not necessary to perform a radiometric calibration", "value": "1"}, {"name": "Differentiate between ground sample distance, pixel size, and lidar point spacing and explain how each are used.", "value": "1"}, {"name": "Identify instances when mutliple types of sensor data must be integrated (fused) to solve a problem.", "value": "1"}, {"name": "Describe the process of data integration (fusion)", "value": "1"}, {"name": "Identify what it means to \"tip and cue\" among remote sensing systems", "value": "1"}, {"name": "Develop numerical methods for improved signal and image processing", "value": "1"}, {"name": "Establish methods of interpreting and manipulating data within multivariate histograms.", "value": "1"}, {"name": "Define which statistical methods for classification (e.g., maximum likelihood, Mahalanobis distance) should be used to produce class maps.", "value": "1"}]}]}]}, {"name": "Geographic Information Systems", "children": [{"name": "1. Perform addition and subtraction using a number line", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Summarize how a number line can be used to perform basic math functions (e.g., addition and subtraction).", "value": "1"}]}]}, {"name": "2. Plot an x,y point using a cartesian coordinate system based graph", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Discern where an x,y point should be plotted on a graph using a cartesian coordinate system.", "value": "1"}, {"name": "Discern where an x,y point should be plotted on a graph using a polar coordinate system.", "value": "1"}]}]}, {"name": "3. Plot a point using a polar coordinate system", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Compare/Contrast various coordinate systems (e.g., cartesian, polar, etc.).", "value": "1"}]}]}, {"name": "4. Connect ordered points on a graph together using a line", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Identify how ordered points on a graph should be connected.", "value": "1"}]}]}, {"name": "5. Solve for any one side of a triangle using the Pythagorean Theorem", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Determine the length of one side of a triangle using the Pythagorean Theorem.", "value": "1"}]}]}, {"name": "6. Trace a feature", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Define what it means to trace a feature and outline the steps taken to perform a trace.", "value": "1"}]}]}, {"name": "7. Connect ordered dots", "children": [{"name": "Prerequisites (P)", "children": [{"name": "Determine how ordered dots should be connected.", "value": "1"}]}]}, {"name": "1. Calculate angular displacement for polar and cartesian coordinate system", "children": [{"name": "Foundational (F)", "children": [{"name": "Define angular displacement and summarize how it is calculated for a polar and cartesian coordinate system.", "value": "1"}]}]}, {"name": "2. List and describe the relationship among the general tables used for vector data models", "children": [{"name": "Foundational (F)", "children": [{"name": "List the general tables used for vector data models and summarize their uses.", "value": "1"}, {"name": "Outline the relationship between the various general tables used for vector data models.", "value": "1"}]}]}, {"name": "3. Define the three fundamental geometries", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the role points, lines, polygons, and surfaces play in vectorization.", "value": "1"}]}]}, {"name": "4. Describe the relationship between image resolution and positional error for digitized features", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the relationship between image resolution and positional error for digitized features.", "value": "1"}]}]}, {"name": "5. Describe the relationship between image resolution and feature shape/identification", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the relationship between image resolution and feature shape/identification.", "value": "1"}]}]}, {"name": "6. Describe the effect of caching of imagery on the digitizing process", "children": [{"name": "Foundational (F)", "children": [{"name": "Summarize the effect caching of imagery has on the digitizing process.", "value": "1"}]}]}, {"name": "7. Match effective/appropriate scale to imagery resolution when digitizing features", "children": [{"name": "Foundational (F)", "children": [{"name": "Identify the most effective and appropriate scale to use when digitizing features given the resolution of an image.", "value": "1"}]}]}, {"name": "8. Define supervised imagery classification", "children": [{"name": "Foundational (F)", "children": [{"name": "Compare supervised imagery classification and unsupervised imagery classification and summarize how each are used when digitizing images.", "value": "1"}]}]}, {"name": "9. Define unsupervised imagery classification", "children": [{"name": "Foundational (F)", "children": [{"name": "", "value": "1"}]}]}, {"name": "10. List the advantages and disadvantages of converting raster to vector data", "children": [{"name": "Foundational (F)", "children": [{"name": "Compare the advantages and disadvantages of converting raster data to vector data.", "value": "1"}, {"name": "Summarize the process taken to convert raster data into vector data.", "value": "1"}]}]}, {"name": "11. Define attribute", "children": [{"name": "Foundational (F)", "children": [{"name": "Define what an attribute is and summarize the purpose it has in the digitization of an image.", "value": "1"}]}]}, {"name": "12. Define attribute data types (text, Boolean, single precision, double precision, date, and time)", "children": [{"name": "Foundational (F)", "children": [{"name": "List the different attribute data types and summarize the role they play in the digitization of images.", "value": "1"}]}]}, {"name": "13. Explain the relationship between scale and vertex placement", "children": [{"name": "Foundational (F)", "children": [{"name": "Define scale and vertex placement and outline the relationship they have with each other.", "value": "1"}]}]}, {"name": "1. Perform simple arithmetic involving coordinates", "children": [{"name": "Application (A)", "children": [{"name": "Determine the appropriate arithmetic that should be performed on coordinates based on how the coordinates will be used.", "value": "1"}]}]}, {"name": "2. Select an appropriate spacing of vertices with respect to source imagery scale", "children": [{"name": "Application (A)", "children": [{"name": "Determine the how vertices should be spaced given the scale of a source image.", "value": "1"}]}]}, {"name": "3. Select an appropriate scale for digitizing features based upon source imagery resolution", "children": [{"name": "Application (A)", "children": [{"name": "Determine what scale should be used to digitize features given the resolution of a source image.", "value": "1"}]}]}, {"name": "4. Draw a basic data model for point, polyline, and polygon data", "children": [{"name": "Application (A)", "children": [{"name": "Characterize how basic data models change when they are developed for point, polyline, and polygon data.", "value": "1"}]}]}, {"name": "5. Define attribute data types (float, double, text, Boolean, and similar)", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast float, double, test, and Boolean attribute data types.", "value": "1"}]}]}, {"name": "6. List and describe at least three means for smoothing digitized features", "children": [{"name": "Application (A)", "children": [{"name": "Compare/Contrast the different means for smoothing digitized features.", "value": "1"}]}]}, {"name": "7. List and describe at least three methods for simplifying complex features when digitizing", "children": [{"name": "Application (A)", "children": [{"name": "Differentiate between the various methods used to simplify complex features when digitizing images.", "value": "1"}]}]}, {"name": "8. Digitize route features into a geographic network (m-values)", "children": [{"name": "Application (A)", "children": [{"name": "Determine how digitized route features should be converted into a geographic network (i.e., m-values).", "value": "1"}]}]}, {"name": "9. Digitize terrain features with elevation into a topographic data model (z-values)", "children": [{"name": "Application (A)", "children": [{"name": "Determine how elevated terrain features should be converted in a topographic data model (i.e., z-values).", "value": "1"}]}]}, {"name": "10. Digitize features with respect to time (spatio-temporal representation)", "children": [{"name": "Application (A)", "children": [{"name": "Interpret how features can be digitized with respect to time (i.e., spatio-temporal representation).", "value": "1"}]}]}, {"name": "11. Given a set of bearings and distances, create a polygon or line as appropriate", "children": [{"name": "Application (A)", "children": [{"name": "Determine what polygon or line should be created (e.g., polygon, line) given a set of bearings and distances.", "value": "1"}]}]}, {"name": "1. Statistical methods for smoothing features", "children": [{"name": "Mastery/UGP (M/U)", "children": [{"name": "Evaluate the advantages and disadvantages of current statistical methods for smoothing features to develop more efficient methods.", "value": "1"}]}]}, {"name": "2. Statistical methods for interpolating missing points/vertices", "children": [{"name": "Mastery/UGP (M/U)", "children": [{"name": "Establish methods for interpolating missing points and/or vertices in an image.", "value": "1"}]}]}, {"name": "3. Design 4D data models which support vectorization", "children": [{"name": "Mastery/UGP (M/U)", "children": [{"name": "Establish methods for developing 4D data models that support vectorization.", "value": "1"}]}]}]}, {"name": "Application Basics", "children": [{"name": "null", "children": [{"name": "Mastery/UGP (M/U)", "children": [{"name": "Describe how remote sensing may be used for crop monitoring at various temporal scales (intra-day, intra-week, intra-month, growth stage, yield prediction)", "value": "1"}, {"name": "Describe how remote sensing may be used for crop damage assessment", "value": "1"}, {"name": "Describe the applications of remote sensing to forestry management for commercial production purposes (speciation, size/harvest estimate, and similar)", "value": "1"}, {"name": "Describe the applications of remote sensing to forest disease management", "value": "1"}, {"name": "Describe the application of remote sensing to fire danger and fire behavior forecasting", "value": "1"}, {"name": "Describe the role of and techniques used for remote sensing in climate monitoring", "value": "1"}, {"name": "Describe the role of and techniques used for remote sensing in environmental monitoring", "value": "1"}, {"name": "Describe the role of and techniques used for remote sensing in arms monitoring", "value": "1"}, {"name": "Describe the role of and techniques used for remote sensing in battle planning", "value": "1"}, {"name": "Describe the role of and techniques used for remote sensing in anti-terror planning", "value": "1"}, {"name": "Describe the role of and techniques used for geological mapping and monitoring", "value": "1"}, {"name": "Describe the role of and techniques used for remote sensing in weather forecasting", "value": "1"}, {"name": "Describe the role of and techniques used for remote sensing in hydrology and hydraulic modeling", "value": "1"}, {"name": "Describe the role of and techniques used for remote sensing in utilities and pipeline mapping and monitoring", "value": "1"}]}]}]}, {"name": "Flight Planning and Operations", "children": [{"name": "null", "children": [{"name": "Mastery/UGP (M/U)", "children": [{"name": "List the major steps involved with planning an aerial platform-based remote sensing mission", "value": "1"}, {"name": "Identify the advantages and disadvantages among the different types of orbits used by remote sensing platforms.", "value": "1"}, {"name": "Identify the advantages and disadvantages between high- and low-altitude UAV's", "value": "1"}, {"name": "", "value": "1"}]}]}]}, {"name": "Ethics and Legal Concerns", "children": [{"name": "null", "children": [{"name": "Mastery/UGP (M/U)", "children": [{"name": "State the FAA regulations governing the use of un-manned aircraft", "value": "1"}, {"name": "State the FAA conditions required for hobbyist use of un-manned aircraft", "value": "1"}, {"name": "Discern when operation of an un-manned aircraft is un-safe per FAA guidelines", "value": "1"}, {"name": "Define the purpose of the United Nations COPOUS", "value": "1"}, {"name": "Summarize each of the 15 principles relating to remote sensing of the Earth from Outer Space as defined by the United Nations General Assembly", "value": "1"}, {"name": "Differentiate between ethics and codes of conduct", "value": "1"}, {"name": "State basic ethical principles related to remote sensing", "value": "1"}]}]}]}, {"name": "Stereo Imaging", "children": [{"name": "null", "children": [{"name": "Mastery/UGP (M/U)", "children": [{"name": "Define stereoscopic visualization", "value": "1"}, {"name": "Explain how advanced math principles apply to stereoscopic visualization.", "value": "1"}, {"name": "Outline how basic optical principles (e.g., aperture size, focal length etc.) play a role in the stereoscopic visualization of remote sensed data.", "value": "1"}, {"name": "Define parallax.", "value": "1"}, {"name": "List the various parallax concepts (e.g., parallax difference, Y parallax, etc.) and their purpose.", "value": "1"}, {"name": "Summarize what relief displacement is and the different types of displacements that occur.", "value": "1"}, {"name": "Define Digital Elevation Model (DEM).", "value": "1"}, {"name": "Describe how a DEM is made.", "value": "1"}, {"name": "Define Digital Terrain Model (DTM)", "value": "1"}, {"name": "Define Digital Surface Model (DSM)", "value": "1"}, {"name": "Compare/contrast the various stereoscopic visualization methods.", "value": "1"}, {"name": "Distinguish which stereoscopic visualization method should be used for a given set of data.", "value": "1"}, {"name": "Discern the most appropriate way to turn data into a three-dimensional (3D) rendering or visualization.", "value": "1"}, {"name": "Define Structure from motion (SfM)", "value": "1"}]}, {"name": "Mastery", "children": [{"name": "Specify methods on how to derive three-dimensional (3D) information from images taken from different perspectives. ", "value": "1"}, {"name": "Define three-dimensional (3D) rendering.", "value": "1"}, {"name": "Evaluate the advantages and disadvantages of current three-dimensional (3D) rendering techniques to develop more accurate, efficient techniques.", "value": "1"}, {"name": "Design methods of creating stereoscopic Digital Elevation Models (DEM).", "value": "1"}, {"name": "Summarize the steps taken to perform basic digital image processing.", "value": "1"}]}]}]}]}]}